Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---                      Peripheral Registers_Bits_Definition
//
//  This File is derived from the STM32L432 bit definition file created by ST Micro Electronics
//  Which is copyrighted  (C)2021 ST Micro Electronics
//
//
//  The defines have been modified to work seamlessly with the Quorb Inc Register definitions
//  Coptright (C) 2021 Quorb Inc
//
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_ISR register
//---------------------------------------------------------------------------------------------
#define ADC_ISR_ADRDY_Pos              (0U)
#define ADC_ISR_ADRDY_Msk              (0x1UL << ADC_ISR_ADRDY_Pos)            //--- 0x00000001
#define ADC_ISR_ADRDY                  ADC_ISR_ADRDY_Msk                       //--- ADC ready flag
#define ADC_ISR_EOSMP_Pos              (1U)
#define ADC_ISR_EOSMP_Msk              (0x1UL << ADC_ISR_EOSMP_Pos)            //--- 0x00000002
#define ADC_ISR_EOSMP                  ADC_ISR_EOSMP_Msk                       //--- ADC group regular end of sampling flag
#define ADC_ISR_EOC_Pos                (2U)
#define ADC_ISR_EOC_Msk                (0x1UL << ADC_ISR_EOC_Pos)              //--- 0x00000004
#define ADC_ISR_EOC                    ADC_ISR_EOC_Msk                         //--- ADC group regular end of unitary conversion flag
#define ADC_ISR_EOS_Pos                (3U)
#define ADC_ISR_EOS_Msk                (0x1UL << ADC_ISR_EOS_Pos)              //--- 0x00000008
#define ADC_ISR_EOS                    ADC_ISR_EOS_Msk                         //--- ADC group regular end of sequence conversions flag
#define ADC_ISR_OVR_Pos                (4U)
#define ADC_ISR_OVR_Msk                (0x1UL << ADC_ISR_OVR_Pos)              //--- 0x00000010
#define ADC_ISR_OVR                    ADC_ISR_OVR_Msk                         //--- ADC group regular overrun flag
#define ADC_ISR_JEOC_Pos               (5U)
#define ADC_ISR_JEOC_Msk               (0x1UL << ADC_ISR_JEOC_Pos)             //--- 0x00000020
#define ADC_ISR_JEOC                   ADC_ISR_JEOC_Msk                        //--- ADC group injected end of unitary conversion flag
#define ADC_ISR_JEOS_Pos               (6U)
#define ADC_ISR_JEOS_Msk               (0x1UL << ADC_ISR_JEOS_Pos)             //--- 0x00000040
#define ADC_ISR_JEOS                   ADC_ISR_JEOS_Msk                        //--- ADC group injected end of sequence conversions flag
#define ADC_ISR_AWD1_Pos               (7U)
#define ADC_ISR_AWD1_Msk               (0x1UL << ADC_ISR_AWD1_Pos)             //--- 0x00000080
#define ADC_ISR_AWD1                   ADC_ISR_AWD1_Msk                        //--- ADC analog watchdog 1 flag
#define ADC_ISR_AWD2_Pos               (8U)
#define ADC_ISR_AWD2_Msk               (0x1UL << ADC_ISR_AWD2_Pos)             //--- 0x00000100
#define ADC_ISR_AWD2                   ADC_ISR_AWD2_Msk                        //--- ADC analog watchdog 2 flag
#define ADC_ISR_AWD3_Pos               (9U)
#define ADC_ISR_AWD3_Msk               (0x1UL << ADC_ISR_AWD3_Pos)             //--- 0x00000200
#define ADC_ISR_AWD3                   ADC_ISR_AWD3_Msk                        //--- ADC analog watchdog 3 flag
#define ADC_ISR_JQOVF_Pos              (10U)
#define ADC_ISR_JQOVF_Msk              (0x1UL << ADC_ISR_JQOVF_Pos)            //--- 0x00000400
#define ADC_ISR_JQOVF                  ADC_ISR_JQOVF_Msk                       //--- ADC group injected contexts queue overflow flag

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_IER register
//---------------------------------------------------------------------------------------------
#define ADC_IER_ADRDYIE_Pos            (0U)
#define ADC_IER_ADRDYIE_Msk            (0x1UL << ADC_IER_ADRDYIE_Pos)          //--- 0x00000001
#define ADC_IER_ADRDYIE                ADC_IER_ADRDYIE_Msk                     //--- ADC ready interrupt
#define ADC_IER_EOSMPIE_Pos            (1U)
#define ADC_IER_EOSMPIE_Msk            (0x1UL << ADC_IER_EOSMPIE_Pos)          //--- 0x00000002
#define ADC_IER_EOSMPIE                ADC_IER_EOSMPIE_Msk                     //--- ADC group regular end of sampling interrupt
#define ADC_IER_EOCIE_Pos              (2U)
#define ADC_IER_EOCIE_Msk              (0x1UL << ADC_IER_EOCIE_Pos)            //--- 0x00000004
#define ADC_IER_EOCIE                  ADC_IER_EOCIE_Msk                       //--- ADC group regular end of unitary conversion interrupt
#define ADC_IER_EOSIE_Pos              (3U)
#define ADC_IER_EOSIE_Msk              (0x1UL << ADC_IER_EOSIE_Pos)            //--- 0x00000008
#define ADC_IER_EOSIE                  ADC_IER_EOSIE_Msk                       //--- ADC group regular end of sequence conversions interrupt
#define ADC_IER_OVRIE_Pos              (4U)
#define ADC_IER_OVRIE_Msk              (0x1UL << ADC_IER_OVRIE_Pos)            //--- 0x00000010
#define ADC_IER_OVRIE                  ADC_IER_OVRIE_Msk                       //--- ADC group regular overrun interrupt
#define ADC_IER_JEOCIE_Pos             (5U)
#define ADC_IER_JEOCIE_Msk             (0x1UL << ADC_IER_JEOCIE_Pos)           //--- 0x00000020
#define ADC_IER_JEOCIE                 ADC_IER_JEOCIE_Msk                      //--- ADC group injected end of unitary conversion interrupt
#define ADC_IER_JEOSIE_Pos             (6U)
#define ADC_IER_JEOSIE_Msk             (0x1UL << ADC_IER_JEOSIE_Pos)           //--- 0x00000040
#define ADC_IER_JEOSIE                 ADC_IER_JEOSIE_Msk                      //--- ADC group injected end of sequence conversions interrupt
#define ADC_IER_AWD1IE_Pos             (7U)
#define ADC_IER_AWD1IE_Msk             (0x1UL << ADC_IER_AWD1IE_Pos)           //--- 0x00000080
#define ADC_IER_AWD1IE                 ADC_IER_AWD1IE_Msk                      //--- ADC analog watchdog 1 interrupt
#define ADC_IER_AWD2IE_Pos             (8U)
#define ADC_IER_AWD2IE_Msk             (0x1UL << ADC_IER_AWD2IE_Pos)           //--- 0x00000100
#define ADC_IER_AWD2IE                 ADC_IER_AWD2IE_Msk                      //--- ADC analog watchdog 2 interrupt
#define ADC_IER_AWD3IE_Pos             (9U)
#define ADC_IER_AWD3IE_Msk             (0x1UL << ADC_IER_AWD3IE_Pos)           //--- 0x00000200
#define ADC_IER_AWD3IE                 ADC_IER_AWD3IE_Msk                      //--- ADC analog watchdog 3 interrupt
#define ADC_IER_JQOVFIE_Pos            (10U)
#define ADC_IER_JQOVFIE_Msk            (0x1UL << ADC_IER_JQOVFIE_Pos)          //--- 0x00000400
#define ADC_IER_JQOVFIE                ADC_IER_JQOVFIE_Msk                     //--- ADC group injected contexts queue overflow interrupt

//---------------------------------------------------------------------------------------------
//----Legacy ADC defines
//---------------------------------------------------------------------------------------------
#define ADC_IER_ADRDY           (ADC_IER_ADRDYIE)
#define ADC_IER_EOSMP           (ADC_IER_EOSMPIE)
#define ADC_IER_EOC             (ADC_IER_EOCIE)
#define ADC_IER_EOS             (ADC_IER_EOSIE)
#define ADC_IER_OVR             (ADC_IER_OVRIE)
#define ADC_IER_JEOC            (ADC_IER_JEOCIE)
#define ADC_IER_JEOS            (ADC_IER_JEOSIE)
#define ADC_IER_AWD1            (ADC_IER_AWD1IE)
#define ADC_IER_AWD2            (ADC_IER_AWD2IE)
#define ADC_IER_AWD3            (ADC_IER_AWD3IE)
#define ADC_IER_JQOVF           (ADC_IER_JQOVFIE)

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_CR register
//---------------------------------------------------------------------------------------------
#define ADC_CR_ADEN_Pos                (0U)
#define ADC_CR_ADEN_Msk                (0x1UL << ADC_CR_ADEN_Pos)              //--- 0x00000001
#define ADC_CR_ADEN                    ADC_CR_ADEN_Msk                         //--- ADC enable
#define ADC_CR_ADDIS_Pos               (1U)
#define ADC_CR_ADDIS_Msk               (0x1UL << ADC_CR_ADDIS_Pos)             //--- 0x00000002
#define ADC_CR_ADDIS                   ADC_CR_ADDIS_Msk                        //--- ADC disable
#define ADC_CR_ADSTART_Pos             (2U)
#define ADC_CR_ADSTART_Msk             (0x1UL << ADC_CR_ADSTART_Pos)           //--- 0x00000004
#define ADC_CR_ADSTART                 ADC_CR_ADSTART_Msk                      //--- ADC group regular conversion start
#define ADC_CR_JADSTART_Pos            (3U)
#define ADC_CR_JADSTART_Msk            (0x1UL << ADC_CR_JADSTART_Pos)          //--- 0x00000008
#define ADC_CR_JADSTART                ADC_CR_JADSTART_Msk                     //--- ADC group injected conversion start
#define ADC_CR_ADSTP_Pos               (4U)
#define ADC_CR_ADSTP_Msk               (0x1UL << ADC_CR_ADSTP_Pos)             //--- 0x00000010
#define ADC_CR_ADSTP                   ADC_CR_ADSTP_Msk                        //--- ADC group regular conversion stop
#define ADC_CR_JADSTP_Pos              (5U)
#define ADC_CR_JADSTP_Msk              (0x1UL << ADC_CR_JADSTP_Pos)            //--- 0x00000020
#define ADC_CR_JADSTP                  ADC_CR_JADSTP_Msk                       //--- ADC group injected conversion stop
#define ADC_CR_ADVREGEN_Pos            (28U)
#define ADC_CR_ADVREGEN_Msk            (0x1UL << ADC_CR_ADVREGEN_Pos)          //--- 0x10000000
#define ADC_CR_ADVREGEN                ADC_CR_ADVREGEN_Msk                     //--- ADC voltage regulator enable
#define ADC_CR_DEEPPWD_Pos             (29U)
#define ADC_CR_DEEPPWD_Msk             (0x1UL << ADC_CR_DEEPPWD_Pos)           //--- 0x20000000
#define ADC_CR_DEEPPWD                 ADC_CR_DEEPPWD_Msk                      //--- ADC deep power down enable
#define ADC_CR_ADCALDIF_Pos            (30U)
#define ADC_CR_ADCALDIF_Msk            (0x1UL << ADC_CR_ADCALDIF_Pos)          //--- 0x40000000
#define ADC_CR_ADCALDIF                ADC_CR_ADCALDIF_Msk                     //--- ADC differential mode for calibration
#define ADC_CR_ADCAL_Pos               (31U)
#define ADC_CR_ADCAL_Msk               (0x1UL << ADC_CR_ADCAL_Pos)             //--- 0x80000000
#define ADC_CR_ADCAL                   ADC_CR_ADCAL_Msk                        //--- ADC calibration

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_CFGR register
//---------------------------------------------------------------------------------------------
#define ADC_CFGR_DMAEN_Pos             (0U)
#define ADC_CFGR_DMAEN_Msk             (0x1UL << ADC_CFGR_DMAEN_Pos)           //--- 0x00000001
#define ADC_CFGR_DMAEN                 ADC_CFGR_DMAEN_Msk                      //--- ADC DMA transfer enable
#define ADC_CFGR_DMACFG_Pos            (1U)
#define ADC_CFGR_DMACFG_Msk            (0x1UL << ADC_CFGR_DMACFG_Pos)          //--- 0x00000002
#define ADC_CFGR_DMACFG                ADC_CFGR_DMACFG_Msk                     //--- ADC DMA transfer configuration

#define ADC_CFGR_RES_Pos               (3U)
#define ADC_CFGR_RES_Msk               (0x3UL << ADC_CFGR_RES_Pos)             //--- 0x00000018
#define ADC_CFGR_RES                   ADC_CFGR_RES_Msk                        //--- ADC data resolution
#define ADC_CFGR_RES_0                 (0x1UL << ADC_CFGR_RES_Pos)             //--- 0x00000008
#define ADC_CFGR_RES_1                 (0x2UL << ADC_CFGR_RES_Pos)             //--- 0x00000010

#define ADC_CFGR_ALIGN_Pos             (5U)
#define ADC_CFGR_ALIGN_Msk             (0x1UL << ADC_CFGR_ALIGN_Pos)           //--- 0x00000020
#define ADC_CFGR_ALIGN                 ADC_CFGR_ALIGN_Msk                      //--- ADC data alignement

#define ADC_CFGR_EXTSEL_Pos            (6U)
#define ADC_CFGR_EXTSEL_Msk            (0xFUL << ADC_CFGR_EXTSEL_Pos)          //--- 0x000003C0
#define ADC_CFGR_EXTSEL                ADC_CFGR_EXTSEL_Msk                     //--- ADC group regular external trigger source
#define ADC_CFGR_EXTSEL_0              (0x1UL << ADC_CFGR_EXTSEL_Pos)          //--- 0x00000040
#define ADC_CFGR_EXTSEL_1              (0x2UL << ADC_CFGR_EXTSEL_Pos)          //--- 0x00000080
#define ADC_CFGR_EXTSEL_2              (0x4UL << ADC_CFGR_EXTSEL_Pos)          //--- 0x00000100
#define ADC_CFGR_EXTSEL_3              (0x8UL << ADC_CFGR_EXTSEL_Pos)          //--- 0x00000200

#define ADC_CFGR_EXTEN_Pos             (10U)
#define ADC_CFGR_EXTEN_Msk             (0x3UL << ADC_CFGR_EXTEN_Pos)           //--- 0x00000C00
#define ADC_CFGR_EXTEN                 ADC_CFGR_EXTEN_Msk                      //--- ADC group regular external trigger polarity
#define ADC_CFGR_EXTEN_0               (0x1UL << ADC_CFGR_EXTEN_Pos)           //--- 0x00000400
#define ADC_CFGR_EXTEN_1               (0x2UL << ADC_CFGR_EXTEN_Pos)           //--- 0x00000800

#define ADC_CFGR_OVRMOD_Pos            (12U)
#define ADC_CFGR_OVRMOD_Msk            (0x1UL << ADC_CFGR_OVRMOD_Pos)          //--- 0x00001000
#define ADC_CFGR_OVRMOD                ADC_CFGR_OVRMOD_Msk                     //--- ADC group regular overrun configuration
#define ADC_CFGR_CONT_Pos              (13U)
#define ADC_CFGR_CONT_Msk              (0x1UL << ADC_CFGR_CONT_Pos)            //--- 0x00002000
#define ADC_CFGR_CONT                  ADC_CFGR_CONT_Msk                       //--- ADC group regular continuous conversion mode
#define ADC_CFGR_AUTDLY_Pos            (14U)
#define ADC_CFGR_AUTDLY_Msk            (0x1UL << ADC_CFGR_AUTDLY_Pos)          //--- 0x00004000
#define ADC_CFGR_AUTDLY                ADC_CFGR_AUTDLY_Msk                     //--- ADC low power auto wait

#define ADC_CFGR_DISCEN_Pos            (16U)
#define ADC_CFGR_DISCEN_Msk            (0x1UL << ADC_CFGR_DISCEN_Pos)          //--- 0x00010000
#define ADC_CFGR_DISCEN                ADC_CFGR_DISCEN_Msk                     //--- ADC group regular sequencer discontinuous mode

#define ADC_CFGR_DISCNUM_Pos           (17U)
#define ADC_CFGR_DISCNUM_Msk           (0x7UL << ADC_CFGR_DISCNUM_Pos)         //--- 0x000E0000
#define ADC_CFGR_DISCNUM               ADC_CFGR_DISCNUM_Msk                    //--- ADC group regular sequencer discontinuous number of ranks
#define ADC_CFGR_DISCNUM_0             (0x1UL << ADC_CFGR_DISCNUM_Pos)         //--- 0x00020000
#define ADC_CFGR_DISCNUM_1             (0x2UL << ADC_CFGR_DISCNUM_Pos)         //--- 0x00040000
#define ADC_CFGR_DISCNUM_2             (0x4UL << ADC_CFGR_DISCNUM_Pos)         //--- 0x00080000

#define ADC_CFGR_JDISCEN_Pos           (20U)
#define ADC_CFGR_JDISCEN_Msk           (0x1UL << ADC_CFGR_JDISCEN_Pos)         //--- 0x00100000
#define ADC_CFGR_JDISCEN               ADC_CFGR_JDISCEN_Msk                    //--- ADC group injected sequencer discontinuous mode
#define ADC_CFGR_JQM_Pos               (21U)
#define ADC_CFGR_JQM_Msk               (0x1UL << ADC_CFGR_JQM_Pos)             //--- 0x00200000
#define ADC_CFGR_JQM                   ADC_CFGR_JQM_Msk                        //--- ADC group injected contexts queue mode
#define ADC_CFGR_AWD1SGL_Pos           (22U)
#define ADC_CFGR_AWD1SGL_Msk           (0x1UL << ADC_CFGR_AWD1SGL_Pos)         //--- 0x00400000
#define ADC_CFGR_AWD1SGL               ADC_CFGR_AWD1SGL_Msk                    //--- ADC analog watchdog 1 monitoring a single channel or all channels
#define ADC_CFGR_AWD1EN_Pos            (23U)
#define ADC_CFGR_AWD1EN_Msk            (0x1UL << ADC_CFGR_AWD1EN_Pos)          //--- 0x00800000
#define ADC_CFGR_AWD1EN                ADC_CFGR_AWD1EN_Msk                     //--- ADC analog watchdog 1 enable on scope ADC group regular
#define ADC_CFGR_JAWD1EN_Pos           (24U)
#define ADC_CFGR_JAWD1EN_Msk           (0x1UL << ADC_CFGR_JAWD1EN_Pos)         //--- 0x01000000
#define ADC_CFGR_JAWD1EN               ADC_CFGR_JAWD1EN_Msk                    //--- ADC analog watchdog 1 enable on scope ADC group injected
#define ADC_CFGR_JAUTO_Pos             (25U)
#define ADC_CFGR_JAUTO_Msk             (0x1UL << ADC_CFGR_JAUTO_Pos)           //--- 0x02000000
#define ADC_CFGR_JAUTO                 ADC_CFGR_JAUTO_Msk                      //--- ADC group injected automatic trigger mode

#define ADC_CFGR_AWD1CH_Pos            (26U)
#define ADC_CFGR_AWD1CH_Msk            (0x1FUL << ADC_CFGR_AWD1CH_Pos)         //--- 0x7C000000
#define ADC_CFGR_AWD1CH                ADC_CFGR_AWD1CH_Msk                     //--- ADC analog watchdog 1 monitored channel selection
#define ADC_CFGR_AWD1CH_0              (0x01UL << ADC_CFGR_AWD1CH_Pos)         //--- 0x04000000
#define ADC_CFGR_AWD1CH_1              (0x02UL << ADC_CFGR_AWD1CH_Pos)         //--- 0x08000000
#define ADC_CFGR_AWD1CH_2              (0x04UL << ADC_CFGR_AWD1CH_Pos)         //--- 0x10000000
#define ADC_CFGR_AWD1CH_3              (0x08UL << ADC_CFGR_AWD1CH_Pos)         //--- 0x20000000
#define ADC_CFGR_AWD1CH_4              (0x10UL << ADC_CFGR_AWD1CH_Pos)         //--- 0x40000000

