Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define ADC_CFGR_JQDIS_Pos             (31U)
#define ADC_CFGR_JQDIS_Msk             (0x1UL << ADC_CFGR_JQDIS_Pos)           //--- 0x80000000
#define ADC_CFGR_JQDIS                 ADC_CFGR_JQDIS_Msk                      //--- ADC group injected contexts queue disable

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_CFGR2 register
//---------------------------------------------------------------------------------------------
#define ADC_CFGR2_ROVSE_Pos            (0U)
#define ADC_CFGR2_ROVSE_Msk            (0x1UL << ADC_CFGR2_ROVSE_Pos)          //--- 0x00000001
#define ADC_CFGR2_ROVSE                ADC_CFGR2_ROVSE_Msk                     //--- ADC oversampler enable on scope ADC group regular
#define ADC_CFGR2_JOVSE_Pos            (1U)
#define ADC_CFGR2_JOVSE_Msk            (0x1UL << ADC_CFGR2_JOVSE_Pos)          //--- 0x00000002
#define ADC_CFGR2_JOVSE                ADC_CFGR2_JOVSE_Msk                     //--- ADC oversampler enable on scope ADC group injected

#define ADC_CFGR2_OVSR_Pos             (2U)
#define ADC_CFGR2_OVSR_Msk             (0x7UL << ADC_CFGR2_OVSR_Pos)           //--- 0x0000001C
#define ADC_CFGR2_OVSR                 ADC_CFGR2_OVSR_Msk                      //--- ADC oversampling ratio
#define ADC_CFGR2_OVSR_0               (0x1UL << ADC_CFGR2_OVSR_Pos)           //--- 0x00000004
#define ADC_CFGR2_OVSR_1               (0x2UL << ADC_CFGR2_OVSR_Pos)           //--- 0x00000008
#define ADC_CFGR2_OVSR_2               (0x4UL << ADC_CFGR2_OVSR_Pos)           //--- 0x00000010

#define ADC_CFGR2_OVSS_Pos             (5U)
#define ADC_CFGR2_OVSS_Msk             (0xFUL << ADC_CFGR2_OVSS_Pos)           //--- 0x000001E0
#define ADC_CFGR2_OVSS                 ADC_CFGR2_OVSS_Msk                      //--- ADC oversampling shift
#define ADC_CFGR2_OVSS_0               (0x1UL << ADC_CFGR2_OVSS_Pos)           //--- 0x00000020
#define ADC_CFGR2_OVSS_1               (0x2UL << ADC_CFGR2_OVSS_Pos)           //--- 0x00000040
#define ADC_CFGR2_OVSS_2               (0x4UL << ADC_CFGR2_OVSS_Pos)           //--- 0x00000080
#define ADC_CFGR2_OVSS_3               (0x8UL << ADC_CFGR2_OVSS_Pos)           //--- 0x00000100

#define ADC_CFGR2_TROVS_Pos            (9U)
#define ADC_CFGR2_TROVS_Msk            (0x1UL << ADC_CFGR2_TROVS_Pos)          //--- 0x00000200
#define ADC_CFGR2_TROVS                ADC_CFGR2_TROVS_Msk                     //--- ADC oversampling discontinuous mode (triggered mode) for ADC group regular
#define ADC_CFGR2_ROVSM_Pos            (10U)
#define ADC_CFGR2_ROVSM_Msk            (0x1UL << ADC_CFGR2_ROVSM_Pos)          //--- 0x00000400
#define ADC_CFGR2_ROVSM                ADC_CFGR2_ROVSM_Msk                     //--- ADC oversampling mode managing interlaced conversions of ADC group regular and group injected

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_SMPR1 register
//---------------------------------------------------------------------------------------------
#define ADC_SMPR1_SMP0_Pos             (0U)
#define ADC_SMPR1_SMP0_Msk             (0x7UL << ADC_SMPR1_SMP0_Pos)           //--- 0x00000007
#define ADC_SMPR1_SMP0                 ADC_SMPR1_SMP0_Msk                      //--- ADC channel 0 sampling time selection
#define ADC_SMPR1_SMP0_0               (0x1UL << ADC_SMPR1_SMP0_Pos)           //--- 0x00000001
#define ADC_SMPR1_SMP0_1               (0x2UL << ADC_SMPR1_SMP0_Pos)           //--- 0x00000002
#define ADC_SMPR1_SMP0_2               (0x4UL << ADC_SMPR1_SMP0_Pos)           //--- 0x00000004

#define ADC_SMPR1_SMP1_Pos             (3U)
#define ADC_SMPR1_SMP1_Msk             (0x7UL << ADC_SMPR1_SMP1_Pos)           //--- 0x00000038
#define ADC_SMPR1_SMP1                 ADC_SMPR1_SMP1_Msk                      //--- ADC channel 1 sampling time selection
#define ADC_SMPR1_SMP1_0               (0x1UL << ADC_SMPR1_SMP1_Pos)           //--- 0x00000008
#define ADC_SMPR1_SMP1_1               (0x2UL << ADC_SMPR1_SMP1_Pos)           //--- 0x00000010
#define ADC_SMPR1_SMP1_2               (0x4UL << ADC_SMPR1_SMP1_Pos)           //--- 0x00000020

#define ADC_SMPR1_SMP2_Pos             (6U)
#define ADC_SMPR1_SMP2_Msk             (0x7UL << ADC_SMPR1_SMP2_Pos)           //--- 0x000001C0
#define ADC_SMPR1_SMP2                 ADC_SMPR1_SMP2_Msk                      //--- ADC channel 2 sampling time selection
#define ADC_SMPR1_SMP2_0               (0x1UL << ADC_SMPR1_SMP2_Pos)           //--- 0x00000040
#define ADC_SMPR1_SMP2_1               (0x2UL << ADC_SMPR1_SMP2_Pos)           //--- 0x00000080
#define ADC_SMPR1_SMP2_2               (0x4UL << ADC_SMPR1_SMP2_Pos)           //--- 0x00000100

#define ADC_SMPR1_SMP3_Pos             (9U)
#define ADC_SMPR1_SMP3_Msk             (0x7UL << ADC_SMPR1_SMP3_Pos)           //--- 0x00000E00
#define ADC_SMPR1_SMP3                 ADC_SMPR1_SMP3_Msk                      //--- ADC channel 3 sampling time selection
#define ADC_SMPR1_SMP3_0               (0x1UL << ADC_SMPR1_SMP3_Pos)           //--- 0x00000200
#define ADC_SMPR1_SMP3_1               (0x2UL << ADC_SMPR1_SMP3_Pos)           //--- 0x00000400
#define ADC_SMPR1_SMP3_2               (0x4UL << ADC_SMPR1_SMP3_Pos)           //--- 0x00000800

#define ADC_SMPR1_SMP4_Pos             (12U)
#define ADC_SMPR1_SMP4_Msk             (0x7UL << ADC_SMPR1_SMP4_Pos)           //--- 0x00007000
#define ADC_SMPR1_SMP4                 ADC_SMPR1_SMP4_Msk                      //--- ADC channel 4 sampling time selection
#define ADC_SMPR1_SMP4_0               (0x1UL << ADC_SMPR1_SMP4_Pos)           //--- 0x00001000
#define ADC_SMPR1_SMP4_1               (0x2UL << ADC_SMPR1_SMP4_Pos)           //--- 0x00002000
#define ADC_SMPR1_SMP4_2               (0x4UL << ADC_SMPR1_SMP4_Pos)           //--- 0x00004000

#define ADC_SMPR1_SMP5_Pos             (15U)
#define ADC_SMPR1_SMP5_Msk             (0x7UL << ADC_SMPR1_SMP5_Pos)           //--- 0x00038000
#define ADC_SMPR1_SMP5                 ADC_SMPR1_SMP5_Msk                      //--- ADC channel 5 sampling time selection
#define ADC_SMPR1_SMP5_0               (0x1UL << ADC_SMPR1_SMP5_Pos)           //--- 0x00008000
#define ADC_SMPR1_SMP5_1               (0x2UL << ADC_SMPR1_SMP5_Pos)           //--- 0x00010000
#define ADC_SMPR1_SMP5_2               (0x4UL << ADC_SMPR1_SMP5_Pos)           //--- 0x00020000

#define ADC_SMPR1_SMP6_Pos             (18U)
#define ADC_SMPR1_SMP6_Msk             (0x7UL << ADC_SMPR1_SMP6_Pos)           //--- 0x001C0000
#define ADC_SMPR1_SMP6                 ADC_SMPR1_SMP6_Msk                      //--- ADC channel 6 sampling time selection
#define ADC_SMPR1_SMP6_0               (0x1UL << ADC_SMPR1_SMP6_Pos)           //--- 0x00040000
#define ADC_SMPR1_SMP6_1               (0x2UL << ADC_SMPR1_SMP6_Pos)           //--- 0x00080000
#define ADC_SMPR1_SMP6_2               (0x4UL << ADC_SMPR1_SMP6_Pos)           //--- 0x00100000

#define ADC_SMPR1_SMP7_Pos             (21U)
#define ADC_SMPR1_SMP7_Msk             (0x7UL << ADC_SMPR1_SMP7_Pos)           //--- 0x00E00000
#define ADC_SMPR1_SMP7                 ADC_SMPR1_SMP7_Msk                      //--- ADC channel 7 sampling time selection
#define ADC_SMPR1_SMP7_0               (0x1UL << ADC_SMPR1_SMP7_Pos)           //--- 0x00200000
#define ADC_SMPR1_SMP7_1               (0x2UL << ADC_SMPR1_SMP7_Pos)           //--- 0x00400000
#define ADC_SMPR1_SMP7_2               (0x4UL << ADC_SMPR1_SMP7_Pos)           //--- 0x00800000

