Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define ADC_SMPR1_SMP8_Pos             (24U)
#define ADC_SMPR1_SMP8_Msk             (0x7UL << ADC_SMPR1_SMP8_Pos)           //--- 0x07000000
#define ADC_SMPR1_SMP8                 ADC_SMPR1_SMP8_Msk                      //--- ADC channel 8 sampling time selection
#define ADC_SMPR1_SMP8_0               (0x1UL << ADC_SMPR1_SMP8_Pos)           //--- 0x01000000
#define ADC_SMPR1_SMP8_1               (0x2UL << ADC_SMPR1_SMP8_Pos)           //--- 0x02000000
#define ADC_SMPR1_SMP8_2               (0x4UL << ADC_SMPR1_SMP8_Pos)           //--- 0x04000000

#define ADC_SMPR1_SMP9_Pos             (27U)
#define ADC_SMPR1_SMP9_Msk             (0x7UL << ADC_SMPR1_SMP9_Pos)           //--- 0x38000000
#define ADC_SMPR1_SMP9                 ADC_SMPR1_SMP9_Msk                      //--- ADC channel 9 sampling time selection
#define ADC_SMPR1_SMP9_0               (0x1UL << ADC_SMPR1_SMP9_Pos)           //--- 0x08000000
#define ADC_SMPR1_SMP9_1               (0x2UL << ADC_SMPR1_SMP9_Pos)           //--- 0x10000000
#define ADC_SMPR1_SMP9_2               (0x4UL << ADC_SMPR1_SMP9_Pos)           //--- 0x20000000

//--- Bit definition for ADC_SMPR2 register
#define ADC_SMPR2_SMP10_Pos            (0U)
#define ADC_SMPR2_SMP10_Msk            (0x7UL << ADC_SMPR2_SMP10_Pos)          //--- 0x00000007
#define ADC_SMPR2_SMP10                ADC_SMPR2_SMP10_Msk                     //--- ADC channel 10 sampling time selection
#define ADC_SMPR2_SMP10_0              (0x1UL << ADC_SMPR2_SMP10_Pos)          //--- 0x00000001
#define ADC_SMPR2_SMP10_1              (0x2UL << ADC_SMPR2_SMP10_Pos)          //--- 0x00000002
#define ADC_SMPR2_SMP10_2              (0x4UL << ADC_SMPR2_SMP10_Pos)          //--- 0x00000004

#define ADC_SMPR2_SMP11_Pos            (3U)
#define ADC_SMPR2_SMP11_Msk            (0x7UL << ADC_SMPR2_SMP11_Pos)          //--- 0x00000038
#define ADC_SMPR2_SMP11                ADC_SMPR2_SMP11_Msk                     //--- ADC channel 11 sampling time selection
#define ADC_SMPR2_SMP11_0              (0x1UL << ADC_SMPR2_SMP11_Pos)          //--- 0x00000008
#define ADC_SMPR2_SMP11_1              (0x2UL << ADC_SMPR2_SMP11_Pos)          //--- 0x00000010
#define ADC_SMPR2_SMP11_2              (0x4UL << ADC_SMPR2_SMP11_Pos)          //--- 0x00000020

#define ADC_SMPR2_SMP12_Pos            (6U)
#define ADC_SMPR2_SMP12_Msk            (0x7UL << ADC_SMPR2_SMP12_Pos)          //--- 0x000001C0
#define ADC_SMPR2_SMP12                ADC_SMPR2_SMP12_Msk                     //--- ADC channel 12 sampling time selection
#define ADC_SMPR2_SMP12_0              (0x1UL << ADC_SMPR2_SMP12_Pos)          //--- 0x00000040
#define ADC_SMPR2_SMP12_1              (0x2UL << ADC_SMPR2_SMP12_Pos)          //--- 0x00000080
#define ADC_SMPR2_SMP12_2              (0x4UL << ADC_SMPR2_SMP12_Pos)          //--- 0x00000100

#define ADC_SMPR2_SMP13_Pos            (9U)
#define ADC_SMPR2_SMP13_Msk            (0x7UL << ADC_SMPR2_SMP13_Pos)          //--- 0x00000E00
#define ADC_SMPR2_SMP13                ADC_SMPR2_SMP13_Msk                     //--- ADC channel 13 sampling time selection
#define ADC_SMPR2_SMP13_0              (0x1UL << ADC_SMPR2_SMP13_Pos)          //--- 0x00000200
#define ADC_SMPR2_SMP13_1              (0x2UL << ADC_SMPR2_SMP13_Pos)          //--- 0x00000400
#define ADC_SMPR2_SMP13_2              (0x4UL << ADC_SMPR2_SMP13_Pos)          //--- 0x00000800

#define ADC_SMPR2_SMP14_Pos            (12U)
#define ADC_SMPR2_SMP14_Msk            (0x7UL << ADC_SMPR2_SMP14_Pos)          //--- 0x00007000
#define ADC_SMPR2_SMP14                ADC_SMPR2_SMP14_Msk                     //--- ADC channel 14 sampling time selection
#define ADC_SMPR2_SMP14_0              (0x1UL << ADC_SMPR2_SMP14_Pos)          //--- 0x00001000
#define ADC_SMPR2_SMP14_1              (0x2UL << ADC_SMPR2_SMP14_Pos)          //--- 0x00002000
#define ADC_SMPR2_SMP14_2              (0x4UL << ADC_SMPR2_SMP14_Pos)          //--- 0x00004000

#define ADC_SMPR2_SMP15_Pos            (15U)
#define ADC_SMPR2_SMP15_Msk            (0x7UL << ADC_SMPR2_SMP15_Pos)          //--- 0x00038000
#define ADC_SMPR2_SMP15                ADC_SMPR2_SMP15_Msk                     //--- ADC channel 15 sampling time selection
#define ADC_SMPR2_SMP15_0              (0x1UL << ADC_SMPR2_SMP15_Pos)          //--- 0x00008000
#define ADC_SMPR2_SMP15_1              (0x2UL << ADC_SMPR2_SMP15_Pos)          //--- 0x00010000
#define ADC_SMPR2_SMP15_2              (0x4UL << ADC_SMPR2_SMP15_Pos)          //--- 0x00020000

#define ADC_SMPR2_SMP16_Pos            (18U)
#define ADC_SMPR2_SMP16_Msk            (0x7UL << ADC_SMPR2_SMP16_Pos)          //--- 0x001C0000
#define ADC_SMPR2_SMP16                ADC_SMPR2_SMP16_Msk                     //--- ADC channel 16 sampling time selection
#define ADC_SMPR2_SMP16_0              (0x1UL << ADC_SMPR2_SMP16_Pos)          //--- 0x00040000
#define ADC_SMPR2_SMP16_1              (0x2UL << ADC_SMPR2_SMP16_Pos)          //--- 0x00080000
#define ADC_SMPR2_SMP16_2              (0x4UL << ADC_SMPR2_SMP16_Pos)          //--- 0x00100000

#define ADC_SMPR2_SMP17_Pos            (21U)
#define ADC_SMPR2_SMP17_Msk            (0x7UL << ADC_SMPR2_SMP17_Pos)          //--- 0x00E00000
#define ADC_SMPR2_SMP17                ADC_SMPR2_SMP17_Msk                     //--- ADC channel 17 sampling time selection
#define ADC_SMPR2_SMP17_0              (0x1UL << ADC_SMPR2_SMP17_Pos)          //--- 0x00200000
#define ADC_SMPR2_SMP17_1              (0x2UL << ADC_SMPR2_SMP17_Pos)          //--- 0x00400000
#define ADC_SMPR2_SMP17_2              (0x4UL << ADC_SMPR2_SMP17_Pos)          //--- 0x00800000

#define ADC_SMPR2_SMP18_Pos            (24U)
#define ADC_SMPR2_SMP18_Msk            (0x7UL << ADC_SMPR2_SMP18_Pos)          //--- 0x07000000
#define ADC_SMPR2_SMP18                ADC_SMPR2_SMP18_Msk                     //--- ADC channel 18 sampling time selection
#define ADC_SMPR2_SMP18_0              (0x1UL << ADC_SMPR2_SMP18_Pos)          //--- 0x01000000
#define ADC_SMPR2_SMP18_1              (0x2UL << ADC_SMPR2_SMP18_Pos)          //--- 0x02000000
#define ADC_SMPR2_SMP18_2              (0x4UL << ADC_SMPR2_SMP18_Pos)          //--- 0x04000000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_TR1 register
//---------------------------------------------------------------------------------------------
#define ADC_TR1_LT1_Pos                (0U)
#define ADC_TR1_LT1_Msk                (0xFFFUL << ADC_TR1_LT1_Pos)            //--- 0x00000FFF
#define ADC_TR1_LT1                    ADC_TR1_LT1_Msk                         //--- ADC analog watchdog 1 threshold low
#define ADC_TR1_LT1_0                  (0x001UL << ADC_TR1_LT1_Pos)            //--- 0x00000001
#define ADC_TR1_LT1_1                  (0x002UL << ADC_TR1_LT1_Pos)            //--- 0x00000002
#define ADC_TR1_LT1_2                  (0x004UL << ADC_TR1_LT1_Pos)            //--- 0x00000004
#define ADC_TR1_LT1_3                  (0x008UL << ADC_TR1_LT1_Pos)            //--- 0x00000008
#define ADC_TR1_LT1_4                  (0x010UL << ADC_TR1_LT1_Pos)            //--- 0x00000010
#define ADC_TR1_LT1_5                  (0x020UL << ADC_TR1_LT1_Pos)            //--- 0x00000020
#define ADC_TR1_LT1_6                  (0x040UL << ADC_TR1_LT1_Pos)            //--- 0x00000040
#define ADC_TR1_LT1_7                  (0x080UL << ADC_TR1_LT1_Pos)            //--- 0x00000080
#define ADC_TR1_LT1_8                  (0x100UL << ADC_TR1_LT1_Pos)            //--- 0x00000100
#define ADC_TR1_LT1_9                  (0x200UL << ADC_TR1_LT1_Pos)            //--- 0x00000200
#define ADC_TR1_LT1_10                 (0x400UL << ADC_TR1_LT1_Pos)            //--- 0x00000400
#define ADC_TR1_LT1_11                 (0x800UL << ADC_TR1_LT1_Pos)            //--- 0x00000800

#define ADC_TR1_HT1_Pos                (16U)
#define ADC_TR1_HT1_Msk                (0xFFFUL << ADC_TR1_HT1_Pos)            //--- 0x0FFF0000
#define ADC_TR1_HT1                    ADC_TR1_HT1_Msk                         //--- ADC Analog watchdog 1 threshold high
#define ADC_TR1_HT1_0                  (0x001UL << ADC_TR1_HT1_Pos)            //--- 0x00010000
#define ADC_TR1_HT1_1                  (0x002UL << ADC_TR1_HT1_Pos)            //--- 0x00020000
#define ADC_TR1_HT1_2                  (0x004UL << ADC_TR1_HT1_Pos)            //--- 0x00040000
#define ADC_TR1_HT1_3                  (0x008UL << ADC_TR1_HT1_Pos)            //--- 0x00080000
#define ADC_TR1_HT1_4                  (0x010UL << ADC_TR1_HT1_Pos)            //--- 0x00100000
#define ADC_TR1_HT1_5                  (0x020UL << ADC_TR1_HT1_Pos)            //--- 0x00200000
#define ADC_TR1_HT1_6                  (0x040UL << ADC_TR1_HT1_Pos)            //--- 0x00400000
#define ADC_TR1_HT1_7                  (0x080UL << ADC_TR1_HT1_Pos)            //--- 0x00800000
#define ADC_TR1_HT1_8                  (0x100UL << ADC_TR1_HT1_Pos)            //--- 0x01000000
#define ADC_TR1_HT1_9                  (0x200UL << ADC_TR1_HT1_Pos)            //--- 0x02000000
#define ADC_TR1_HT1_10                 (0x400UL << ADC_TR1_HT1_Pos)            //--- 0x04000000
#define ADC_TR1_HT1_11                 (0x800UL << ADC_TR1_HT1_Pos)            //--- 0x08000000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_TR2 register
//---------------------------------------------------------------------------------------------
#define ADC_TR2_LT2_Pos                (0U)
#define ADC_TR2_LT2_Msk                (0xFFUL << ADC_TR2_LT2_Pos)             //--- 0x000000FF
#define ADC_TR2_LT2                    ADC_TR2_LT2_Msk                         //--- ADC analog watchdog 2 threshold low
#define ADC_TR2_LT2_0                  (0x01UL << ADC_TR2_LT2_Pos)             //--- 0x00000001
#define ADC_TR2_LT2_1                  (0x02UL << ADC_TR2_LT2_Pos)             //--- 0x00000002
#define ADC_TR2_LT2_2                  (0x04UL << ADC_TR2_LT2_Pos)             //--- 0x00000004
#define ADC_TR2_LT2_3                  (0x08UL << ADC_TR2_LT2_Pos)             //--- 0x00000008
#define ADC_TR2_LT2_4                  (0x10UL << ADC_TR2_LT2_Pos)             //--- 0x00000010
#define ADC_TR2_LT2_5                  (0x20UL << ADC_TR2_LT2_Pos)             //--- 0x00000020
#define ADC_TR2_LT2_6                  (0x40UL << ADC_TR2_LT2_Pos)             //--- 0x00000040
#define ADC_TR2_LT2_7                  (0x80UL << ADC_TR2_LT2_Pos)             //--- 0x00000080

#define ADC_TR2_HT2_Pos                (16U)
#define ADC_TR2_HT2_Msk                (0xFFUL << ADC_TR2_HT2_Pos)             //--- 0x00FF0000
#define ADC_TR2_HT2                    ADC_TR2_HT2_Msk                         //--- ADC analog watchdog 2 threshold high
#define ADC_TR2_HT2_0                  (0x01UL << ADC_TR2_HT2_Pos)             //--- 0x00010000
#define ADC_TR2_HT2_1                  (0x02UL << ADC_TR2_HT2_Pos)             //--- 0x00020000
#define ADC_TR2_HT2_2                  (0x04UL << ADC_TR2_HT2_Pos)             //--- 0x00040000
#define ADC_TR2_HT2_3                  (0x08UL << ADC_TR2_HT2_Pos)             //--- 0x00080000
#define ADC_TR2_HT2_4                  (0x10UL << ADC_TR2_HT2_Pos)             //--- 0x00100000
#define ADC_TR2_HT2_5                  (0x20UL << ADC_TR2_HT2_Pos)             //--- 0x00200000
#define ADC_TR2_HT2_6                  (0x40UL << ADC_TR2_HT2_Pos)             //--- 0x00400000
#define ADC_TR2_HT2_7                  (0x80UL << ADC_TR2_HT2_Pos)             //--- 0x00800000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_TR3 register
//---------------------------------------------------------------------------------------------
#define ADC_TR3_LT3_Pos                (0U)
#define ADC_TR3_LT3_Msk                (0xFFUL << ADC_TR3_LT3_Pos)             //--- 0x000000FF
#define ADC_TR3_LT3                    ADC_TR3_LT3_Msk                         //--- ADC analog watchdog 3 threshold low
#define ADC_TR3_LT3_0                  (0x01UL << ADC_TR3_LT3_Pos)             //--- 0x00000001
#define ADC_TR3_LT3_1                  (0x02UL << ADC_TR3_LT3_Pos)             //--- 0x00000002
#define ADC_TR3_LT3_2                  (0x04UL << ADC_TR3_LT3_Pos)             //--- 0x00000004
#define ADC_TR3_LT3_3                  (0x08UL << ADC_TR3_LT3_Pos)             //--- 0x00000008
#define ADC_TR3_LT3_4                  (0x10UL << ADC_TR3_LT3_Pos)             //--- 0x00000010
#define ADC_TR3_LT3_5                  (0x20UL << ADC_TR3_LT3_Pos)             //--- 0x00000020
#define ADC_TR3_LT3_6                  (0x40UL << ADC_TR3_LT3_Pos)             //--- 0x00000040
#define ADC_TR3_LT3_7                  (0x80UL << ADC_TR3_LT3_Pos)             //--- 0x00000080

#define ADC_TR3_HT3_Pos                (16U)
#define ADC_TR3_HT3_Msk                (0xFFUL << ADC_TR3_HT3_Pos)             //--- 0x00FF0000
#define ADC_TR3_HT3                    ADC_TR3_HT3_Msk                         //--- ADC analog watchdog 3 threshold high
#define ADC_TR3_HT3_0                  (0x01UL << ADC_TR3_HT3_Pos)             //--- 0x00010000
#define ADC_TR3_HT3_1                  (0x02UL << ADC_TR3_HT3_Pos)             //--- 0x00020000
#define ADC_TR3_HT3_2                  (0x04UL << ADC_TR3_HT3_Pos)             //--- 0x00040000
#define ADC_TR3_HT3_3                  (0x08UL << ADC_TR3_HT3_Pos)             //--- 0x00080000
#define ADC_TR3_HT3_4                  (0x10UL << ADC_TR3_HT3_Pos)             //--- 0x00100000
#define ADC_TR3_HT3_5                  (0x20UL << ADC_TR3_HT3_Pos)             //--- 0x00200000
#define ADC_TR3_HT3_6                  (0x40UL << ADC_TR3_HT3_Pos)             //--- 0x00400000
#define ADC_TR3_HT3_7                  (0x80UL << ADC_TR3_HT3_Pos)             //--- 0x00800000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_SQR1 register
//---------------------------------------------------------------------------------------------
#define ADC_SQR1_L_Pos                 (0U)
#define ADC_SQR1_L_Msk                 (0xFUL << ADC_SQR1_L_Pos)               //--- 0x0000000F
#define ADC_SQR1_L                     ADC_SQR1_L_Msk                          //--- ADC group regular sequencer scan length
#define ADC_SQR1_L_0                   (0x1UL << ADC_SQR1_L_Pos)               //--- 0x00000001
#define ADC_SQR1_L_1                   (0x2UL << ADC_SQR1_L_Pos)               //--- 0x00000002
#define ADC_SQR1_L_2                   (0x4UL << ADC_SQR1_L_Pos)               //--- 0x00000004
#define ADC_SQR1_L_3                   (0x8UL << ADC_SQR1_L_Pos)               //--- 0x00000008

#define ADC_SQR1_SQ1_Pos               (6U)
#define ADC_SQR1_SQ1_Msk               (0x1FUL << ADC_SQR1_SQ1_Pos)            //--- 0x000007C0
#define ADC_SQR1_SQ1                   ADC_SQR1_SQ1_Msk                        //--- ADC group regular sequencer rank 1
#define ADC_SQR1_SQ1_0                 (0x01UL << ADC_SQR1_SQ1_Pos)            //--- 0x00000040
#define ADC_SQR1_SQ1_1                 (0x02UL << ADC_SQR1_SQ1_Pos)            //--- 0x00000080
#define ADC_SQR1_SQ1_2                 (0x04UL << ADC_SQR1_SQ1_Pos)            //--- 0x00000100
#define ADC_SQR1_SQ1_3                 (0x08UL << ADC_SQR1_SQ1_Pos)            //--- 0x00000200
#define ADC_SQR1_SQ1_4                 (0x10UL << ADC_SQR1_SQ1_Pos)            //--- 0x00000400

