Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define ADC_SQR3_SQ12_Pos              (12U)
#define ADC_SQR3_SQ12_Msk              (0x1FUL << ADC_SQR3_SQ12_Pos)           //--- 0x0001F000
#define ADC_SQR3_SQ12                  ADC_SQR3_SQ12_Msk                       //--- ADC group regular sequencer rank 12
#define ADC_SQR3_SQ12_0                (0x01UL << ADC_SQR3_SQ12_Pos)           //--- 0x00001000
#define ADC_SQR3_SQ12_1                (0x02UL << ADC_SQR3_SQ12_Pos)           //--- 0x00002000
#define ADC_SQR3_SQ12_2                (0x04UL << ADC_SQR3_SQ12_Pos)           //--- 0x00004000
#define ADC_SQR3_SQ12_3                (0x08UL << ADC_SQR3_SQ12_Pos)           //--- 0x00008000
#define ADC_SQR3_SQ12_4                (0x10UL << ADC_SQR3_SQ12_Pos)           //--- 0x00010000

#define ADC_SQR3_SQ13_Pos              (18U)
#define ADC_SQR3_SQ13_Msk              (0x1FUL << ADC_SQR3_SQ13_Pos)           //--- 0x007C0000
#define ADC_SQR3_SQ13                  ADC_SQR3_SQ13_Msk                       //--- ADC group regular sequencer rank 13
#define ADC_SQR3_SQ13_0                (0x01UL << ADC_SQR3_SQ13_Pos)           //--- 0x00040000
#define ADC_SQR3_SQ13_1                (0x02UL << ADC_SQR3_SQ13_Pos)           //--- 0x00080000
#define ADC_SQR3_SQ13_2                (0x04UL << ADC_SQR3_SQ13_Pos)           //--- 0x00100000
#define ADC_SQR3_SQ13_3                (0x08UL << ADC_SQR3_SQ13_Pos)           //--- 0x00200000
#define ADC_SQR3_SQ13_4                (0x10UL << ADC_SQR3_SQ13_Pos)           //--- 0x00400000

#define ADC_SQR3_SQ14_Pos              (24U)
#define ADC_SQR3_SQ14_Msk              (0x1FUL << ADC_SQR3_SQ14_Pos)           //--- 0x1F000000
#define ADC_SQR3_SQ14                  ADC_SQR3_SQ14_Msk                       //--- ADC group regular sequencer rank 14
#define ADC_SQR3_SQ14_0                (0x01UL << ADC_SQR3_SQ14_Pos)           //--- 0x01000000
#define ADC_SQR3_SQ14_1                (0x02UL << ADC_SQR3_SQ14_Pos)           //--- 0x02000000
#define ADC_SQR3_SQ14_2                (0x04UL << ADC_SQR3_SQ14_Pos)           //--- 0x04000000
#define ADC_SQR3_SQ14_3                (0x08UL << ADC_SQR3_SQ14_Pos)           //--- 0x08000000
#define ADC_SQR3_SQ14_4                (0x10UL << ADC_SQR3_SQ14_Pos)           //--- 0x10000000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_SQR4 register
//---------------------------------------------------------------------------------------------
#define ADC_SQR4_SQ15_Pos              (0U)
#define ADC_SQR4_SQ15_Msk              (0x1FUL << ADC_SQR4_SQ15_Pos)           //--- 0x0000001F
#define ADC_SQR4_SQ15                  ADC_SQR4_SQ15_Msk                       //--- ADC group regular sequencer rank 15
#define ADC_SQR4_SQ15_0                (0x01UL << ADC_SQR4_SQ15_Pos)           //--- 0x00000001
#define ADC_SQR4_SQ15_1                (0x02UL << ADC_SQR4_SQ15_Pos)           //--- 0x00000002
#define ADC_SQR4_SQ15_2                (0x04UL << ADC_SQR4_SQ15_Pos)           //--- 0x00000004
#define ADC_SQR4_SQ15_3                (0x08UL << ADC_SQR4_SQ15_Pos)           //--- 0x00000008
#define ADC_SQR4_SQ15_4                (0x10UL << ADC_SQR4_SQ15_Pos)           //--- 0x00000010

#define ADC_SQR4_SQ16_Pos              (6U)
#define ADC_SQR4_SQ16_Msk              (0x1FUL << ADC_SQR4_SQ16_Pos)           //--- 0x000007C0
#define ADC_SQR4_SQ16                  ADC_SQR4_SQ16_Msk                       //--- ADC group regular sequencer rank 16
#define ADC_SQR4_SQ16_0                (0x01UL << ADC_SQR4_SQ16_Pos)           //--- 0x00000040
#define ADC_SQR4_SQ16_1                (0x02UL << ADC_SQR4_SQ16_Pos)           //--- 0x00000080
#define ADC_SQR4_SQ16_2                (0x04UL << ADC_SQR4_SQ16_Pos)           //--- 0x00000100
#define ADC_SQR4_SQ16_3                (0x08UL << ADC_SQR4_SQ16_Pos)           //--- 0x00000200
#define ADC_SQR4_SQ16_4                (0x10UL << ADC_SQR4_SQ16_Pos)           //--- 0x00000400

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_DR register
//---------------------------------------------------------------------------------------------
#define ADC_DR_RDATA_Pos               (0U)
#define ADC_DR_RDATA_Msk               (0xFFFFUL << ADC_DR_RDATA_Pos)          //--- 0x0000FFFF
#define ADC_DR_RDATA                   ADC_DR_RDATA_Msk                        //--- ADC group regular conversion data
#define ADC_DR_RDATA_0                 (0x0001UL << ADC_DR_RDATA_Pos)          //--- 0x00000001
#define ADC_DR_RDATA_1                 (0x0002UL << ADC_DR_RDATA_Pos)          //--- 0x00000002
#define ADC_DR_RDATA_2                 (0x0004UL << ADC_DR_RDATA_Pos)          //--- 0x00000004
#define ADC_DR_RDATA_3                 (0x0008UL << ADC_DR_RDATA_Pos)          //--- 0x00000008
#define ADC_DR_RDATA_4                 (0x0010UL << ADC_DR_RDATA_Pos)          //--- 0x00000010
#define ADC_DR_RDATA_5                 (0x0020UL << ADC_DR_RDATA_Pos)          //--- 0x00000020
#define ADC_DR_RDATA_6                 (0x0040UL << ADC_DR_RDATA_Pos)          //--- 0x00000040
#define ADC_DR_RDATA_7                 (0x0080UL << ADC_DR_RDATA_Pos)          //--- 0x00000080
#define ADC_DR_RDATA_8                 (0x0100UL << ADC_DR_RDATA_Pos)          //--- 0x00000100
#define ADC_DR_RDATA_9                 (0x0200UL << ADC_DR_RDATA_Pos)          //--- 0x00000200
#define ADC_DR_RDATA_10                (0x0400UL << ADC_DR_RDATA_Pos)          //--- 0x00000400
#define ADC_DR_RDATA_11                (0x0800UL << ADC_DR_RDATA_Pos)          //--- 0x00000800
#define ADC_DR_RDATA_12                (0x1000UL << ADC_DR_RDATA_Pos)          //--- 0x00001000
#define ADC_DR_RDATA_13                (0x2000UL << ADC_DR_RDATA_Pos)          //--- 0x00002000
#define ADC_DR_RDATA_14                (0x4000UL << ADC_DR_RDATA_Pos)          //--- 0x00004000
#define ADC_DR_RDATA_15                (0x8000UL << ADC_DR_RDATA_Pos)          //--- 0x00008000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_JSQR register
//---------------------------------------------------------------------------------------------
#define ADC_JSQR_JL_Pos                (0U)
#define ADC_JSQR_JL_Msk                (0x3UL << ADC_JSQR_JL_Pos)              //--- 0x00000003
#define ADC_JSQR_JL                    ADC_JSQR_JL_Msk                         //--- ADC group injected sequencer scan length
#define ADC_JSQR_JL_0                  (0x1UL << ADC_JSQR_JL_Pos)              //--- 0x00000001
#define ADC_JSQR_JL_1                  (0x2UL << ADC_JSQR_JL_Pos)              //--- 0x00000002

#define ADC_JSQR_JEXTSEL_Pos           (2U)
#define ADC_JSQR_JEXTSEL_Msk           (0xFUL << ADC_JSQR_JEXTSEL_Pos)         //--- 0x0000003C
#define ADC_JSQR_JEXTSEL               ADC_JSQR_JEXTSEL_Msk                    //--- ADC group injected external trigger source
#define ADC_JSQR_JEXTSEL_0             (0x1UL << ADC_JSQR_JEXTSEL_Pos)         //--- 0x00000004
#define ADC_JSQR_JEXTSEL_1             (0x2UL << ADC_JSQR_JEXTSEL_Pos)         //--- 0x00000008
#define ADC_JSQR_JEXTSEL_2             (0x4UL << ADC_JSQR_JEXTSEL_Pos)         //--- 0x00000010
#define ADC_JSQR_JEXTSEL_3             (0x8UL << ADC_JSQR_JEXTSEL_Pos)         //--- 0x00000020

#define ADC_JSQR_JEXTEN_Pos            (6U)
#define ADC_JSQR_JEXTEN_Msk            (0x3UL << ADC_JSQR_JEXTEN_Pos)          //--- 0x000000C0
#define ADC_JSQR_JEXTEN                ADC_JSQR_JEXTEN_Msk                     //--- ADC group injected external trigger polarity
#define ADC_JSQR_JEXTEN_0              (0x1UL << ADC_JSQR_JEXTEN_Pos)          //--- 0x00000040
#define ADC_JSQR_JEXTEN_1              (0x2UL << ADC_JSQR_JEXTEN_Pos)          //--- 0x00000080

#define ADC_JSQR_JSQ1_Pos              (8U)
#define ADC_JSQR_JSQ1_Msk              (0x1FUL << ADC_JSQR_JSQ1_Pos)           //--- 0x00001F00
#define ADC_JSQR_JSQ1                  ADC_JSQR_JSQ1_Msk                       //--- ADC group injected sequencer rank 1
#define ADC_JSQR_JSQ1_0                (0x01UL << ADC_JSQR_JSQ1_Pos)           //--- 0x00000100
#define ADC_JSQR_JSQ1_1                (0x02UL << ADC_JSQR_JSQ1_Pos)           //--- 0x00000200
#define ADC_JSQR_JSQ1_2                (0x04UL << ADC_JSQR_JSQ1_Pos)           //--- 0x00000400
#define ADC_JSQR_JSQ1_3                (0x08UL << ADC_JSQR_JSQ1_Pos)           //--- 0x00000800
#define ADC_JSQR_JSQ1_4                (0x10UL << ADC_JSQR_JSQ1_Pos)           //--- 0x00001000

#define ADC_JSQR_JSQ2_Pos              (14U)
#define ADC_JSQR_JSQ2_Msk              (0x1FUL << ADC_JSQR_JSQ2_Pos)           //--- 0x0007C000
#define ADC_JSQR_JSQ2                  ADC_JSQR_JSQ2_Msk                       //--- ADC group injected sequencer rank 2
#define ADC_JSQR_JSQ2_0                (0x01UL << ADC_JSQR_JSQ2_Pos)           //--- 0x00004000
#define ADC_JSQR_JSQ2_1                (0x02UL << ADC_JSQR_JSQ2_Pos)           //--- 0x00008000
#define ADC_JSQR_JSQ2_2                (0x04UL << ADC_JSQR_JSQ2_Pos)           //--- 0x00010000
#define ADC_JSQR_JSQ2_3                (0x08UL << ADC_JSQR_JSQ2_Pos)           //--- 0x00020000
#define ADC_JSQR_JSQ2_4                (0x10UL << ADC_JSQR_JSQ2_Pos)           //--- 0x00040000

#define ADC_JSQR_JSQ3_Pos              (20U)
#define ADC_JSQR_JSQ3_Msk              (0x1FUL << ADC_JSQR_JSQ3_Pos)           //--- 0x01F00000
#define ADC_JSQR_JSQ3                  ADC_JSQR_JSQ3_Msk                       //--- ADC group injected sequencer rank 3
#define ADC_JSQR_JSQ3_0                (0x01UL << ADC_JSQR_JSQ3_Pos)           //--- 0x00100000
#define ADC_JSQR_JSQ3_1                (0x02UL << ADC_JSQR_JSQ3_Pos)           //--- 0x00200000
#define ADC_JSQR_JSQ3_2                (0x04UL << ADC_JSQR_JSQ3_Pos)           //--- 0x00400000
#define ADC_JSQR_JSQ3_3                (0x08UL << ADC_JSQR_JSQ3_Pos)           //--- 0x00800000
#define ADC_JSQR_JSQ3_4                (0x10UL << ADC_JSQR_JSQ3_Pos)           //--- 0x01000000

#define ADC_JSQR_JSQ4_Pos              (26U)
#define ADC_JSQR_JSQ4_Msk              (0x1FUL << ADC_JSQR_JSQ4_Pos)           //--- 0x7C000000
#define ADC_JSQR_JSQ4                  ADC_JSQR_JSQ4_Msk                       //--- ADC group injected sequencer rank 4
#define ADC_JSQR_JSQ4_0                (0x01UL << ADC_JSQR_JSQ4_Pos)           //--- 0x04000000
#define ADC_JSQR_JSQ4_1                (0x02UL << ADC_JSQR_JSQ4_Pos)           //--- 0x08000000
#define ADC_JSQR_JSQ4_2                (0x04UL << ADC_JSQR_JSQ4_Pos)           //--- 0x10000000
#define ADC_JSQR_JSQ4_3                (0x08UL << ADC_JSQR_JSQ4_Pos)           //--- 0x20000000
#define ADC_JSQR_JSQ4_4                (0x10UL << ADC_JSQR_JSQ4_Pos)           //--- 0x40000000

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_OFR1 register
//---------------------------------------------------------------------------------------------
#define ADC_OFR1_OFFSET1_Pos           (0U)
#define ADC_OFR1_OFFSET1_Msk           (0xFFFUL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000FFF
#define ADC_OFR1_OFFSET1               ADC_OFR1_OFFSET1_Msk                    //--- ADC offset number 1 offset level
#define ADC_OFR1_OFFSET1_0             (0x001UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000001
#define ADC_OFR1_OFFSET1_1             (0x002UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000002
#define ADC_OFR1_OFFSET1_2             (0x004UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000004
#define ADC_OFR1_OFFSET1_3             (0x008UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000008
#define ADC_OFR1_OFFSET1_4             (0x010UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000010
#define ADC_OFR1_OFFSET1_5             (0x020UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000020
#define ADC_OFR1_OFFSET1_6             (0x040UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000040
#define ADC_OFR1_OFFSET1_7             (0x080UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000080
#define ADC_OFR1_OFFSET1_8             (0x100UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000100
#define ADC_OFR1_OFFSET1_9             (0x200UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000200
#define ADC_OFR1_OFFSET1_10            (0x400UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000400
#define ADC_OFR1_OFFSET1_11            (0x800UL << ADC_OFR1_OFFSET1_Pos)       //--- 0x00000800

#define ADC_OFR1_OFFSET1_CH_Pos        (26U)
#define ADC_OFR1_OFFSET1_CH_Msk        (0x1FUL << ADC_OFR1_OFFSET1_CH_Pos)     //--- 0x7C000000
#define ADC_OFR1_OFFSET1_CH            ADC_OFR1_OFFSET1_CH_Msk                 //--- ADC offset number 1 channel selection
#define ADC_OFR1_OFFSET1_CH_0          (0x01UL << ADC_OFR1_OFFSET1_CH_Pos)     //--- 0x04000000
#define ADC_OFR1_OFFSET1_CH_1          (0x02UL << ADC_OFR1_OFFSET1_CH_Pos)     //--- 0x08000000
#define ADC_OFR1_OFFSET1_CH_2          (0x04UL << ADC_OFR1_OFFSET1_CH_Pos)     //--- 0x10000000
#define ADC_OFR1_OFFSET1_CH_3          (0x08UL << ADC_OFR1_OFFSET1_CH_Pos)     //--- 0x20000000
#define ADC_OFR1_OFFSET1_CH_4          (0x10UL << ADC_OFR1_OFFSET1_CH_Pos)     //--- 0x40000000

#define ADC_OFR1_OFFSET1_EN_Pos        (31U)
#define ADC_OFR1_OFFSET1_EN_Msk        (0x1UL << ADC_OFR1_OFFSET1_EN_Pos)      //--- 0x80000000
#define ADC_OFR1_OFFSET1_EN            ADC_OFR1_OFFSET1_EN_Msk                 //--- ADC offset number 1 enable

//---------------------------------------------------------------------------------------------
//--- Bit definition for ADC_OFR2 register
//---------------------------------------------------------------------------------------------
#define ADC_OFR2_OFFSET2_Pos           (0U)
#define ADC_OFR2_OFFSET2_Msk           (0xFFFUL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000FFF
#define ADC_OFR2_OFFSET2               ADC_OFR2_OFFSET2_Msk                    //--- ADC offset number 2 offset level
#define ADC_OFR2_OFFSET2_0             (0x001UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000001
#define ADC_OFR2_OFFSET2_1             (0x002UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000002
#define ADC_OFR2_OFFSET2_2             (0x004UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000004
#define ADC_OFR2_OFFSET2_3             (0x008UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000008
#define ADC_OFR2_OFFSET2_4             (0x010UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000010
#define ADC_OFR2_OFFSET2_5             (0x020UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000020
#define ADC_OFR2_OFFSET2_6             (0x040UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000040
#define ADC_OFR2_OFFSET2_7             (0x080UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000080
#define ADC_OFR2_OFFSET2_8             (0x100UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000100
#define ADC_OFR2_OFFSET2_9             (0x200UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000200
#define ADC_OFR2_OFFSET2_10            (0x400UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000400
#define ADC_OFR2_OFFSET2_11            (0x800UL << ADC_OFR2_OFFSET2_Pos)       //--- 0x00000800

