Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//--- ADC Common registers
//--- Bit definition for ADC_CCR register
//---------------------------------------------------------------------------------------------
#define ADC_CCR_CKMODE_Pos             (16U)
#define ADC_CCR_CKMODE_Msk             (0x3UL << ADC_CCR_CKMODE_Pos)           //--- 0x00030000
#define ADC_CCR_CKMODE                 ADC_CCR_CKMODE_Msk                      //--- ADC common clock source and prescaler (prescaler only for clock source synchronous)
#define ADC_CCR_CKMODE_0               (0x1UL << ADC_CCR_CKMODE_Pos)           //--- 0x00010000
#define ADC_CCR_CKMODE_1               (0x2UL << ADC_CCR_CKMODE_Pos)           //--- 0x00020000

#define ADC_CCR_PRESC_Pos              (18U)
#define ADC_CCR_PRESC_Msk              (0xFUL << ADC_CCR_PRESC_Pos)            //--- 0x003C0000
#define ADC_CCR_PRESC                  ADC_CCR_PRESC_Msk                       //--- ADC common clock prescaler, only for clock source asynchronous
#define ADC_CCR_PRESC_0                (0x1UL << ADC_CCR_PRESC_Pos)            //--- 0x00040000
#define ADC_CCR_PRESC_1                (0x2UL << ADC_CCR_PRESC_Pos)            //--- 0x00080000
#define ADC_CCR_PRESC_2                (0x4UL << ADC_CCR_PRESC_Pos)            //--- 0x00100000
#define ADC_CCR_PRESC_3                (0x8UL << ADC_CCR_PRESC_Pos)            //--- 0x00200000

#define ADC_CCR_VREFEN_Pos             (22U)
#define ADC_CCR_VREFEN_Msk             (0x1UL << ADC_CCR_VREFEN_Pos)           //--- 0x00400000
#define ADC_CCR_VREFEN                 ADC_CCR_VREFEN_Msk                      //--- ADC internal path to VrefInt enable
#define ADC_CCR_TSEN_Pos               (23U)
#define ADC_CCR_TSEN_Msk               (0x1UL << ADC_CCR_TSEN_Pos)             //--- 0x00800000
#define ADC_CCR_TSEN                   ADC_CCR_TSEN_Msk                        //--- ADC internal path to temperature sensor enable
#define ADC_CCR_VBATEN_Pos             (24U)
#define ADC_CCR_VBATEN_Msk             (0x1UL << ADC_CCR_VBATEN_Pos)           //--- 0x01000000
#define ADC_CCR_VBATEN                 ADC_CCR_VBATEN_Msk                      //--- ADC internal path to battery voltage enable

//---------------------------------------------------------------------------------------------
//---                          Controller Area Network
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_MCR register
//---------------------------------------------------------------------------------------------
#define CAN_MCR_INRQ_Pos       (0U)
#define CAN_MCR_INRQ_Msk       (0x1UL << CAN_MCR_INRQ_Pos)                     //--- 0x00000001
#define CAN_MCR_INRQ           CAN_MCR_INRQ_Msk                                //----Initialization Request
#define CAN_MCR_SLEEP_Pos      (1U)
#define CAN_MCR_SLEEP_Msk      (0x1UL << CAN_MCR_SLEEP_Pos)                    //--- 0x00000002
#define CAN_MCR_SLEEP          CAN_MCR_SLEEP_Msk                               //----Sleep Mode Request
#define CAN_MCR_TXFP_Pos       (2U)
#define CAN_MCR_TXFP_Msk       (0x1UL << CAN_MCR_TXFP_Pos)                     //--- 0x00000004
#define CAN_MCR_TXFP           CAN_MCR_TXFP_Msk                                //----Transmit FIFO Priority
#define CAN_MCR_RFLM_Pos       (3U)
#define CAN_MCR_RFLM_Msk       (0x1UL << CAN_MCR_RFLM_Pos)                     //--- 0x00000008
#define CAN_MCR_RFLM           CAN_MCR_RFLM_Msk                                //----Receive FIFO Locked Mode
#define CAN_MCR_NART_Pos       (4U)
#define CAN_MCR_NART_Msk       (0x1UL << CAN_MCR_NART_Pos)                     //--- 0x00000010
#define CAN_MCR_NART           CAN_MCR_NART_Msk                                //----No Automatic Retransmission
#define CAN_MCR_AWUM_Pos       (5U)
#define CAN_MCR_AWUM_Msk       (0x1UL << CAN_MCR_AWUM_Pos)                     //--- 0x00000020
#define CAN_MCR_AWUM           CAN_MCR_AWUM_Msk                                //----Automatic Wakeup Mode
#define CAN_MCR_ABOM_Pos       (6U)
#define CAN_MCR_ABOM_Msk       (0x1UL << CAN_MCR_ABOM_Pos)                     //--- 0x00000040
#define CAN_MCR_ABOM           CAN_MCR_ABOM_Msk                                //----Automatic Bus-Off Management
#define CAN_MCR_TTCM_Pos       (7U)
#define CAN_MCR_TTCM_Msk       (0x1UL << CAN_MCR_TTCM_Pos)                     //--- 0x00000080
#define CAN_MCR_TTCM           CAN_MCR_TTCM_Msk                                //----Time Triggered Communication Mode
#define CAN_MCR_RESET_Pos      (15U)
#define CAN_MCR_RESET_Msk      (0x1UL << CAN_MCR_RESET_Pos)                    //--- 0x00008000
#define CAN_MCR_RESET          CAN_MCR_RESET_Msk                               //----bxCAN software master reset

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_MSR register
//---------------------------------------------------------------------------------------------
#define CAN_MSR_INAK_Pos       (0U)
#define CAN_MSR_INAK_Msk       (0x1UL << CAN_MSR_INAK_Pos)                     //--- 0x00000001
#define CAN_MSR_INAK           CAN_MSR_INAK_Msk                                //----Initialization Acknowledge
#define CAN_MSR_SLAK_Pos       (1U)
#define CAN_MSR_SLAK_Msk       (0x1UL << CAN_MSR_SLAK_Pos)                     //--- 0x00000002
#define CAN_MSR_SLAK           CAN_MSR_SLAK_Msk                                //----Sleep Acknowledge
#define CAN_MSR_ERRI_Pos       (2U)
#define CAN_MSR_ERRI_Msk       (0x1UL << CAN_MSR_ERRI_Pos)                     //--- 0x00000004
#define CAN_MSR_ERRI           CAN_MSR_ERRI_Msk                                //----Error Interrupt
#define CAN_MSR_WKUI_Pos       (3U)
#define CAN_MSR_WKUI_Msk       (0x1UL << CAN_MSR_WKUI_Pos)                     //--- 0x00000008
#define CAN_MSR_WKUI           CAN_MSR_WKUI_Msk                                //----Wakeup Interrupt
#define CAN_MSR_SLAKI_Pos      (4U)
#define CAN_MSR_SLAKI_Msk      (0x1UL << CAN_MSR_SLAKI_Pos)                    //--- 0x00000010
#define CAN_MSR_SLAKI          CAN_MSR_SLAKI_Msk                               //----Sleep Acknowledge Interrupt
#define CAN_MSR_TXM_Pos        (8U)
#define CAN_MSR_TXM_Msk        (0x1UL << CAN_MSR_TXM_Pos)                      //--- 0x00000100
#define CAN_MSR_TXM            CAN_MSR_TXM_Msk                                 //----Transmit Mode
#define CAN_MSR_RXM_Pos        (9U)
#define CAN_MSR_RXM_Msk        (0x1UL << CAN_MSR_RXM_Pos)                      //--- 0x00000200
#define CAN_MSR_RXM            CAN_MSR_RXM_Msk                                 //----Receive Mode
#define CAN_MSR_SAMP_Pos       (10U)
#define CAN_MSR_SAMP_Msk       (0x1UL << CAN_MSR_SAMP_Pos)                     //--- 0x00000400
#define CAN_MSR_SAMP           CAN_MSR_SAMP_Msk                                //----Last Sample Point
#define CAN_MSR_RX_Pos         (11U)
#define CAN_MSR_RX_Msk         (0x1UL << CAN_MSR_RX_Pos)                       //--- 0x00000800
#define CAN_MSR_RX             CAN_MSR_RX_Msk                                  //----CAN Rx Signal

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TSR register
//---------------------------------------------------------------------------------------------
#define CAN_TSR_RQCP0_Pos      (0U)
#define CAN_TSR_RQCP0_Msk      (0x1UL << CAN_TSR_RQCP0_Pos)                    //--- 0x00000001
#define CAN_TSR_RQCP0          CAN_TSR_RQCP0_Msk                               //----Request Completed Mailbox0
#define CAN_TSR_TXOK0_Pos      (1U)
#define CAN_TSR_TXOK0_Msk      (0x1UL << CAN_TSR_TXOK0_Pos)                    //--- 0x00000002
#define CAN_TSR_TXOK0          CAN_TSR_TXOK0_Msk                               //----Transmission OK of Mailbox0
#define CAN_TSR_ALST0_Pos      (2U)
#define CAN_TSR_ALST0_Msk      (0x1UL << CAN_TSR_ALST0_Pos)                    //--- 0x00000004
#define CAN_TSR_ALST0          CAN_TSR_ALST0_Msk                               //----Arbitration Lost for Mailbox0
#define CAN_TSR_TERR0_Pos      (3U)
#define CAN_TSR_TERR0_Msk      (0x1UL << CAN_TSR_TERR0_Pos)                    //--- 0x00000008
#define CAN_TSR_TERR0          CAN_TSR_TERR0_Msk                               //----Transmission Error of Mailbox0
#define CAN_TSR_ABRQ0_Pos      (7U)
#define CAN_TSR_ABRQ0_Msk      (0x1UL << CAN_TSR_ABRQ0_Pos)                    //--- 0x00000080
#define CAN_TSR_ABRQ0          CAN_TSR_ABRQ0_Msk                               //----Abort Request for Mailbox0
#define CAN_TSR_RQCP1_Pos      (8U)
#define CAN_TSR_RQCP1_Msk      (0x1UL << CAN_TSR_RQCP1_Pos)                    //--- 0x00000100
#define CAN_TSR_RQCP1          CAN_TSR_RQCP1_Msk                               //----Request Completed Mailbox1
#define CAN_TSR_TXOK1_Pos      (9U)
#define CAN_TSR_TXOK1_Msk      (0x1UL << CAN_TSR_TXOK1_Pos)                    //--- 0x00000200
#define CAN_TSR_TXOK1          CAN_TSR_TXOK1_Msk                               //----Transmission OK of Mailbox1
#define CAN_TSR_ALST1_Pos      (10U)
#define CAN_TSR_ALST1_Msk      (0x1UL << CAN_TSR_ALST1_Pos)                    //--- 0x00000400
#define CAN_TSR_ALST1          CAN_TSR_ALST1_Msk                               //----Arbitration Lost for Mailbox1
#define CAN_TSR_TERR1_Pos      (11U)
#define CAN_TSR_TERR1_Msk      (0x1UL << CAN_TSR_TERR1_Pos)                    //--- 0x00000800
#define CAN_TSR_TERR1          CAN_TSR_TERR1_Msk                               //----Transmission Error of Mailbox1
#define CAN_TSR_ABRQ1_Pos      (15U)
#define CAN_TSR_ABRQ1_Msk      (0x1UL << CAN_TSR_ABRQ1_Pos)                    //--- 0x00008000
#define CAN_TSR_ABRQ1          CAN_TSR_ABRQ1_Msk                               //----Abort Request for Mailbox 1
#define CAN_TSR_RQCP2_Pos      (16U)
#define CAN_TSR_RQCP2_Msk      (0x1UL << CAN_TSR_RQCP2_Pos)                    //--- 0x00010000
#define CAN_TSR_RQCP2          CAN_TSR_RQCP2_Msk                               //----Request Completed Mailbox2
#define CAN_TSR_TXOK2_Pos      (17U)
#define CAN_TSR_TXOK2_Msk      (0x1UL << CAN_TSR_TXOK2_Pos)                    //--- 0x00020000
#define CAN_TSR_TXOK2          CAN_TSR_TXOK2_Msk                               //----Transmission OK of Mailbox 2
#define CAN_TSR_ALST2_Pos      (18U)
#define CAN_TSR_ALST2_Msk      (0x1UL << CAN_TSR_ALST2_Pos)                    //--- 0x00040000
#define CAN_TSR_ALST2          CAN_TSR_ALST2_Msk                               //----Arbitration Lost for mailbox 2
#define CAN_TSR_TERR2_Pos      (19U)
#define CAN_TSR_TERR2_Msk      (0x1UL << CAN_TSR_TERR2_Pos)                    //--- 0x00080000
#define CAN_TSR_TERR2          CAN_TSR_TERR2_Msk                               //----Transmission Error of Mailbox 2
#define CAN_TSR_ABRQ2_Pos      (23U)
#define CAN_TSR_ABRQ2_Msk      (0x1UL << CAN_TSR_ABRQ2_Pos)                    //--- 0x00800000
#define CAN_TSR_ABRQ2          CAN_TSR_ABRQ2_Msk                               //----Abort Request for Mailbox 2
#define CAN_TSR_CODE_Pos       (24U)
#define CAN_TSR_CODE_Msk       (0x3UL << CAN_TSR_CODE_Pos)                     //--- 0x03000000
#define CAN_TSR_CODE           CAN_TSR_CODE_Msk                                //----Mailbox Code

