Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define CAN_TSR_TME_Pos        (26U)
#define CAN_TSR_TME_Msk        (0x7UL << CAN_TSR_TME_Pos)                      //--- 0x1C000000
#define CAN_TSR_TME            CAN_TSR_TME_Msk                                 //----TME[2:0] bits
#define CAN_TSR_TME0_Pos       (26U)
#define CAN_TSR_TME0_Msk       (0x1UL << CAN_TSR_TME0_Pos)                     //--- 0x04000000
#define CAN_TSR_TME0           CAN_TSR_TME0_Msk                                //----Transmit Mailbox 0 Empty
#define CAN_TSR_TME1_Pos       (27U)
#define CAN_TSR_TME1_Msk       (0x1UL << CAN_TSR_TME1_Pos)                     //--- 0x08000000
#define CAN_TSR_TME1           CAN_TSR_TME1_Msk                                //----Transmit Mailbox 1 Empty
#define CAN_TSR_TME2_Pos       (28U)
#define CAN_TSR_TME2_Msk       (0x1UL << CAN_TSR_TME2_Pos)                     //--- 0x10000000
#define CAN_TSR_TME2           CAN_TSR_TME2_Msk                                //----Transmit Mailbox 2 Empty

#define CAN_TSR_LOW_Pos        (29U)
#define CAN_TSR_LOW_Msk        (0x7UL << CAN_TSR_LOW_Pos)                      //--- 0xE0000000
#define CAN_TSR_LOW            CAN_TSR_LOW_Msk                                 //----LOW[2:0] bits
#define CAN_TSR_LOW0_Pos       (29U)
#define CAN_TSR_LOW0_Msk       (0x1UL << CAN_TSR_LOW0_Pos)                     //--- 0x20000000
#define CAN_TSR_LOW0           CAN_TSR_LOW0_Msk                                //----Lowest Priority Flag for Mailbox 0
#define CAN_TSR_LOW1_Pos       (30U)
#define CAN_TSR_LOW1_Msk       (0x1UL << CAN_TSR_LOW1_Pos)                     //--- 0x40000000
#define CAN_TSR_LOW1           CAN_TSR_LOW1_Msk                                //----Lowest Priority Flag for Mailbox 1
#define CAN_TSR_LOW2_Pos       (31U)
#define CAN_TSR_LOW2_Msk       (0x1UL << CAN_TSR_LOW2_Pos)                     //--- 0x80000000
#define CAN_TSR_LOW2           CAN_TSR_LOW2_Msk                                //----Lowest Priority Flag for Mailbox 2

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RF0R register
//---------------------------------------------------------------------------------------------
#define CAN_RF0R_FMP0_Pos      (0U)
#define CAN_RF0R_FMP0_Msk      (0x3UL << CAN_RF0R_FMP0_Pos)                    //--- 0x00000003
#define CAN_RF0R_FMP0          CAN_RF0R_FMP0_Msk                               //----FIFO 0 Message Pending
#define CAN_RF0R_FULL0_Pos     (3U)
#define CAN_RF0R_FULL0_Msk     (0x1UL << CAN_RF0R_FULL0_Pos)                   //--- 0x00000008
#define CAN_RF0R_FULL0         CAN_RF0R_FULL0_Msk                              //----FIFO 0 Full
#define CAN_RF0R_FOVR0_Pos     (4U)
#define CAN_RF0R_FOVR0_Msk     (0x1UL << CAN_RF0R_FOVR0_Pos)                   //--- 0x00000010
#define CAN_RF0R_FOVR0         CAN_RF0R_FOVR0_Msk                              //----FIFO 0 Overrun
#define CAN_RF0R_RFOM0_Pos     (5U)
#define CAN_RF0R_RFOM0_Msk     (0x1UL << CAN_RF0R_RFOM0_Pos)                   //--- 0x00000020
#define CAN_RF0R_RFOM0         CAN_RF0R_RFOM0_Msk                              //----Release FIFO 0 Output Mailbox

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RF1R register
//---------------------------------------------------------------------------------------------
#define CAN_RF1R_FMP1_Pos      (0U)
#define CAN_RF1R_FMP1_Msk      (0x3UL << CAN_RF1R_FMP1_Pos)                    //--- 0x00000003
#define CAN_RF1R_FMP1          CAN_RF1R_FMP1_Msk                               //----FIFO 1 Message Pending
#define CAN_RF1R_FULL1_Pos     (3U)
#define CAN_RF1R_FULL1_Msk     (0x1UL << CAN_RF1R_FULL1_Pos)                   //--- 0x00000008
#define CAN_RF1R_FULL1         CAN_RF1R_FULL1_Msk                              //----FIFO 1 Full
#define CAN_RF1R_FOVR1_Pos     (4U)
#define CAN_RF1R_FOVR1_Msk     (0x1UL << CAN_RF1R_FOVR1_Pos)                   //--- 0x00000010
#define CAN_RF1R_FOVR1         CAN_RF1R_FOVR1_Msk                              //----FIFO 1 Overrun
#define CAN_RF1R_RFOM1_Pos     (5U)
#define CAN_RF1R_RFOM1_Msk     (0x1UL << CAN_RF1R_RFOM1_Pos)                   //--- 0x00000020
#define CAN_RF1R_RFOM1         CAN_RF1R_RFOM1_Msk                              //----Release FIFO 1 Output Mailbox

//---------------------------------------------------------------------------------------------
//--- Bit definition for CAN_IER register
//---------------------------------------------------------------------------------------------
#define CAN_IER_TMEIE_Pos      (0U)
#define CAN_IER_TMEIE_Msk      (0x1UL << CAN_IER_TMEIE_Pos)                    //--- 0x00000001
#define CAN_IER_TMEIE          CAN_IER_TMEIE_Msk                               //----Transmit Mailbox Empty Interrupt Enable
#define CAN_IER_FMPIE0_Pos     (1U)
#define CAN_IER_FMPIE0_Msk     (0x1UL << CAN_IER_FMPIE0_Pos)                   //--- 0x00000002
#define CAN_IER_FMPIE0         CAN_IER_FMPIE0_Msk                              //----FIFO Message Pending Interrupt Enable
#define CAN_IER_FFIE0_Pos      (2U)
#define CAN_IER_FFIE0_Msk      (0x1UL << CAN_IER_FFIE0_Pos)                    //--- 0x00000004
#define CAN_IER_FFIE0          CAN_IER_FFIE0_Msk                               //----FIFO Full Interrupt Enable
#define CAN_IER_FOVIE0_Pos     (3U)
#define CAN_IER_FOVIE0_Msk     (0x1UL << CAN_IER_FOVIE0_Pos)                   //--- 0x00000008
#define CAN_IER_FOVIE0         CAN_IER_FOVIE0_Msk                              //----FIFO Overrun Interrupt Enable
#define CAN_IER_FMPIE1_Pos     (4U)
#define CAN_IER_FMPIE1_Msk     (0x1UL << CAN_IER_FMPIE1_Pos)                   //--- 0x00000010
#define CAN_IER_FMPIE1         CAN_IER_FMPIE1_Msk                              //----FIFO Message Pending Interrupt Enable
#define CAN_IER_FFIE1_Pos      (5U)
#define CAN_IER_FFIE1_Msk      (0x1UL << CAN_IER_FFIE1_Pos)                    //--- 0x00000020
#define CAN_IER_FFIE1          CAN_IER_FFIE1_Msk                               //----FIFO Full Interrupt Enable
#define CAN_IER_FOVIE1_Pos     (6U)
#define CAN_IER_FOVIE1_Msk     (0x1UL << CAN_IER_FOVIE1_Pos)                   //--- 0x00000040
#define CAN_IER_FOVIE1         CAN_IER_FOVIE1_Msk                              //----FIFO Overrun Interrupt Enable
#define CAN_IER_EWGIE_Pos      (8U)
#define CAN_IER_EWGIE_Msk      (0x1UL << CAN_IER_EWGIE_Pos)                    //--- 0x00000100
#define CAN_IER_EWGIE          CAN_IER_EWGIE_Msk                               //----Error Warning Interrupt Enable
#define CAN_IER_EPVIE_Pos      (9U)
#define CAN_IER_EPVIE_Msk      (0x1UL << CAN_IER_EPVIE_Pos)                    //--- 0x00000200
#define CAN_IER_EPVIE          CAN_IER_EPVIE_Msk                               //----Error Passive Interrupt Enable
#define CAN_IER_BOFIE_Pos      (10U)
#define CAN_IER_BOFIE_Msk      (0x1UL << CAN_IER_BOFIE_Pos)                    //--- 0x00000400
#define CAN_IER_BOFIE          CAN_IER_BOFIE_Msk                               //----Bus-Off Interrupt Enable
#define CAN_IER_LECIE_Pos      (11U)
#define CAN_IER_LECIE_Msk      (0x1UL << CAN_IER_LECIE_Pos)                    //--- 0x00000800
#define CAN_IER_LECIE          CAN_IER_LECIE_Msk                               //----Last Error Code Interrupt Enable
#define CAN_IER_ERRIE_Pos      (15U)
#define CAN_IER_ERRIE_Msk      (0x1UL << CAN_IER_ERRIE_Pos)                    //--- 0x00008000
#define CAN_IER_ERRIE          CAN_IER_ERRIE_Msk                               //----Error Interrupt Enable
#define CAN_IER_WKUIE_Pos      (16U)
#define CAN_IER_WKUIE_Msk      (0x1UL << CAN_IER_WKUIE_Pos)                    //--- 0x00010000
#define CAN_IER_WKUIE          CAN_IER_WKUIE_Msk                               //----Wakeup Interrupt Enable
#define CAN_IER_SLKIE_Pos      (17U)
#define CAN_IER_SLKIE_Msk      (0x1UL << CAN_IER_SLKIE_Pos)                    //--- 0x00020000
#define CAN_IER_SLKIE          CAN_IER_SLKIE_Msk                               //----Sleep Interrupt Enable

//---------------------------------------------------------------------------------------------
//--- Bit definition for CAN_ESR register
//---------------------------------------------------------------------------------------------
#define CAN_ESR_EWGF_Pos       (0U)
#define CAN_ESR_EWGF_Msk       (0x1UL << CAN_ESR_EWGF_Pos)                     //--- 0x00000001
#define CAN_ESR_EWGF           CAN_ESR_EWGF_Msk                                //----Error Warning Flag
#define CAN_ESR_EPVF_Pos       (1U)
#define CAN_ESR_EPVF_Msk       (0x1UL << CAN_ESR_EPVF_Pos)                     //--- 0x00000002
#define CAN_ESR_EPVF           CAN_ESR_EPVF_Msk                                //----Error Passive Flag
#define CAN_ESR_BOFF_Pos       (2U)
#define CAN_ESR_BOFF_Msk       (0x1UL << CAN_ESR_BOFF_Pos)                     //--- 0x00000004
#define CAN_ESR_BOFF           CAN_ESR_BOFF_Msk                                //----Bus-Off Flag

#define CAN_ESR_LEC_Pos        (4U)
#define CAN_ESR_LEC_Msk        (0x7UL << CAN_ESR_LEC_Pos)                      //--- 0x00000070
#define CAN_ESR_LEC            CAN_ESR_LEC_Msk                                 //----LEC[2:0] bits (Last Error Code)
#define CAN_ESR_LEC_0          (0x1UL << CAN_ESR_LEC_Pos)                      //--- 0x00000010
#define CAN_ESR_LEC_1          (0x2UL << CAN_ESR_LEC_Pos)                      //--- 0x00000020
#define CAN_ESR_LEC_2          (0x4UL << CAN_ESR_LEC_Pos)                      //--- 0x00000040

