Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define CAN_ESR_TEC_Pos        (16U)
#define CAN_ESR_TEC_Msk        (0xFFUL << CAN_ESR_TEC_Pos)                     //--- 0x00FF0000
#define CAN_ESR_TEC            CAN_ESR_TEC_Msk                                 //----Least significant byte of the 9-bit Transmit Error Counter
#define CAN_ESR_REC_Pos        (24U)
#define CAN_ESR_REC_Msk        (0xFFUL << CAN_ESR_REC_Pos)                     //--- 0xFF000000
#define CAN_ESR_REC            CAN_ESR_REC_Msk                                 //----Receive Error Counter

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_BTR register
//---------------------------------------------------------------------------------------------
#define CAN_BTR_BRP_Pos        (0U)
#define CAN_BTR_BRP_Msk        (0x3FFUL << CAN_BTR_BRP_Pos)                    //--- 0x000003FF
#define CAN_BTR_BRP            CAN_BTR_BRP_Msk                                 //----Baud Rate Prescaler
#define CAN_BTR_TS1_Pos        (16U)
#define CAN_BTR_TS1_Msk        (0xFUL << CAN_BTR_TS1_Pos)                      //--- 0x000F0000
#define CAN_BTR_TS1            CAN_BTR_TS1_Msk                                 //----Time Segment 1
#define CAN_BTR_TS1_0          (0x1UL << CAN_BTR_TS1_Pos)                      //--- 0x00010000
#define CAN_BTR_TS1_1          (0x2UL << CAN_BTR_TS1_Pos)                      //--- 0x00020000
#define CAN_BTR_TS1_2          (0x4UL << CAN_BTR_TS1_Pos)                      //--- 0x00040000
#define CAN_BTR_TS1_3          (0x8UL << CAN_BTR_TS1_Pos)                      //--- 0x00080000
#define CAN_BTR_TS2_Pos        (20U)
#define CAN_BTR_TS2_Msk        (0x7UL << CAN_BTR_TS2_Pos)                      //--- 0x00700000
#define CAN_BTR_TS2            CAN_BTR_TS2_Msk                                 //----Time Segment 2
#define CAN_BTR_TS2_0          (0x1UL << CAN_BTR_TS2_Pos)                      //--- 0x00100000
#define CAN_BTR_TS2_1          (0x2UL << CAN_BTR_TS2_Pos)                      //--- 0x00200000
#define CAN_BTR_TS2_2          (0x4UL << CAN_BTR_TS2_Pos)                      //--- 0x00400000
#define CAN_BTR_SJW_Pos        (24U)
#define CAN_BTR_SJW_Msk        (0x3UL << CAN_BTR_SJW_Pos)                      //--- 0x03000000
#define CAN_BTR_SJW            CAN_BTR_SJW_Msk                                 //----Resynchronization Jump Width
#define CAN_BTR_SJW_0          (0x1UL << CAN_BTR_SJW_Pos)                      //--- 0x01000000
#define CAN_BTR_SJW_1          (0x2UL << CAN_BTR_SJW_Pos)                      //--- 0x02000000
#define CAN_BTR_LBKM_Pos       (30U)
#define CAN_BTR_LBKM_Msk       (0x1UL << CAN_BTR_LBKM_Pos)                     //--- 0x40000000
#define CAN_BTR_LBKM           CAN_BTR_LBKM_Msk                                //----Loop Back Mode (Debug)
#define CAN_BTR_SILM_Pos       (31U)
#define CAN_BTR_SILM_Msk       (0x1UL << CAN_BTR_SILM_Pos)                     //--- 0x80000000
#define CAN_BTR_SILM           CAN_BTR_SILM_Msk                                //----Silent Mode

//---------------------------------------------------------------------------------------------
//----Mailbox registers
//---   Bit definition for CAN_TI0R register
//---------------------------------------------------------------------------------------------
#define CAN_TI0R_TXRQ_Pos      (0U)
#define CAN_TI0R_TXRQ_Msk      (0x1UL << CAN_TI0R_TXRQ_Pos)                    //--- 0x00000001
#define CAN_TI0R_TXRQ          CAN_TI0R_TXRQ_Msk                               //----Transmit Mailbox Request
#define CAN_TI0R_RTR_Pos       (1U)
#define CAN_TI0R_RTR_Msk       (0x1UL << CAN_TI0R_RTR_Pos)                     //--- 0x00000002
#define CAN_TI0R_RTR           CAN_TI0R_RTR_Msk                                //----Remote Transmission Request
#define CAN_TI0R_IDE_Pos       (2U)
#define CAN_TI0R_IDE_Msk       (0x1UL << CAN_TI0R_IDE_Pos)                     //--- 0x00000004
#define CAN_TI0R_IDE           CAN_TI0R_IDE_Msk                                //----Identifier Extension
#define CAN_TI0R_EXID_Pos      (3U)
#define CAN_TI0R_EXID_Msk      (0x3FFFFUL << CAN_TI0R_EXID_Pos)                //--- 0x001FFFF8
#define CAN_TI0R_EXID          CAN_TI0R_EXID_Msk                               //----Extended Identifier
#define CAN_TI0R_STID_Pos      (21U)
#define CAN_TI0R_STID_Msk      (0x7FFUL << CAN_TI0R_STID_Pos)                  //--- 0xFFE00000
#define CAN_TI0R_STID          CAN_TI0R_STID_Msk                               //----Standard Identifier or Extended Identifier

//---------------------------------------------------------------------------------------------
//---   Bit definition for CAN_TDT0R register
//---------------------------------------------------------------------------------------------
#define CAN_TDT0R_DLC_Pos      (0U)
#define CAN_TDT0R_DLC_Msk      (0xFUL << CAN_TDT0R_DLC_Pos)                    //--- 0x0000000F
#define CAN_TDT0R_DLC          CAN_TDT0R_DLC_Msk                               //----Data Length Code
#define CAN_TDT0R_TGT_Pos      (8U)
#define CAN_TDT0R_TGT_Msk      (0x1UL << CAN_TDT0R_TGT_Pos)                    //--- 0x00000100
#define CAN_TDT0R_TGT          CAN_TDT0R_TGT_Msk                               //----Transmit Global Time
#define CAN_TDT0R_TIME_Pos     (16U)
#define CAN_TDT0R_TIME_Msk     (0xFFFFUL << CAN_TDT0R_TIME_Pos)                //--- 0xFFFF0000
#define CAN_TDT0R_TIME         CAN_TDT0R_TIME_Msk                              //----Message Time Stamp

//---------------------------------------------------------------------------------------------
//---   Bit definition for CAN_TDL0R register
//---------------------------------------------------------------------------------------------
#define CAN_TDL0R_DATA0_Pos    (0U)
#define CAN_TDL0R_DATA0_Msk    (0xFFUL << CAN_TDL0R_DATA0_Pos)                 //--- 0x000000FF
#define CAN_TDL0R_DATA0        CAN_TDL0R_DATA0_Msk                             //----Data byte 0
#define CAN_TDL0R_DATA1_Pos    (8U)
#define CAN_TDL0R_DATA1_Msk    (0xFFUL << CAN_TDL0R_DATA1_Pos)                 //--- 0x0000FF00
#define CAN_TDL0R_DATA1        CAN_TDL0R_DATA1_Msk                             //----Data byte 1
#define CAN_TDL0R_DATA2_Pos    (16U)
#define CAN_TDL0R_DATA2_Msk    (0xFFUL << CAN_TDL0R_DATA2_Pos)                 //--- 0x00FF0000
#define CAN_TDL0R_DATA2        CAN_TDL0R_DATA2_Msk                             //----Data byte 2
#define CAN_TDL0R_DATA3_Pos    (24U)
#define CAN_TDL0R_DATA3_Msk    (0xFFUL << CAN_TDL0R_DATA3_Pos)                 //--- 0xFF000000
#define CAN_TDL0R_DATA3        CAN_TDL0R_DATA3_Msk                             //----Data byte 3

//---------------------------------------------------------------------------------------------
//---   Bit definition for CAN_TDH0R register
//---------------------------------------------------------------------------------------------
#define CAN_TDH0R_DATA4_Pos    (0U)
#define CAN_TDH0R_DATA4_Msk    (0xFFUL << CAN_TDH0R_DATA4_Pos)                 //--- 0x000000FF
#define CAN_TDH0R_DATA4        CAN_TDH0R_DATA4_Msk                             //----Data byte 4
#define CAN_TDH0R_DATA5_Pos    (8U)
#define CAN_TDH0R_DATA5_Msk    (0xFFUL << CAN_TDH0R_DATA5_Pos)                 //--- 0x0000FF00
#define CAN_TDH0R_DATA5        CAN_TDH0R_DATA5_Msk                             //----Data byte 5
#define CAN_TDH0R_DATA6_Pos    (16U)
#define CAN_TDH0R_DATA6_Msk    (0xFFUL << CAN_TDH0R_DATA6_Pos)                 //--- 0x00FF0000
#define CAN_TDH0R_DATA6        CAN_TDH0R_DATA6_Msk                             //----Data byte 6
#define CAN_TDH0R_DATA7_Pos    (24U)
#define CAN_TDH0R_DATA7_Msk    (0xFFUL << CAN_TDH0R_DATA7_Pos)                 //--- 0xFF000000
#define CAN_TDH0R_DATA7        CAN_TDH0R_DATA7_Msk                             //----Data byte 7

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TI1R register
//---------------------------------------------------------------------------------------------
#define CAN_TI1R_TXRQ_Pos      (0U)
#define CAN_TI1R_TXRQ_Msk      (0x1UL << CAN_TI1R_TXRQ_Pos)                    //--- 0x00000001
#define CAN_TI1R_TXRQ          CAN_TI1R_TXRQ_Msk                               //----Transmit Mailbox Request
#define CAN_TI1R_RTR_Pos       (1U)
#define CAN_TI1R_RTR_Msk       (0x1UL << CAN_TI1R_RTR_Pos)                     //--- 0x00000002
#define CAN_TI1R_RTR           CAN_TI1R_RTR_Msk                                //----Remote Transmission Request
#define CAN_TI1R_IDE_Pos       (2U)
#define CAN_TI1R_IDE_Msk       (0x1UL << CAN_TI1R_IDE_Pos)                     //--- 0x00000004
#define CAN_TI1R_IDE           CAN_TI1R_IDE_Msk                                //----Identifier Extension
#define CAN_TI1R_EXID_Pos      (3U)
#define CAN_TI1R_EXID_Msk      (0x3FFFFUL << CAN_TI1R_EXID_Pos)                //--- 0x001FFFF8
#define CAN_TI1R_EXID          CAN_TI1R_EXID_Msk                               //----Extended Identifier
#define CAN_TI1R_STID_Pos      (21U)
#define CAN_TI1R_STID_Msk      (0x7FFUL << CAN_TI1R_STID_Pos)                  //--- 0xFFE00000
#define CAN_TI1R_STID          CAN_TI1R_STID_Msk                               //----Standard Identifier or Extended Identifier

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TDT1R register
//---------------------------------------------------------------------------------------------
#define CAN_TDT1R_DLC_Pos      (0U)
#define CAN_TDT1R_DLC_Msk      (0xFUL << CAN_TDT1R_DLC_Pos)                    //--- 0x0000000F
#define CAN_TDT1R_DLC          CAN_TDT1R_DLC_Msk                               //----Data Length Code
#define CAN_TDT1R_TGT_Pos      (8U)
#define CAN_TDT1R_TGT_Msk      (0x1UL << CAN_TDT1R_TGT_Pos)                    //--- 0x00000100
#define CAN_TDT1R_TGT          CAN_TDT1R_TGT_Msk                               //----Transmit Global Time
#define CAN_TDT1R_TIME_Pos     (16U)
#define CAN_TDT1R_TIME_Msk     (0xFFFFUL << CAN_TDT1R_TIME_Pos)                //--- 0xFFFF0000
#define CAN_TDT1R_TIME         CAN_TDT1R_TIME_Msk                              //----Message Time Stamp

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TDL1R register
//---------------------------------------------------------------------------------------------
#define CAN_TDL1R_DATA0_Pos    (0U)
#define CAN_TDL1R_DATA0_Msk    (0xFFUL << CAN_TDL1R_DATA0_Pos)                 //--- 0x000000FF
#define CAN_TDL1R_DATA0        CAN_TDL1R_DATA0_Msk                             //----Data byte 0
#define CAN_TDL1R_DATA1_Pos    (8U)
#define CAN_TDL1R_DATA1_Msk    (0xFFUL << CAN_TDL1R_DATA1_Pos)                 //--- 0x0000FF00
#define CAN_TDL1R_DATA1        CAN_TDL1R_DATA1_Msk                             //----Data byte 1
#define CAN_TDL1R_DATA2_Pos    (16U)
#define CAN_TDL1R_DATA2_Msk    (0xFFUL << CAN_TDL1R_DATA2_Pos)                 //--- 0x00FF0000
#define CAN_TDL1R_DATA2        CAN_TDL1R_DATA2_Msk                             //----Data byte 2
#define CAN_TDL1R_DATA3_Pos    (24U)
#define CAN_TDL1R_DATA3_Msk    (0xFFUL << CAN_TDL1R_DATA3_Pos)                 //--- 0xFF000000
#define CAN_TDL1R_DATA3        CAN_TDL1R_DATA3_Msk                             //----Data byte 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TDH1R register
//---------------------------------------------------------------------------------------------
#define CAN_TDH1R_DATA4_Pos    (0U)
#define CAN_TDH1R_DATA4_Msk    (0xFFUL << CAN_TDH1R_DATA4_Pos)                 //--- 0x000000FF
#define CAN_TDH1R_DATA4        CAN_TDH1R_DATA4_Msk                             //----Data byte 4
#define CAN_TDH1R_DATA5_Pos    (8U)
#define CAN_TDH1R_DATA5_Msk    (0xFFUL << CAN_TDH1R_DATA5_Pos)                 //--- 0x0000FF00
#define CAN_TDH1R_DATA5        CAN_TDH1R_DATA5_Msk                             //----Data byte 5
#define CAN_TDH1R_DATA6_Pos    (16U)
#define CAN_TDH1R_DATA6_Msk    (0xFFUL << CAN_TDH1R_DATA6_Pos)                 //--- 0x00FF0000
#define CAN_TDH1R_DATA6        CAN_TDH1R_DATA6_Msk                             //----Data byte 6
#define CAN_TDH1R_DATA7_Pos    (24U)
#define CAN_TDH1R_DATA7_Msk    (0xFFUL << CAN_TDH1R_DATA7_Pos)                 //--- 0xFF000000
#define CAN_TDH1R_DATA7        CAN_TDH1R_DATA7_Msk                             //----Data byte 7

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TI2R register
//---------------------------------------------------------------------------------------------
#define CAN_TI2R_TXRQ_Pos      (0U)
#define CAN_TI2R_TXRQ_Msk      (0x1UL << CAN_TI2R_TXRQ_Pos)                    //--- 0x00000001
#define CAN_TI2R_TXRQ          CAN_TI2R_TXRQ_Msk                               //----Transmit Mailbox Request
#define CAN_TI2R_RTR_Pos       (1U)
#define CAN_TI2R_RTR_Msk       (0x1UL << CAN_TI2R_RTR_Pos)                     //--- 0x00000002
#define CAN_TI2R_RTR           CAN_TI2R_RTR_Msk                                //----Remote Transmission Request
#define CAN_TI2R_IDE_Pos       (2U)
#define CAN_TI2R_IDE_Msk       (0x1UL << CAN_TI2R_IDE_Pos)                     //--- 0x00000004
#define CAN_TI2R_IDE           CAN_TI2R_IDE_Msk                                //----Identifier Extension
#define CAN_TI2R_EXID_Pos      (3U)
#define CAN_TI2R_EXID_Msk      (0x3FFFFUL << CAN_TI2R_EXID_Pos)                //--- 0x001FFFF8
#define CAN_TI2R_EXID          CAN_TI2R_EXID_Msk                               //----Extended identifier
#define CAN_TI2R_STID_Pos      (21U)
#define CAN_TI2R_STID_Msk      (0x7FFUL << CAN_TI2R_STID_Pos)                  //--- 0xFFE00000
#define CAN_TI2R_STID          CAN_TI2R_STID_Msk                               //----Standard Identifier or Extended Identifier

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TDT2R register
//---------------------------------------------------------------------------------------------
#define CAN_TDT2R_DLC_Pos      (0U)
#define CAN_TDT2R_DLC_Msk      (0xFUL << CAN_TDT2R_DLC_Pos)                    //--- 0x0000000F
#define CAN_TDT2R_DLC          CAN_TDT2R_DLC_Msk                               //----Data Length Code
#define CAN_TDT2R_TGT_Pos      (8U)
#define CAN_TDT2R_TGT_Msk      (0x1UL << CAN_TDT2R_TGT_Pos)                    //--- 0x00000100
#define CAN_TDT2R_TGT          CAN_TDT2R_TGT_Msk                               //----Transmit Global Time
#define CAN_TDT2R_TIME_Pos     (16U)
#define CAN_TDT2R_TIME_Msk     (0xFFFFUL << CAN_TDT2R_TIME_Pos)                //--- 0xFFFF0000
#define CAN_TDT2R_TIME         CAN_TDT2R_TIME_Msk                              //----Message Time Stamp

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TDL2R register
//---------------------------------------------------------------------------------------------
#define CAN_TDL2R_DATA0_Pos    (0U)
#define CAN_TDL2R_DATA0_Msk    (0xFFUL << CAN_TDL2R_DATA0_Pos)                 //--- 0x000000FF
#define CAN_TDL2R_DATA0        CAN_TDL2R_DATA0_Msk                             //----Data byte 0
#define CAN_TDL2R_DATA1_Pos    (8U)
#define CAN_TDL2R_DATA1_Msk    (0xFFUL << CAN_TDL2R_DATA1_Pos)                 //--- 0x0000FF00
#define CAN_TDL2R_DATA1        CAN_TDL2R_DATA1_Msk                             //----Data byte 1
#define CAN_TDL2R_DATA2_Pos    (16U)
#define CAN_TDL2R_DATA2_Msk    (0xFFUL << CAN_TDL2R_DATA2_Pos)                 //--- 0x00FF0000
#define CAN_TDL2R_DATA2        CAN_TDL2R_DATA2_Msk                             //----Data byte 2
#define CAN_TDL2R_DATA3_Pos    (24U)
#define CAN_TDL2R_DATA3_Msk    (0xFFUL << CAN_TDL2R_DATA3_Pos)                 //--- 0xFF000000
#define CAN_TDL2R_DATA3        CAN_TDL2R_DATA3_Msk                             //----Data byte 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_TDH2R register
//---------------------------------------------------------------------------------------------
#define CAN_TDH2R_DATA4_Pos    (0U)
#define CAN_TDH2R_DATA4_Msk    (0xFFUL << CAN_TDH2R_DATA4_Pos)                 //--- 0x000000FF
#define CAN_TDH2R_DATA4        CAN_TDH2R_DATA4_Msk                             //----Data byte 4
#define CAN_TDH2R_DATA5_Pos    (8U)
#define CAN_TDH2R_DATA5_Msk    (0xFFUL << CAN_TDH2R_DATA5_Pos)                 //--- 0x0000FF00
#define CAN_TDH2R_DATA5        CAN_TDH2R_DATA5_Msk                             //----Data byte 5
#define CAN_TDH2R_DATA6_Pos    (16U)
#define CAN_TDH2R_DATA6_Msk    (0xFFUL << CAN_TDH2R_DATA6_Pos)                 //--- 0x00FF0000
#define CAN_TDH2R_DATA6        CAN_TDH2R_DATA6_Msk                             //----Data byte 6
#define CAN_TDH2R_DATA7_Pos    (24U)
#define CAN_TDH2R_DATA7_Msk    (0xFFUL << CAN_TDH2R_DATA7_Pos)                 //--- 0xFF000000
#define CAN_TDH2R_DATA7        CAN_TDH2R_DATA7_Msk                             //----Data byte 7

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RI0R register
//---------------------------------------------------------------------------------------------
#define CAN_RI0R_RTR_Pos       (1U)
#define CAN_RI0R_RTR_Msk       (0x1UL << CAN_RI0R_RTR_Pos)                     //--- 0x00000002
#define CAN_RI0R_RTR           CAN_RI0R_RTR_Msk                                //----Remote Transmission Request
#define CAN_RI0R_IDE_Pos       (2U)
#define CAN_RI0R_IDE_Msk       (0x1UL << CAN_RI0R_IDE_Pos)                     //--- 0x00000004
#define CAN_RI0R_IDE           CAN_RI0R_IDE_Msk                                //----Identifier Extension
#define CAN_RI0R_EXID_Pos      (3U)
#define CAN_RI0R_EXID_Msk      (0x3FFFFUL << CAN_RI0R_EXID_Pos)                //--- 0x001FFFF8
#define CAN_RI0R_EXID          CAN_RI0R_EXID_Msk                               //----Extended Identifier
#define CAN_RI0R_STID_Pos      (21U)
#define CAN_RI0R_STID_Msk      (0x7FFUL << CAN_RI0R_STID_Pos)                  //--- 0xFFE00000
#define CAN_RI0R_STID          CAN_RI0R_STID_Msk                               //----Standard Identifier or Extended Identifier

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RDT0R register
//---------------------------------------------------------------------------------------------
#define CAN_RDT0R_DLC_Pos      (0U)
#define CAN_RDT0R_DLC_Msk      (0xFUL << CAN_RDT0R_DLC_Pos)                    //--- 0x0000000F
#define CAN_RDT0R_DLC          CAN_RDT0R_DLC_Msk                               //----Data Length Code
#define CAN_RDT0R_FMI_Pos      (8U)
#define CAN_RDT0R_FMI_Msk      (0xFFUL << CAN_RDT0R_FMI_Pos)                   //--- 0x0000FF00
#define CAN_RDT0R_FMI          CAN_RDT0R_FMI_Msk                               //----Filter Match Index
#define CAN_RDT0R_TIME_Pos     (16U)
#define CAN_RDT0R_TIME_Msk     (0xFFFFUL << CAN_RDT0R_TIME_Pos)                //--- 0xFFFF0000
#define CAN_RDT0R_TIME         CAN_RDT0R_TIME_Msk                              //----Message Time Stamp

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RDL0R register
//---------------------------------------------------------------------------------------------
#define CAN_RDL0R_DATA0_Pos    (0U)
#define CAN_RDL0R_DATA0_Msk    (0xFFUL << CAN_RDL0R_DATA0_Pos)                 //--- 0x000000FF
#define CAN_RDL0R_DATA0        CAN_RDL0R_DATA0_Msk                             //----Data byte 0
#define CAN_RDL0R_DATA1_Pos    (8U)
#define CAN_RDL0R_DATA1_Msk    (0xFFUL << CAN_RDL0R_DATA1_Pos)                 //--- 0x0000FF00
#define CAN_RDL0R_DATA1        CAN_RDL0R_DATA1_Msk                             //----Data byte 1
#define CAN_RDL0R_DATA2_Pos    (16U)
#define CAN_RDL0R_DATA2_Msk    (0xFFUL << CAN_RDL0R_DATA2_Pos)                 //--- 0x00FF0000
#define CAN_RDL0R_DATA2        CAN_RDL0R_DATA2_Msk                             //----Data byte 2
#define CAN_RDL0R_DATA3_Pos    (24U)
#define CAN_RDL0R_DATA3_Msk    (0xFFUL << CAN_RDL0R_DATA3_Pos)                 //--- 0xFF000000
#define CAN_RDL0R_DATA3        CAN_RDL0R_DATA3_Msk                             //----Data byte 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RDH0R register
//---------------------------------------------------------------------------------------------
#define CAN_RDH0R_DATA4_Pos    (0U)
#define CAN_RDH0R_DATA4_Msk    (0xFFUL << CAN_RDH0R_DATA4_Pos)                 //--- 0x000000FF
#define CAN_RDH0R_DATA4        CAN_RDH0R_DATA4_Msk                             //----Data byte 4
#define CAN_RDH0R_DATA5_Pos    (8U)
#define CAN_RDH0R_DATA5_Msk    (0xFFUL << CAN_RDH0R_DATA5_Pos)                 //--- 0x0000FF00
#define CAN_RDH0R_DATA5        CAN_RDH0R_DATA5_Msk                             //----Data byte 5
#define CAN_RDH0R_DATA6_Pos    (16U)
#define CAN_RDH0R_DATA6_Msk    (0xFFUL << CAN_RDH0R_DATA6_Pos)                 //--- 0x00FF0000
#define CAN_RDH0R_DATA6        CAN_RDH0R_DATA6_Msk                             //----Data byte 6
#define CAN_RDH0R_DATA7_Pos    (24U)
#define CAN_RDH0R_DATA7_Msk    (0xFFUL << CAN_RDH0R_DATA7_Pos)                 //--- 0xFF000000
#define CAN_RDH0R_DATA7        CAN_RDH0R_DATA7_Msk                             //----Data byte 7

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RI1R register
//---------------------------------------------------------------------------------------------
#define CAN_RI1R_RTR_Pos       (1U)
#define CAN_RI1R_RTR_Msk       (0x1UL << CAN_RI1R_RTR_Pos)                     //--- 0x00000002
#define CAN_RI1R_RTR           CAN_RI1R_RTR_Msk                                //----Remote Transmission Request
#define CAN_RI1R_IDE_Pos       (2U)
#define CAN_RI1R_IDE_Msk       (0x1UL << CAN_RI1R_IDE_Pos)                     //--- 0x00000004
#define CAN_RI1R_IDE           CAN_RI1R_IDE_Msk                                //----Identifier Extension
#define CAN_RI1R_EXID_Pos      (3U)
#define CAN_RI1R_EXID_Msk      (0x3FFFFUL << CAN_RI1R_EXID_Pos)                //--- 0x001FFFF8
#define CAN_RI1R_EXID          CAN_RI1R_EXID_Msk                               //----Extended identifier
#define CAN_RI1R_STID_Pos      (21U)
#define CAN_RI1R_STID_Msk      (0x7FFUL << CAN_RI1R_STID_Pos)                  //--- 0xFFE00000
#define CAN_RI1R_STID          CAN_RI1R_STID_Msk                               //----Standard Identifier or Extended Identifier

