Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RDT1R register
//---------------------------------------------------------------------------------------------
#define CAN_RDT1R_DLC_Pos      (0U)
#define CAN_RDT1R_DLC_Msk      (0xFUL << CAN_RDT1R_DLC_Pos)                    //--- 0x0000000F
#define CAN_RDT1R_DLC          CAN_RDT1R_DLC_Msk                               //----Data Length Code
#define CAN_RDT1R_FMI_Pos      (8U)
#define CAN_RDT1R_FMI_Msk      (0xFFUL << CAN_RDT1R_FMI_Pos)                   //--- 0x0000FF00
#define CAN_RDT1R_FMI          CAN_RDT1R_FMI_Msk                               //----Filter Match Index
#define CAN_RDT1R_TIME_Pos     (16U)
#define CAN_RDT1R_TIME_Msk     (0xFFFFUL << CAN_RDT1R_TIME_Pos)                //--- 0xFFFF0000
#define CAN_RDT1R_TIME         CAN_RDT1R_TIME_Msk                              //----Message Time Stamp

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RDL1R register
//---------------------------------------------------------------------------------------------
#define CAN_RDL1R_DATA0_Pos    (0U)
#define CAN_RDL1R_DATA0_Msk    (0xFFUL << CAN_RDL1R_DATA0_Pos)                 //--- 0x000000FF
#define CAN_RDL1R_DATA0        CAN_RDL1R_DATA0_Msk                             //----Data byte 0
#define CAN_RDL1R_DATA1_Pos    (8U)
#define CAN_RDL1R_DATA1_Msk    (0xFFUL << CAN_RDL1R_DATA1_Pos)                 //--- 0x0000FF00
#define CAN_RDL1R_DATA1        CAN_RDL1R_DATA1_Msk                             //----Data byte 1
#define CAN_RDL1R_DATA2_Pos    (16U)
#define CAN_RDL1R_DATA2_Msk    (0xFFUL << CAN_RDL1R_DATA2_Pos)                 //--- 0x00FF0000
#define CAN_RDL1R_DATA2        CAN_RDL1R_DATA2_Msk                             //----Data byte 2
#define CAN_RDL1R_DATA3_Pos    (24U)
#define CAN_RDL1R_DATA3_Msk    (0xFFUL << CAN_RDL1R_DATA3_Pos)                 //--- 0xFF000000
#define CAN_RDL1R_DATA3        CAN_RDL1R_DATA3_Msk                             //----Data byte 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_RDH1R register
//---------------------------------------------------------------------------------------------
#define CAN_RDH1R_DATA4_Pos    (0U)
#define CAN_RDH1R_DATA4_Msk    (0xFFUL << CAN_RDH1R_DATA4_Pos)                 //--- 0x000000FF
#define CAN_RDH1R_DATA4        CAN_RDH1R_DATA4_Msk                             //----Data byte 4
#define CAN_RDH1R_DATA5_Pos    (8U)
#define CAN_RDH1R_DATA5_Msk    (0xFFUL << CAN_RDH1R_DATA5_Pos)                 //--- 0x0000FF00
#define CAN_RDH1R_DATA5        CAN_RDH1R_DATA5_Msk                             //----Data byte 5
#define CAN_RDH1R_DATA6_Pos    (16U)
#define CAN_RDH1R_DATA6_Msk    (0xFFUL << CAN_RDH1R_DATA6_Pos)                 //--- 0x00FF0000
#define CAN_RDH1R_DATA6        CAN_RDH1R_DATA6_Msk                             //----Data byte 6
#define CAN_RDH1R_DATA7_Pos    (24U)
#define CAN_RDH1R_DATA7_Msk    (0xFFUL << CAN_RDH1R_DATA7_Pos)                 //--- 0xFF000000
#define CAN_RDH1R_DATA7        CAN_RDH1R_DATA7_Msk                             //----Data byte 7

//---------------------------------------------------------------------------------------------
//----CAN filter registers
//---  Bit definition for CAN_FMR register
//---------------------------------------------------------------------------------------------
#define CAN_FMR_FINIT_Pos      (0U)
#define CAN_FMR_FINIT_Msk      (0x1UL << CAN_FMR_FINIT_Pos)                    //--- 0x00000001
#define CAN_FMR_FINIT          CAN_FMR_FINIT_Msk                               //----Filter Init Mode

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_FM1R register
//---------------------------------------------------------------------------------------------
#define CAN_FM1R_FBM_Pos       (0U)
#define CAN_FM1R_FBM_Msk       (0x3FFFUL << CAN_FM1R_FBM_Pos)                  //--- 0x00003FFF
#define CAN_FM1R_FBM           CAN_FM1R_FBM_Msk                                //----Filter Mode
#define CAN_FM1R_FBM0_Pos      (0U)
#define CAN_FM1R_FBM0_Msk      (0x1UL << CAN_FM1R_FBM0_Pos)                    //--- 0x00000001
#define CAN_FM1R_FBM0          CAN_FM1R_FBM0_Msk                               //----Filter Init Mode bit 0
#define CAN_FM1R_FBM1_Pos      (1U)
#define CAN_FM1R_FBM1_Msk      (0x1UL << CAN_FM1R_FBM1_Pos)                    //--- 0x00000002
#define CAN_FM1R_FBM1          CAN_FM1R_FBM1_Msk                               //----Filter Init Mode bit 1
#define CAN_FM1R_FBM2_Pos      (2U)
#define CAN_FM1R_FBM2_Msk      (0x1UL << CAN_FM1R_FBM2_Pos)                    //--- 0x00000004
#define CAN_FM1R_FBM2          CAN_FM1R_FBM2_Msk                               //----Filter Init Mode bit 2
#define CAN_FM1R_FBM3_Pos      (3U)
#define CAN_FM1R_FBM3_Msk      (0x1UL << CAN_FM1R_FBM3_Pos)                    //--- 0x00000008
#define CAN_FM1R_FBM3          CAN_FM1R_FBM3_Msk                               //----Filter Init Mode bit 3
#define CAN_FM1R_FBM4_Pos      (4U)
#define CAN_FM1R_FBM4_Msk      (0x1UL << CAN_FM1R_FBM4_Pos)                    //--- 0x00000010
#define CAN_FM1R_FBM4          CAN_FM1R_FBM4_Msk                               //----Filter Init Mode bit 4
#define CAN_FM1R_FBM5_Pos      (5U)
#define CAN_FM1R_FBM5_Msk      (0x1UL << CAN_FM1R_FBM5_Pos)                    //--- 0x00000020
#define CAN_FM1R_FBM5          CAN_FM1R_FBM5_Msk                               //----Filter Init Mode bit 5
#define CAN_FM1R_FBM6_Pos      (6U)
#define CAN_FM1R_FBM6_Msk      (0x1UL << CAN_FM1R_FBM6_Pos)                    //--- 0x00000040
#define CAN_FM1R_FBM6          CAN_FM1R_FBM6_Msk                               //----Filter Init Mode bit 6
#define CAN_FM1R_FBM7_Pos      (7U)
#define CAN_FM1R_FBM7_Msk      (0x1UL << CAN_FM1R_FBM7_Pos)                    //--- 0x00000080
#define CAN_FM1R_FBM7          CAN_FM1R_FBM7_Msk                               //----Filter Init Mode bit 7
#define CAN_FM1R_FBM8_Pos      (8U)
#define CAN_FM1R_FBM8_Msk      (0x1UL << CAN_FM1R_FBM8_Pos)                    //--- 0x00000100
#define CAN_FM1R_FBM8          CAN_FM1R_FBM8_Msk                               //----Filter Init Mode bit 8
#define CAN_FM1R_FBM9_Pos      (9U)
#define CAN_FM1R_FBM9_Msk      (0x1UL << CAN_FM1R_FBM9_Pos)                    //--- 0x00000200
#define CAN_FM1R_FBM9          CAN_FM1R_FBM9_Msk                               //----Filter Init Mode bit 9
#define CAN_FM1R_FBM10_Pos     (10U)
#define CAN_FM1R_FBM10_Msk     (0x1UL << CAN_FM1R_FBM10_Pos)                   //--- 0x00000400
#define CAN_FM1R_FBM10         CAN_FM1R_FBM10_Msk                              //----Filter Init Mode bit 10
#define CAN_FM1R_FBM11_Pos     (11U)
#define CAN_FM1R_FBM11_Msk     (0x1UL << CAN_FM1R_FBM11_Pos)                   //--- 0x00000800
#define CAN_FM1R_FBM11         CAN_FM1R_FBM11_Msk                              //----Filter Init Mode bit 11
#define CAN_FM1R_FBM12_Pos     (12U)
#define CAN_FM1R_FBM12_Msk     (0x1UL << CAN_FM1R_FBM12_Pos)                   //--- 0x00001000
#define CAN_FM1R_FBM12         CAN_FM1R_FBM12_Msk                              //----Filter Init Mode bit 12
#define CAN_FM1R_FBM13_Pos     (13U)
#define CAN_FM1R_FBM13_Msk     (0x1UL << CAN_FM1R_FBM13_Pos)                   //--- 0x00002000
#define CAN_FM1R_FBM13         CAN_FM1R_FBM13_Msk                              //----Filter Init Mode bit 13

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_FS1R register
//---------------------------------------------------------------------------------------------
#define CAN_FS1R_FSC_Pos       (0U)
#define CAN_FS1R_FSC_Msk       (0x3FFFUL << CAN_FS1R_FSC_Pos)                  //--- 0x00003FFF
#define CAN_FS1R_FSC           CAN_FS1R_FSC_Msk                                //----Filter Scale Configuration
#define CAN_FS1R_FSC0_Pos      (0U)
#define CAN_FS1R_FSC0_Msk      (0x1UL << CAN_FS1R_FSC0_Pos)                    //--- 0x00000001
#define CAN_FS1R_FSC0          CAN_FS1R_FSC0_Msk                               //----Filter Scale Configuration bit 0
#define CAN_FS1R_FSC1_Pos      (1U)
#define CAN_FS1R_FSC1_Msk      (0x1UL << CAN_FS1R_FSC1_Pos)                    //--- 0x00000002
#define CAN_FS1R_FSC1          CAN_FS1R_FSC1_Msk                               //----Filter Scale Configuration bit 1
#define CAN_FS1R_FSC2_Pos      (2U)
#define CAN_FS1R_FSC2_Msk      (0x1UL << CAN_FS1R_FSC2_Pos)                    //--- 0x00000004
#define CAN_FS1R_FSC2          CAN_FS1R_FSC2_Msk                               //----Filter Scale Configuration bit 2
#define CAN_FS1R_FSC3_Pos      (3U)
#define CAN_FS1R_FSC3_Msk      (0x1UL << CAN_FS1R_FSC3_Pos)                    //--- 0x00000008
#define CAN_FS1R_FSC3          CAN_FS1R_FSC3_Msk                               //----Filter Scale Configuration bit 3
#define CAN_FS1R_FSC4_Pos      (4U)
#define CAN_FS1R_FSC4_Msk      (0x1UL << CAN_FS1R_FSC4_Pos)                    //--- 0x00000010
#define CAN_FS1R_FSC4          CAN_FS1R_FSC4_Msk                               //----Filter Scale Configuration bit 4
#define CAN_FS1R_FSC5_Pos      (5U)
#define CAN_FS1R_FSC5_Msk      (0x1UL << CAN_FS1R_FSC5_Pos)                    //--- 0x00000020
#define CAN_FS1R_FSC5          CAN_FS1R_FSC5_Msk                               //----Filter Scale Configuration bit 5
#define CAN_FS1R_FSC6_Pos      (6U)
#define CAN_FS1R_FSC6_Msk      (0x1UL << CAN_FS1R_FSC6_Pos)                    //--- 0x00000040
#define CAN_FS1R_FSC6          CAN_FS1R_FSC6_Msk                               //----Filter Scale Configuration bit 6
#define CAN_FS1R_FSC7_Pos      (7U)
#define CAN_FS1R_FSC7_Msk      (0x1UL << CAN_FS1R_FSC7_Pos)                    //--- 0x00000080
#define CAN_FS1R_FSC7          CAN_FS1R_FSC7_Msk                               //----Filter Scale Configuration bit 7
#define CAN_FS1R_FSC8_Pos      (8U)
#define CAN_FS1R_FSC8_Msk      (0x1UL << CAN_FS1R_FSC8_Pos)                    //--- 0x00000100
#define CAN_FS1R_FSC8          CAN_FS1R_FSC8_Msk                               //----Filter Scale Configuration bit 8
#define CAN_FS1R_FSC9_Pos      (9U)
#define CAN_FS1R_FSC9_Msk      (0x1UL << CAN_FS1R_FSC9_Pos)                    //--- 0x00000200
#define CAN_FS1R_FSC9          CAN_FS1R_FSC9_Msk                               //----Filter Scale Configuration bit 9
#define CAN_FS1R_FSC10_Pos     (10U)
#define CAN_FS1R_FSC10_Msk     (0x1UL << CAN_FS1R_FSC10_Pos)                   //--- 0x00000400
#define CAN_FS1R_FSC10         CAN_FS1R_FSC10_Msk                              //----Filter Scale Configuration bit 10
#define CAN_FS1R_FSC11_Pos     (11U)
#define CAN_FS1R_FSC11_Msk     (0x1UL << CAN_FS1R_FSC11_Pos)                   //--- 0x00000800
#define CAN_FS1R_FSC11         CAN_FS1R_FSC11_Msk                              //----Filter Scale Configuration bit 11
#define CAN_FS1R_FSC12_Pos     (12U)
#define CAN_FS1R_FSC12_Msk     (0x1UL << CAN_FS1R_FSC12_Pos)                   //--- 0x00001000
#define CAN_FS1R_FSC12         CAN_FS1R_FSC12_Msk                              //----Filter Scale Configuration bit 12
#define CAN_FS1R_FSC13_Pos     (13U)
#define CAN_FS1R_FSC13_Msk     (0x1UL << CAN_FS1R_FSC13_Pos)                   //--- 0x00002000
#define CAN_FS1R_FSC13         CAN_FS1R_FSC13_Msk                              //----Filter Scale Configuration bit 13

//---------------------------------------------------------------------------------------------
//---   Bit definition for CAN_FFA1R register
//---------------------------------------------------------------------------------------------
#define CAN_FFA1R_FFA_Pos      (0U)
#define CAN_FFA1R_FFA_Msk      (0x3FFFUL << CAN_FFA1R_FFA_Pos)                 //--- 0x00003FFF
#define CAN_FFA1R_FFA          CAN_FFA1R_FFA_Msk                               //----Filter FIFO Assignment
#define CAN_FFA1R_FFA0_Pos     (0U)
#define CAN_FFA1R_FFA0_Msk     (0x1UL << CAN_FFA1R_FFA0_Pos)                   //--- 0x00000001
#define CAN_FFA1R_FFA0         CAN_FFA1R_FFA0_Msk                              //----Filter FIFO Assignment for Filter 0
#define CAN_FFA1R_FFA1_Pos     (1U)
#define CAN_FFA1R_FFA1_Msk     (0x1UL << CAN_FFA1R_FFA1_Pos)                   //--- 0x00000002
#define CAN_FFA1R_FFA1         CAN_FFA1R_FFA1_Msk                              //----Filter FIFO Assignment for Filter 1
#define CAN_FFA1R_FFA2_Pos     (2U)
#define CAN_FFA1R_FFA2_Msk     (0x1UL << CAN_FFA1R_FFA2_Pos)                   //--- 0x00000004
#define CAN_FFA1R_FFA2         CAN_FFA1R_FFA2_Msk                              //----Filter FIFO Assignment for Filter 2
#define CAN_FFA1R_FFA3_Pos     (3U)
#define CAN_FFA1R_FFA3_Msk     (0x1UL << CAN_FFA1R_FFA3_Pos)                   //--- 0x00000008
#define CAN_FFA1R_FFA3         CAN_FFA1R_FFA3_Msk                              //----Filter FIFO Assignment for Filter 3
#define CAN_FFA1R_FFA4_Pos     (4U)
#define CAN_FFA1R_FFA4_Msk     (0x1UL << CAN_FFA1R_FFA4_Pos)                   //--- 0x00000010
#define CAN_FFA1R_FFA4         CAN_FFA1R_FFA4_Msk                              //----Filter FIFO Assignment for Filter 4
#define CAN_FFA1R_FFA5_Pos     (5U)
#define CAN_FFA1R_FFA5_Msk     (0x1UL << CAN_FFA1R_FFA5_Pos)                   //--- 0x00000020
#define CAN_FFA1R_FFA5         CAN_FFA1R_FFA5_Msk                              //----Filter FIFO Assignment for Filter 5
#define CAN_FFA1R_FFA6_Pos     (6U)
#define CAN_FFA1R_FFA6_Msk     (0x1UL << CAN_FFA1R_FFA6_Pos)                   //--- 0x00000040
#define CAN_FFA1R_FFA6         CAN_FFA1R_FFA6_Msk                              //----Filter FIFO Assignment for Filter 6
#define CAN_FFA1R_FFA7_Pos     (7U)
#define CAN_FFA1R_FFA7_Msk     (0x1UL << CAN_FFA1R_FFA7_Pos)                   //--- 0x00000080
#define CAN_FFA1R_FFA7         CAN_FFA1R_FFA7_Msk                              //----Filter FIFO Assignment for Filter 7
#define CAN_FFA1R_FFA8_Pos     (8U)
#define CAN_FFA1R_FFA8_Msk     (0x1UL << CAN_FFA1R_FFA8_Pos)                   //--- 0x00000100
#define CAN_FFA1R_FFA8         CAN_FFA1R_FFA8_Msk                              //----Filter FIFO Assignment for Filter 8
#define CAN_FFA1R_FFA9_Pos     (9U)
#define CAN_FFA1R_FFA9_Msk     (0x1UL << CAN_FFA1R_FFA9_Pos)                   //--- 0x00000200
#define CAN_FFA1R_FFA9         CAN_FFA1R_FFA9_Msk                              //----Filter FIFO Assignment for Filter 9
#define CAN_FFA1R_FFA10_Pos    (10U)
#define CAN_FFA1R_FFA10_Msk    (0x1UL << CAN_FFA1R_FFA10_Pos)                  //--- 0x00000400
#define CAN_FFA1R_FFA10        CAN_FFA1R_FFA10_Msk                             //----Filter FIFO Assignment for Filter 10
#define CAN_FFA1R_FFA11_Pos    (11U)
#define CAN_FFA1R_FFA11_Msk    (0x1UL << CAN_FFA1R_FFA11_Pos)                  //--- 0x00000800
#define CAN_FFA1R_FFA11        CAN_FFA1R_FFA11_Msk                             //----Filter FIFO Assignment for Filter 11
#define CAN_FFA1R_FFA12_Pos    (12U)
#define CAN_FFA1R_FFA12_Msk    (0x1UL << CAN_FFA1R_FFA12_Pos)                  //--- 0x00001000
#define CAN_FFA1R_FFA12        CAN_FFA1R_FFA12_Msk                             //----Filter FIFO Assignment for Filter 12
#define CAN_FFA1R_FFA13_Pos    (13U)
#define CAN_FFA1R_FFA13_Msk    (0x1UL << CAN_FFA1R_FFA13_Pos)                  //--- 0x00002000
#define CAN_FFA1R_FFA13        CAN_FFA1R_FFA13_Msk                             //----Filter FIFO Assignment for Filter 13

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_FA1R register
//---------------------------------------------------------------------------------------------
#define CAN_FA1R_FACT_Pos      (0U)
#define CAN_FA1R_FACT_Msk      (0x3FFFUL << CAN_FA1R_FACT_Pos)                 //--- 0x00003FFF
#define CAN_FA1R_FACT          CAN_FA1R_FACT_Msk                               //----Filter Active
#define CAN_FA1R_FACT0_Pos     (0U)
#define CAN_FA1R_FACT0_Msk     (0x1UL << CAN_FA1R_FACT0_Pos)                   //--- 0x00000001
#define CAN_FA1R_FACT0         CAN_FA1R_FACT0_Msk                              //----Filter 0 Active
#define CAN_FA1R_FACT1_Pos     (1U)
#define CAN_FA1R_FACT1_Msk     (0x1UL << CAN_FA1R_FACT1_Pos)                   //--- 0x00000002
#define CAN_FA1R_FACT1         CAN_FA1R_FACT1_Msk                              //----Filter 1 Active
#define CAN_FA1R_FACT2_Pos     (2U)
#define CAN_FA1R_FACT2_Msk     (0x1UL << CAN_FA1R_FACT2_Pos)                   //--- 0x00000004
#define CAN_FA1R_FACT2         CAN_FA1R_FACT2_Msk                              //----Filter 2 Active
#define CAN_FA1R_FACT3_Pos     (3U)
#define CAN_FA1R_FACT3_Msk     (0x1UL << CAN_FA1R_FACT3_Pos)                   //--- 0x00000008
#define CAN_FA1R_FACT3         CAN_FA1R_FACT3_Msk                              //----Filter 3 Active
#define CAN_FA1R_FACT4_Pos     (4U)
#define CAN_FA1R_FACT4_Msk     (0x1UL << CAN_FA1R_FACT4_Pos)                   //--- 0x00000010
#define CAN_FA1R_FACT4         CAN_FA1R_FACT4_Msk                              //----Filter 4 Active
#define CAN_FA1R_FACT5_Pos     (5U)
#define CAN_FA1R_FACT5_Msk     (0x1UL << CAN_FA1R_FACT5_Pos)                   //--- 0x00000020
#define CAN_FA1R_FACT5         CAN_FA1R_FACT5_Msk                              //----Filter 5 Active
#define CAN_FA1R_FACT6_Pos     (6U)
#define CAN_FA1R_FACT6_Msk     (0x1UL << CAN_FA1R_FACT6_Pos)                   //--- 0x00000040
#define CAN_FA1R_FACT6         CAN_FA1R_FACT6_Msk                              //----Filter 6 Active
#define CAN_FA1R_FACT7_Pos     (7U)
#define CAN_FA1R_FACT7_Msk     (0x1UL << CAN_FA1R_FACT7_Pos)                   //--- 0x00000080
#define CAN_FA1R_FACT7         CAN_FA1R_FACT7_Msk                              //----Filter 7 Active
#define CAN_FA1R_FACT8_Pos     (8U)
#define CAN_FA1R_FACT8_Msk     (0x1UL << CAN_FA1R_FACT8_Pos)                   //--- 0x00000100
#define CAN_FA1R_FACT8         CAN_FA1R_FACT8_Msk                              //----Filter 8 Active
#define CAN_FA1R_FACT9_Pos     (9U)
#define CAN_FA1R_FACT9_Msk     (0x1UL << CAN_FA1R_FACT9_Pos)                   //--- 0x00000200
#define CAN_FA1R_FACT9         CAN_FA1R_FACT9_Msk                              //----Filter 9 Active
#define CAN_FA1R_FACT10_Pos    (10U)
#define CAN_FA1R_FACT10_Msk    (0x1UL << CAN_FA1R_FACT10_Pos)                  //--- 0x00000400
#define CAN_FA1R_FACT10        CAN_FA1R_FACT10_Msk                             //----Filter 10 Active
#define CAN_FA1R_FACT11_Pos    (11U)
#define CAN_FA1R_FACT11_Msk    (0x1UL << CAN_FA1R_FACT11_Pos)                  //--- 0x00000800
#define CAN_FA1R_FACT11        CAN_FA1R_FACT11_Msk                             //----Filter 11 Active
#define CAN_FA1R_FACT12_Pos    (12U)
#define CAN_FA1R_FACT12_Msk    (0x1UL << CAN_FA1R_FACT12_Pos)                  //--- 0x00001000
#define CAN_FA1R_FACT12        CAN_FA1R_FACT12_Msk                             //----Filter 12 Active
#define CAN_FA1R_FACT13_Pos    (13U)
#define CAN_FA1R_FACT13_Msk    (0x1UL << CAN_FA1R_FACT13_Pos)                  //--- 0x00002000
#define CAN_FA1R_FACT13        CAN_FA1R_FACT13_Msk                             //----Filter 13 Active

