Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_F12R1 register
//---------------------------------------------------------------------------------------------
#define CAN_F12R1_FB0_Pos      (0U)
#define CAN_F12R1_FB0_Msk      (0x1UL << CAN_F12R1_FB0_Pos)                    //--- 0x00000001
#define CAN_F12R1_FB0          CAN_F12R1_FB0_Msk                               //----Filter bit 0
#define CAN_F12R1_FB1_Pos      (1U)
#define CAN_F12R1_FB1_Msk      (0x1UL << CAN_F12R1_FB1_Pos)                    //--- 0x00000002
#define CAN_F12R1_FB1          CAN_F12R1_FB1_Msk                               //----Filter bit 1
#define CAN_F12R1_FB2_Pos      (2U)
#define CAN_F12R1_FB2_Msk      (0x1UL << CAN_F12R1_FB2_Pos)                    //--- 0x00000004
#define CAN_F12R1_FB2          CAN_F12R1_FB2_Msk                               //----Filter bit 2
#define CAN_F12R1_FB3_Pos      (3U)
#define CAN_F12R1_FB3_Msk      (0x1UL << CAN_F12R1_FB3_Pos)                    //--- 0x00000008
#define CAN_F12R1_FB3          CAN_F12R1_FB3_Msk                               //----Filter bit 3
#define CAN_F12R1_FB4_Pos      (4U)
#define CAN_F12R1_FB4_Msk      (0x1UL << CAN_F12R1_FB4_Pos)                    //--- 0x00000010
#define CAN_F12R1_FB4          CAN_F12R1_FB4_Msk                               //----Filter bit 4
#define CAN_F12R1_FB5_Pos      (5U)
#define CAN_F12R1_FB5_Msk      (0x1UL << CAN_F12R1_FB5_Pos)                    //--- 0x00000020
#define CAN_F12R1_FB5          CAN_F12R1_FB5_Msk                               //----Filter bit 5
#define CAN_F12R1_FB6_Pos      (6U)
#define CAN_F12R1_FB6_Msk      (0x1UL << CAN_F12R1_FB6_Pos)                    //--- 0x00000040
#define CAN_F12R1_FB6          CAN_F12R1_FB6_Msk                               //----Filter bit 6
#define CAN_F12R1_FB7_Pos      (7U)
#define CAN_F12R1_FB7_Msk      (0x1UL << CAN_F12R1_FB7_Pos)                    //--- 0x00000080
#define CAN_F12R1_FB7          CAN_F12R1_FB7_Msk                               //----Filter bit 7
#define CAN_F12R1_FB8_Pos      (8U)
#define CAN_F12R1_FB8_Msk      (0x1UL << CAN_F12R1_FB8_Pos)                    //--- 0x00000100
#define CAN_F12R1_FB8          CAN_F12R1_FB8_Msk                               //----Filter bit 8
#define CAN_F12R1_FB9_Pos      (9U)
#define CAN_F12R1_FB9_Msk      (0x1UL << CAN_F12R1_FB9_Pos)                    //--- 0x00000200
#define CAN_F12R1_FB9          CAN_F12R1_FB9_Msk                               //----Filter bit 9
#define CAN_F12R1_FB10_Pos     (10U)
#define CAN_F12R1_FB10_Msk     (0x1UL << CAN_F12R1_FB10_Pos)                   //--- 0x00000400
#define CAN_F12R1_FB10         CAN_F12R1_FB10_Msk                              //----Filter bit 10
#define CAN_F12R1_FB11_Pos     (11U)
#define CAN_F12R1_FB11_Msk     (0x1UL << CAN_F12R1_FB11_Pos)                   //--- 0x00000800
#define CAN_F12R1_FB11         CAN_F12R1_FB11_Msk                              //----Filter bit 11
#define CAN_F12R1_FB12_Pos     (12U)
#define CAN_F12R1_FB12_Msk     (0x1UL << CAN_F12R1_FB12_Pos)                   //--- 0x00001000
#define CAN_F12R1_FB12         CAN_F12R1_FB12_Msk                              //----Filter bit 12
#define CAN_F12R1_FB13_Pos     (13U)
#define CAN_F12R1_FB13_Msk     (0x1UL << CAN_F12R1_FB13_Pos)                   //--- 0x00002000
#define CAN_F12R1_FB13         CAN_F12R1_FB13_Msk                              //----Filter bit 13
#define CAN_F12R1_FB14_Pos     (14U)
#define CAN_F12R1_FB14_Msk     (0x1UL << CAN_F12R1_FB14_Pos)                   //--- 0x00004000
#define CAN_F12R1_FB14         CAN_F12R1_FB14_Msk                              //----Filter bit 14
#define CAN_F12R1_FB15_Pos     (15U)
#define CAN_F12R1_FB15_Msk     (0x1UL << CAN_F12R1_FB15_Pos)                   //--- 0x00008000
#define CAN_F12R1_FB15         CAN_F12R1_FB15_Msk                              //----Filter bit 15
#define CAN_F12R1_FB16_Pos     (16U)
#define CAN_F12R1_FB16_Msk     (0x1UL << CAN_F12R1_FB16_Pos)                   //--- 0x00010000
#define CAN_F12R1_FB16         CAN_F12R1_FB16_Msk                              //----Filter bit 16
#define CAN_F12R1_FB17_Pos     (17U)
#define CAN_F12R1_FB17_Msk     (0x1UL << CAN_F12R1_FB17_Pos)                   //--- 0x00020000
#define CAN_F12R1_FB17         CAN_F12R1_FB17_Msk                              //----Filter bit 17
#define CAN_F12R1_FB18_Pos     (18U)
#define CAN_F12R1_FB18_Msk     (0x1UL << CAN_F12R1_FB18_Pos)                   //--- 0x00040000
#define CAN_F12R1_FB18         CAN_F12R1_FB18_Msk                              //----Filter bit 18
#define CAN_F12R1_FB19_Pos     (19U)
#define CAN_F12R1_FB19_Msk     (0x1UL << CAN_F12R1_FB19_Pos)                   //--- 0x00080000
#define CAN_F12R1_FB19         CAN_F12R1_FB19_Msk                              //----Filter bit 19
#define CAN_F12R1_FB20_Pos     (20U)
#define CAN_F12R1_FB20_Msk     (0x1UL << CAN_F12R1_FB20_Pos)                   //--- 0x00100000
#define CAN_F12R1_FB20         CAN_F12R1_FB20_Msk                              //----Filter bit 20
#define CAN_F12R1_FB21_Pos     (21U)
#define CAN_F12R1_FB21_Msk     (0x1UL << CAN_F12R1_FB21_Pos)                   //--- 0x00200000
#define CAN_F12R1_FB21         CAN_F12R1_FB21_Msk                              //----Filter bit 21
#define CAN_F12R1_FB22_Pos     (22U)
#define CAN_F12R1_FB22_Msk     (0x1UL << CAN_F12R1_FB22_Pos)                   //--- 0x00400000
#define CAN_F12R1_FB22         CAN_F12R1_FB22_Msk                              //----Filter bit 22
#define CAN_F12R1_FB23_Pos     (23U)
#define CAN_F12R1_FB23_Msk     (0x1UL << CAN_F12R1_FB23_Pos)                   //--- 0x00800000
#define CAN_F12R1_FB23         CAN_F12R1_FB23_Msk                              //----Filter bit 23
#define CAN_F12R1_FB24_Pos     (24U)
#define CAN_F12R1_FB24_Msk     (0x1UL << CAN_F12R1_FB24_Pos)                   //--- 0x01000000
#define CAN_F12R1_FB24         CAN_F12R1_FB24_Msk                              //----Filter bit 24
#define CAN_F12R1_FB25_Pos     (25U)
#define CAN_F12R1_FB25_Msk     (0x1UL << CAN_F12R1_FB25_Pos)                   //--- 0x02000000
#define CAN_F12R1_FB25         CAN_F12R1_FB25_Msk                              //----Filter bit 25
#define CAN_F12R1_FB26_Pos     (26U)
#define CAN_F12R1_FB26_Msk     (0x1UL << CAN_F12R1_FB26_Pos)                   //--- 0x04000000
#define CAN_F12R1_FB26         CAN_F12R1_FB26_Msk                              //----Filter bit 26
#define CAN_F12R1_FB27_Pos     (27U)
#define CAN_F12R1_FB27_Msk     (0x1UL << CAN_F12R1_FB27_Pos)                   //--- 0x08000000
#define CAN_F12R1_FB27         CAN_F12R1_FB27_Msk                              //----Filter bit 27
#define CAN_F12R1_FB28_Pos     (28U)
#define CAN_F12R1_FB28_Msk     (0x1UL << CAN_F12R1_FB28_Pos)                   //--- 0x10000000
#define CAN_F12R1_FB28         CAN_F12R1_FB28_Msk                              //----Filter bit 28
#define CAN_F12R1_FB29_Pos     (29U)
#define CAN_F12R1_FB29_Msk     (0x1UL << CAN_F12R1_FB29_Pos)                   //--- 0x20000000
#define CAN_F12R1_FB29         CAN_F12R1_FB29_Msk                              //----Filter bit 29
#define CAN_F12R1_FB30_Pos     (30U)
#define CAN_F12R1_FB30_Msk     (0x1UL << CAN_F12R1_FB30_Pos)                   //--- 0x40000000
#define CAN_F12R1_FB30         CAN_F12R1_FB30_Msk                              //----Filter bit 30
#define CAN_F12R1_FB31_Pos     (31U)
#define CAN_F12R1_FB31_Msk     (0x1UL << CAN_F12R1_FB31_Pos)                   //--- 0x80000000
#define CAN_F12R1_FB31         CAN_F12R1_FB31_Msk                              //----Filter bit 31

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_F13R1 register
//---------------------------------------------------------------------------------------------
#define CAN_F13R1_FB0_Pos      (0U)
#define CAN_F13R1_FB0_Msk      (0x1UL << CAN_F13R1_FB0_Pos)                    //--- 0x00000001
#define CAN_F13R1_FB0          CAN_F13R1_FB0_Msk                               //----Filter bit 0
#define CAN_F13R1_FB1_Pos      (1U)
#define CAN_F13R1_FB1_Msk      (0x1UL << CAN_F13R1_FB1_Pos)                    //--- 0x00000002
#define CAN_F13R1_FB1          CAN_F13R1_FB1_Msk                               //----Filter bit 1
#define CAN_F13R1_FB2_Pos      (2U)
#define CAN_F13R1_FB2_Msk      (0x1UL << CAN_F13R1_FB2_Pos)                    //--- 0x00000004
#define CAN_F13R1_FB2          CAN_F13R1_FB2_Msk                               //----Filter bit 2
#define CAN_F13R1_FB3_Pos      (3U)
#define CAN_F13R1_FB3_Msk      (0x1UL << CAN_F13R1_FB3_Pos)                    //--- 0x00000008
#define CAN_F13R1_FB3          CAN_F13R1_FB3_Msk                               //----Filter bit 3
#define CAN_F13R1_FB4_Pos      (4U)
#define CAN_F13R1_FB4_Msk      (0x1UL << CAN_F13R1_FB4_Pos)                    //--- 0x00000010
#define CAN_F13R1_FB4          CAN_F13R1_FB4_Msk                               //----Filter bit 4
#define CAN_F13R1_FB5_Pos      (5U)
#define CAN_F13R1_FB5_Msk      (0x1UL << CAN_F13R1_FB5_Pos)                    //--- 0x00000020
#define CAN_F13R1_FB5          CAN_F13R1_FB5_Msk                               //----Filter bit 5
#define CAN_F13R1_FB6_Pos      (6U)
#define CAN_F13R1_FB6_Msk      (0x1UL << CAN_F13R1_FB6_Pos)                    //--- 0x00000040
#define CAN_F13R1_FB6          CAN_F13R1_FB6_Msk                               //----Filter bit 6
#define CAN_F13R1_FB7_Pos      (7U)
#define CAN_F13R1_FB7_Msk      (0x1UL << CAN_F13R1_FB7_Pos)                    //--- 0x00000080
#define CAN_F13R1_FB7          CAN_F13R1_FB7_Msk                               //----Filter bit 7
#define CAN_F13R1_FB8_Pos      (8U)
#define CAN_F13R1_FB8_Msk      (0x1UL << CAN_F13R1_FB8_Pos)                    //--- 0x00000100
#define CAN_F13R1_FB8          CAN_F13R1_FB8_Msk                               //----Filter bit 8
#define CAN_F13R1_FB9_Pos      (9U)
#define CAN_F13R1_FB9_Msk      (0x1UL << CAN_F13R1_FB9_Pos)                    //--- 0x00000200
#define CAN_F13R1_FB9          CAN_F13R1_FB9_Msk                               //----Filter bit 9
#define CAN_F13R1_FB10_Pos     (10U)
#define CAN_F13R1_FB10_Msk     (0x1UL << CAN_F13R1_FB10_Pos)                   //--- 0x00000400
#define CAN_F13R1_FB10         CAN_F13R1_FB10_Msk                              //----Filter bit 10
#define CAN_F13R1_FB11_Pos     (11U)
#define CAN_F13R1_FB11_Msk     (0x1UL << CAN_F13R1_FB11_Pos)                   //--- 0x00000800
#define CAN_F13R1_FB11         CAN_F13R1_FB11_Msk                              //----Filter bit 11
#define CAN_F13R1_FB12_Pos     (12U)
#define CAN_F13R1_FB12_Msk     (0x1UL << CAN_F13R1_FB12_Pos)                   //--- 0x00001000
#define CAN_F13R1_FB12         CAN_F13R1_FB12_Msk                              //----Filter bit 12
#define CAN_F13R1_FB13_Pos     (13U)
#define CAN_F13R1_FB13_Msk     (0x1UL << CAN_F13R1_FB13_Pos)                   //--- 0x00002000
#define CAN_F13R1_FB13         CAN_F13R1_FB13_Msk                              //----Filter bit 13
#define CAN_F13R1_FB14_Pos     (14U)
#define CAN_F13R1_FB14_Msk     (0x1UL << CAN_F13R1_FB14_Pos)                   //--- 0x00004000
#define CAN_F13R1_FB14         CAN_F13R1_FB14_Msk                              //----Filter bit 14
#define CAN_F13R1_FB15_Pos     (15U)
#define CAN_F13R1_FB15_Msk     (0x1UL << CAN_F13R1_FB15_Pos)                   //--- 0x00008000
#define CAN_F13R1_FB15         CAN_F13R1_FB15_Msk                              //----Filter bit 15
#define CAN_F13R1_FB16_Pos     (16U)
#define CAN_F13R1_FB16_Msk     (0x1UL << CAN_F13R1_FB16_Pos)                   //--- 0x00010000
#define CAN_F13R1_FB16         CAN_F13R1_FB16_Msk                              //----Filter bit 16
#define CAN_F13R1_FB17_Pos     (17U)
#define CAN_F13R1_FB17_Msk     (0x1UL << CAN_F13R1_FB17_Pos)                   //--- 0x00020000
#define CAN_F13R1_FB17         CAN_F13R1_FB17_Msk                              //----Filter bit 17
#define CAN_F13R1_FB18_Pos     (18U)
#define CAN_F13R1_FB18_Msk     (0x1UL << CAN_F13R1_FB18_Pos)                   //--- 0x00040000
#define CAN_F13R1_FB18         CAN_F13R1_FB18_Msk                              //----Filter bit 18
#define CAN_F13R1_FB19_Pos     (19U)
#define CAN_F13R1_FB19_Msk     (0x1UL << CAN_F13R1_FB19_Pos)                   //--- 0x00080000
#define CAN_F13R1_FB19         CAN_F13R1_FB19_Msk                              //----Filter bit 19
#define CAN_F13R1_FB20_Pos     (20U)
#define CAN_F13R1_FB20_Msk     (0x1UL << CAN_F13R1_FB20_Pos)                   //--- 0x00100000
#define CAN_F13R1_FB20         CAN_F13R1_FB20_Msk                              //----Filter bit 20
#define CAN_F13R1_FB21_Pos     (21U)
#define CAN_F13R1_FB21_Msk     (0x1UL << CAN_F13R1_FB21_Pos)                   //--- 0x00200000
#define CAN_F13R1_FB21         CAN_F13R1_FB21_Msk                              //----Filter bit 21
#define CAN_F13R1_FB22_Pos     (22U)
#define CAN_F13R1_FB22_Msk     (0x1UL << CAN_F13R1_FB22_Pos)                   //--- 0x00400000
#define CAN_F13R1_FB22         CAN_F13R1_FB22_Msk                              //----Filter bit 22
#define CAN_F13R1_FB23_Pos     (23U)
#define CAN_F13R1_FB23_Msk     (0x1UL << CAN_F13R1_FB23_Pos)                   //--- 0x00800000
#define CAN_F13R1_FB23         CAN_F13R1_FB23_Msk                              //----Filter bit 23
#define CAN_F13R1_FB24_Pos     (24U)
#define CAN_F13R1_FB24_Msk     (0x1UL << CAN_F13R1_FB24_Pos)                   //--- 0x01000000
#define CAN_F13R1_FB24         CAN_F13R1_FB24_Msk                              //----Filter bit 24
#define CAN_F13R1_FB25_Pos     (25U)
#define CAN_F13R1_FB25_Msk     (0x1UL << CAN_F13R1_FB25_Pos)                   //--- 0x02000000
#define CAN_F13R1_FB25         CAN_F13R1_FB25_Msk                              //----Filter bit 25
#define CAN_F13R1_FB26_Pos     (26U)
#define CAN_F13R1_FB26_Msk     (0x1UL << CAN_F13R1_FB26_Pos)                   //--- 0x04000000
#define CAN_F13R1_FB26         CAN_F13R1_FB26_Msk                              //----Filter bit 26
#define CAN_F13R1_FB27_Pos     (27U)
#define CAN_F13R1_FB27_Msk     (0x1UL << CAN_F13R1_FB27_Pos)                   //--- 0x08000000
#define CAN_F13R1_FB27         CAN_F13R1_FB27_Msk                              //----Filter bit 27
#define CAN_F13R1_FB28_Pos     (28U)
#define CAN_F13R1_FB28_Msk     (0x1UL << CAN_F13R1_FB28_Pos)                   //--- 0x10000000
#define CAN_F13R1_FB28         CAN_F13R1_FB28_Msk                              //----Filter bit 28
#define CAN_F13R1_FB29_Pos     (29U)
#define CAN_F13R1_FB29_Msk     (0x1UL << CAN_F13R1_FB29_Pos)                   //--- 0x20000000
#define CAN_F13R1_FB29         CAN_F13R1_FB29_Msk                              //----Filter bit 29
#define CAN_F13R1_FB30_Pos     (30U)
#define CAN_F13R1_FB30_Msk     (0x1UL << CAN_F13R1_FB30_Pos)                   //--- 0x40000000
#define CAN_F13R1_FB30         CAN_F13R1_FB30_Msk                              //----Filter bit 30
#define CAN_F13R1_FB31_Pos     (31U)
#define CAN_F13R1_FB31_Msk     (0x1UL << CAN_F13R1_FB31_Pos)                   //--- 0x80000000
#define CAN_F13R1_FB31         CAN_F13R1_FB31_Msk                              //----Filter bit 31

//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_F0R2 register
//---------------------------------------------------------------------------------------------
#define CAN_F0R2_FB0_Pos       (0U)
#define CAN_F0R2_FB0_Msk       (0x1UL << CAN_F0R2_FB0_Pos)                     //--- 0x00000001
#define CAN_F0R2_FB0           CAN_F0R2_FB0_Msk                                //----Filter bit 0
#define CAN_F0R2_FB1_Pos       (1U)
#define CAN_F0R2_FB1_Msk       (0x1UL << CAN_F0R2_FB1_Pos)                     //--- 0x00000002
#define CAN_F0R2_FB1           CAN_F0R2_FB1_Msk                                //----Filter bit 1
#define CAN_F0R2_FB2_Pos       (2U)
#define CAN_F0R2_FB2_Msk       (0x1UL << CAN_F0R2_FB2_Pos)                     //--- 0x00000004
#define CAN_F0R2_FB2           CAN_F0R2_FB2_Msk                                //----Filter bit 2
#define CAN_F0R2_FB3_Pos       (3U)
#define CAN_F0R2_FB3_Msk       (0x1UL << CAN_F0R2_FB3_Pos)                     //--- 0x00000008
#define CAN_F0R2_FB3           CAN_F0R2_FB3_Msk                                //----Filter bit 3
#define CAN_F0R2_FB4_Pos       (4U)
#define CAN_F0R2_FB4_Msk       (0x1UL << CAN_F0R2_FB4_Pos)                     //--- 0x00000010
#define CAN_F0R2_FB4           CAN_F0R2_FB4_Msk                                //----Filter bit 4
#define CAN_F0R2_FB5_Pos       (5U)
#define CAN_F0R2_FB5_Msk       (0x1UL << CAN_F0R2_FB5_Pos)                     //--- 0x00000020
#define CAN_F0R2_FB5           CAN_F0R2_FB5_Msk                                //----Filter bit 5
#define CAN_F0R2_FB6_Pos       (6U)
#define CAN_F0R2_FB6_Msk       (0x1UL << CAN_F0R2_FB6_Pos)                     //--- 0x00000040
#define CAN_F0R2_FB6           CAN_F0R2_FB6_Msk                                //----Filter bit 6
#define CAN_F0R2_FB7_Pos       (7U)
#define CAN_F0R2_FB7_Msk       (0x1UL << CAN_F0R2_FB7_Pos)                     //--- 0x00000080
#define CAN_F0R2_FB7           CAN_F0R2_FB7_Msk                                //----Filter bit 7
#define CAN_F0R2_FB8_Pos       (8U)
#define CAN_F0R2_FB8_Msk       (0x1UL << CAN_F0R2_FB8_Pos)                     //--- 0x00000100
#define CAN_F0R2_FB8           CAN_F0R2_FB8_Msk                                //----Filter bit 8
#define CAN_F0R2_FB9_Pos       (9U)
#define CAN_F0R2_FB9_Msk       (0x1UL << CAN_F0R2_FB9_Pos)                     //--- 0x00000200
#define CAN_F0R2_FB9           CAN_F0R2_FB9_Msk                                //----Filter bit 9
#define CAN_F0R2_FB10_Pos      (10U)
#define CAN_F0R2_FB10_Msk      (0x1UL << CAN_F0R2_FB10_Pos)                    //--- 0x00000400
#define CAN_F0R2_FB10          CAN_F0R2_FB10_Msk                               //----Filter bit 10
#define CAN_F0R2_FB11_Pos      (11U)
#define CAN_F0R2_FB11_Msk      (0x1UL << CAN_F0R2_FB11_Pos)                    //--- 0x00000800
#define CAN_F0R2_FB11          CAN_F0R2_FB11_Msk                               //----Filter bit 11
#define CAN_F0R2_FB12_Pos      (12U)
#define CAN_F0R2_FB12_Msk      (0x1UL << CAN_F0R2_FB12_Pos)                    //--- 0x00001000
#define CAN_F0R2_FB12          CAN_F0R2_FB12_Msk                               //----Filter bit 12
#define CAN_F0R2_FB13_Pos      (13U)
#define CAN_F0R2_FB13_Msk      (0x1UL << CAN_F0R2_FB13_Pos)                    //--- 0x00002000
#define CAN_F0R2_FB13          CAN_F0R2_FB13_Msk                               //----Filter bit 13
#define CAN_F0R2_FB14_Pos      (14U)
#define CAN_F0R2_FB14_Msk      (0x1UL << CAN_F0R2_FB14_Pos)                    //--- 0x00004000
#define CAN_F0R2_FB14          CAN_F0R2_FB14_Msk                               //----Filter bit 14
#define CAN_F0R2_FB15_Pos      (15U)
#define CAN_F0R2_FB15_Msk      (0x1UL << CAN_F0R2_FB15_Pos)                    //--- 0x00008000
#define CAN_F0R2_FB15          CAN_F0R2_FB15_Msk                               //----Filter bit 15
#define CAN_F0R2_FB16_Pos      (16U)
#define CAN_F0R2_FB16_Msk      (0x1UL << CAN_F0R2_FB16_Pos)                    //--- 0x00010000
#define CAN_F0R2_FB16          CAN_F0R2_FB16_Msk                               //----Filter bit 16
#define CAN_F0R2_FB17_Pos      (17U)
#define CAN_F0R2_FB17_Msk      (0x1UL << CAN_F0R2_FB17_Pos)                    //--- 0x00020000
#define CAN_F0R2_FB17          CAN_F0R2_FB17_Msk                               //----Filter bit 17
#define CAN_F0R2_FB18_Pos      (18U)
#define CAN_F0R2_FB18_Msk      (0x1UL << CAN_F0R2_FB18_Pos)                    //--- 0x00040000
#define CAN_F0R2_FB18          CAN_F0R2_FB18_Msk                               //----Filter bit 18
#define CAN_F0R2_FB19_Pos      (19U)
#define CAN_F0R2_FB19_Msk      (0x1UL << CAN_F0R2_FB19_Pos)                    //--- 0x00080000
#define CAN_F0R2_FB19          CAN_F0R2_FB19_Msk                               //----Filter bit 19
#define CAN_F0R2_FB20_Pos      (20U)
#define CAN_F0R2_FB20_Msk      (0x1UL << CAN_F0R2_FB20_Pos)                    //--- 0x00100000
#define CAN_F0R2_FB20          CAN_F0R2_FB20_Msk                               //----Filter bit 20
#define CAN_F0R2_FB21_Pos      (21U)
#define CAN_F0R2_FB21_Msk      (0x1UL << CAN_F0R2_FB21_Pos)                    //--- 0x00200000
#define CAN_F0R2_FB21          CAN_F0R2_FB21_Msk                               //----Filter bit 21
#define CAN_F0R2_FB22_Pos      (22U)
#define CAN_F0R2_FB22_Msk      (0x1UL << CAN_F0R2_FB22_Pos)                    //--- 0x00400000
#define CAN_F0R2_FB22          CAN_F0R2_FB22_Msk                               //----Filter bit 22
#define CAN_F0R2_FB23_Pos      (23U)
#define CAN_F0R2_FB23_Msk      (0x1UL << CAN_F0R2_FB23_Pos)                    //--- 0x00800000
#define CAN_F0R2_FB23          CAN_F0R2_FB23_Msk                               //----Filter bit 23
#define CAN_F0R2_FB24_Pos      (24U)
#define CAN_F0R2_FB24_Msk      (0x1UL << CAN_F0R2_FB24_Pos)                    //--- 0x01000000
#define CAN_F0R2_FB24          CAN_F0R2_FB24_Msk                               //----Filter bit 24
#define CAN_F0R2_FB25_Pos      (25U)
#define CAN_F0R2_FB25_Msk      (0x1UL << CAN_F0R2_FB25_Pos)                    //--- 0x02000000
#define CAN_F0R2_FB25          CAN_F0R2_FB25_Msk                               //----Filter bit 25
#define CAN_F0R2_FB26_Pos      (26U)
#define CAN_F0R2_FB26_Msk      (0x1UL << CAN_F0R2_FB26_Pos)                    //--- 0x04000000
#define CAN_F0R2_FB26          CAN_F0R2_FB26_Msk                               //----Filter bit 26
#define CAN_F0R2_FB27_Pos      (27U)
#define CAN_F0R2_FB27_Msk      (0x1UL << CAN_F0R2_FB27_Pos)                    //--- 0x08000000
#define CAN_F0R2_FB27          CAN_F0R2_FB27_Msk                               //----Filter bit 27
#define CAN_F0R2_FB28_Pos      (28U)
#define CAN_F0R2_FB28_Msk      (0x1UL << CAN_F0R2_FB28_Pos)                    //--- 0x10000000
#define CAN_F0R2_FB28          CAN_F0R2_FB28_Msk                               //----Filter bit 28
#define CAN_F0R2_FB29_Pos      (29U)
#define CAN_F0R2_FB29_Msk      (0x1UL << CAN_F0R2_FB29_Pos)                    //--- 0x20000000
#define CAN_F0R2_FB29          CAN_F0R2_FB29_Msk                               //----Filter bit 29
#define CAN_F0R2_FB30_Pos      (30U)
#define CAN_F0R2_FB30_Msk      (0x1UL << CAN_F0R2_FB30_Pos)                    //--- 0x40000000
#define CAN_F0R2_FB30          CAN_F0R2_FB30_Msk                               //----Filter bit 30
#define CAN_F0R2_FB31_Pos      (31U)
#define CAN_F0R2_FB31_Msk      (0x1UL << CAN_F0R2_FB31_Pos)                    //--- 0x80000000
#define CAN_F0R2_FB31          CAN_F0R2_FB31_Msk                               //----Filter bit 31

