Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  Bit definition for CAN_F13R2 register
//---------------------------------------------------------------------------------------------
#define CAN_F13R2_FB0_Pos      (0U)
#define CAN_F13R2_FB0_Msk      (0x1UL << CAN_F13R2_FB0_Pos)                    //--- 0x00000001
#define CAN_F13R2_FB0          CAN_F13R2_FB0_Msk                               //----Filter bit 0
#define CAN_F13R2_FB1_Pos      (1U)
#define CAN_F13R2_FB1_Msk      (0x1UL << CAN_F13R2_FB1_Pos)                    //--- 0x00000002
#define CAN_F13R2_FB1          CAN_F13R2_FB1_Msk                               //----Filter bit 1
#define CAN_F13R2_FB2_Pos      (2U)
#define CAN_F13R2_FB2_Msk      (0x1UL << CAN_F13R2_FB2_Pos)                    //--- 0x00000004
#define CAN_F13R2_FB2          CAN_F13R2_FB2_Msk                               //----Filter bit 2
#define CAN_F13R2_FB3_Pos      (3U)
#define CAN_F13R2_FB3_Msk      (0x1UL << CAN_F13R2_FB3_Pos)                    //--- 0x00000008
#define CAN_F13R2_FB3          CAN_F13R2_FB3_Msk                               //----Filter bit 3
#define CAN_F13R2_FB4_Pos      (4U)
#define CAN_F13R2_FB4_Msk      (0x1UL << CAN_F13R2_FB4_Pos)                    //--- 0x00000010
#define CAN_F13R2_FB4          CAN_F13R2_FB4_Msk                               //----Filter bit 4
#define CAN_F13R2_FB5_Pos      (5U)
#define CAN_F13R2_FB5_Msk      (0x1UL << CAN_F13R2_FB5_Pos)                    //--- 0x00000020
#define CAN_F13R2_FB5          CAN_F13R2_FB5_Msk                               //----Filter bit 5
#define CAN_F13R2_FB6_Pos      (6U)
#define CAN_F13R2_FB6_Msk      (0x1UL << CAN_F13R2_FB6_Pos)                    //--- 0x00000040
#define CAN_F13R2_FB6          CAN_F13R2_FB6_Msk                               //----Filter bit 6
#define CAN_F13R2_FB7_Pos      (7U)
#define CAN_F13R2_FB7_Msk      (0x1UL << CAN_F13R2_FB7_Pos)                    //--- 0x00000080
#define CAN_F13R2_FB7          CAN_F13R2_FB7_Msk                               //----Filter bit 7
#define CAN_F13R2_FB8_Pos      (8U)
#define CAN_F13R2_FB8_Msk      (0x1UL << CAN_F13R2_FB8_Pos)                    //--- 0x00000100
#define CAN_F13R2_FB8          CAN_F13R2_FB8_Msk                               //----Filter bit 8
#define CAN_F13R2_FB9_Pos      (9U)
#define CAN_F13R2_FB9_Msk      (0x1UL << CAN_F13R2_FB9_Pos)                    //--- 0x00000200
#define CAN_F13R2_FB9          CAN_F13R2_FB9_Msk                               //----Filter bit 9
#define CAN_F13R2_FB10_Pos     (10U)
#define CAN_F13R2_FB10_Msk     (0x1UL << CAN_F13R2_FB10_Pos)                   //--- 0x00000400
#define CAN_F13R2_FB10         CAN_F13R2_FB10_Msk                              //----Filter bit 10
#define CAN_F13R2_FB11_Pos     (11U)
#define CAN_F13R2_FB11_Msk     (0x1UL << CAN_F13R2_FB11_Pos)                   //--- 0x00000800
#define CAN_F13R2_FB11         CAN_F13R2_FB11_Msk                              //----Filter bit 11
#define CAN_F13R2_FB12_Pos     (12U)
#define CAN_F13R2_FB12_Msk     (0x1UL << CAN_F13R2_FB12_Pos)                   //--- 0x00001000
#define CAN_F13R2_FB12         CAN_F13R2_FB12_Msk                              //----Filter bit 12
#define CAN_F13R2_FB13_Pos     (13U)
#define CAN_F13R2_FB13_Msk     (0x1UL << CAN_F13R2_FB13_Pos)                   //--- 0x00002000
#define CAN_F13R2_FB13         CAN_F13R2_FB13_Msk                              //----Filter bit 13
#define CAN_F13R2_FB14_Pos     (14U)
#define CAN_F13R2_FB14_Msk     (0x1UL << CAN_F13R2_FB14_Pos)                   //--- 0x00004000
#define CAN_F13R2_FB14         CAN_F13R2_FB14_Msk                              //----Filter bit 14
#define CAN_F13R2_FB15_Pos     (15U)
#define CAN_F13R2_FB15_Msk     (0x1UL << CAN_F13R2_FB15_Pos)                   //--- 0x00008000
#define CAN_F13R2_FB15         CAN_F13R2_FB15_Msk                              //----Filter bit 15
#define CAN_F13R2_FB16_Pos     (16U)
#define CAN_F13R2_FB16_Msk     (0x1UL << CAN_F13R2_FB16_Pos)                   //--- 0x00010000
#define CAN_F13R2_FB16         CAN_F13R2_FB16_Msk                              //----Filter bit 16
#define CAN_F13R2_FB17_Pos     (17U)
#define CAN_F13R2_FB17_Msk     (0x1UL << CAN_F13R2_FB17_Pos)                   //--- 0x00020000
#define CAN_F13R2_FB17         CAN_F13R2_FB17_Msk                              //----Filter bit 17
#define CAN_F13R2_FB18_Pos     (18U)
#define CAN_F13R2_FB18_Msk     (0x1UL << CAN_F13R2_FB18_Pos)                   //--- 0x00040000
#define CAN_F13R2_FB18         CAN_F13R2_FB18_Msk                              //----Filter bit 18
#define CAN_F13R2_FB19_Pos     (19U)
#define CAN_F13R2_FB19_Msk     (0x1UL << CAN_F13R2_FB19_Pos)                   //--- 0x00080000
#define CAN_F13R2_FB19         CAN_F13R2_FB19_Msk                              //----Filter bit 19
#define CAN_F13R2_FB20_Pos     (20U)
#define CAN_F13R2_FB20_Msk     (0x1UL << CAN_F13R2_FB20_Pos)                   //--- 0x00100000
#define CAN_F13R2_FB20         CAN_F13R2_FB20_Msk                              //----Filter bit 20
#define CAN_F13R2_FB21_Pos     (21U)
#define CAN_F13R2_FB21_Msk     (0x1UL << CAN_F13R2_FB21_Pos)                   //--- 0x00200000
#define CAN_F13R2_FB21         CAN_F13R2_FB21_Msk                              //----Filter bit 21
#define CAN_F13R2_FB22_Pos     (22U)
#define CAN_F13R2_FB22_Msk     (0x1UL << CAN_F13R2_FB22_Pos)                   //--- 0x00400000
#define CAN_F13R2_FB22         CAN_F13R2_FB22_Msk                              //----Filter bit 22
#define CAN_F13R2_FB23_Pos     (23U)
#define CAN_F13R2_FB23_Msk     (0x1UL << CAN_F13R2_FB23_Pos)                   //--- 0x00800000
#define CAN_F13R2_FB23         CAN_F13R2_FB23_Msk                              //----Filter bit 23
#define CAN_F13R2_FB24_Pos     (24U)
#define CAN_F13R2_FB24_Msk     (0x1UL << CAN_F13R2_FB24_Pos)                   //--- 0x01000000
#define CAN_F13R2_FB24         CAN_F13R2_FB24_Msk                              //----Filter bit 24
#define CAN_F13R2_FB25_Pos     (25U)
#define CAN_F13R2_FB25_Msk     (0x1UL << CAN_F13R2_FB25_Pos)                   //--- 0x02000000
#define CAN_F13R2_FB25         CAN_F13R2_FB25_Msk                              //----Filter bit 25
#define CAN_F13R2_FB26_Pos     (26U)
#define CAN_F13R2_FB26_Msk     (0x1UL << CAN_F13R2_FB26_Pos)                   //--- 0x04000000
#define CAN_F13R2_FB26         CAN_F13R2_FB26_Msk                              //----Filter bit 26
#define CAN_F13R2_FB27_Pos     (27U)
#define CAN_F13R2_FB27_Msk     (0x1UL << CAN_F13R2_FB27_Pos)                   //--- 0x08000000
#define CAN_F13R2_FB27         CAN_F13R2_FB27_Msk                              //----Filter bit 27
#define CAN_F13R2_FB28_Pos     (28U)
#define CAN_F13R2_FB28_Msk     (0x1UL << CAN_F13R2_FB28_Pos)                   //--- 0x10000000
#define CAN_F13R2_FB28         CAN_F13R2_FB28_Msk                              //----Filter bit 28
#define CAN_F13R2_FB29_Pos     (29U)
#define CAN_F13R2_FB29_Msk     (0x1UL << CAN_F13R2_FB29_Pos)                   //--- 0x20000000
#define CAN_F13R2_FB29         CAN_F13R2_FB29_Msk                              //----Filter bit 29
#define CAN_F13R2_FB30_Pos     (30U)
#define CAN_F13R2_FB30_Msk     (0x1UL << CAN_F13R2_FB30_Pos)                   //--- 0x40000000
#define CAN_F13R2_FB30         CAN_F13R2_FB30_Msk                              //----Filter bit 30
#define CAN_F13R2_FB31_Pos     (31U)
#define CAN_F13R2_FB31_Msk     (0x1UL << CAN_F13R2_FB31_Pos)                   //--- 0x80000000
#define CAN_F13R2_FB31         CAN_F13R2_FB31_Msk                              //----Filter bit 31

//---------------------------------------------------------------------------------------------
//---                           CRC calculation unit
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRC_DR register
//---------------------------------------------------------------------------------------------
#define CRC_DR_DR_Pos            (0U)
#define CRC_DR_DR_Msk            (0xFFFFFFFFUL << CRC_DR_DR_Pos)               //--- 0xFFFFFFFF
#define CRC_DR_DR                CRC_DR_DR_Msk                                 //--- Data register bits

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRC_IDR register
//---------------------------------------------------------------------------------------------
#define CRC_IDR_IDR_Pos          (0U)
#define CRC_IDR_IDR_Msk          (0xFFU << CRC_IDR_IDR_Pos)                    //--- 0x000000FF
#define CRC_IDR_IDR              CRC_IDR_IDR_Msk                               //--- General-purpose 8-bit data register bits

//---------------------------------------------------------------------------------------------
//--- Bit definition for CRC_CR register
//---------------------------------------------------------------------------------------------
#define CRC_CR_RESET_Pos         (0U)
#define CRC_CR_RESET_Msk         (0x1UL << CRC_CR_RESET_Pos)                   //--- 0x00000001
#define CRC_CR_RESET             CRC_CR_RESET_Msk                              //--- RESET the CRC computation unit bit
#define CRC_CR_POLYSIZE_Pos      (3U)
#define CRC_CR_POLYSIZE_Msk      (0x3UL << CRC_CR_POLYSIZE_Pos)                //--- 0x00000018
#define CRC_CR_POLYSIZE          CRC_CR_POLYSIZE_Msk                           //--- Polynomial size bits
#define CRC_CR_POLYSIZE_0        (0x1UL << CRC_CR_POLYSIZE_Pos)                //--- 0x00000008
#define CRC_CR_POLYSIZE_1        (0x2UL << CRC_CR_POLYSIZE_Pos)                //--- 0x00000010
#define CRC_CR_REV_IN_Pos        (5U)
#define CRC_CR_REV_IN_Msk        (0x3UL << CRC_CR_REV_IN_Pos)                  //--- 0x00000060
#define CRC_CR_REV_IN            CRC_CR_REV_IN_Msk                             //--- REV_IN Reverse Input Data bits
#define CRC_CR_REV_IN_0          (0x1UL << CRC_CR_REV_IN_Pos)                  //--- 0x00000020
#define CRC_CR_REV_IN_1          (0x2UL << CRC_CR_REV_IN_Pos)                  //--- 0x00000040
#define CRC_CR_REV_OUT_Pos       (7U)
#define CRC_CR_REV_OUT_Msk       (0x1UL << CRC_CR_REV_OUT_Pos)                 //--- 0x00000080
#define CRC_CR_REV_OUT           CRC_CR_REV_OUT_Msk                            //--- REV_OUT Reverse Output Data bits

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRC_INIT register
//---------------------------------------------------------------------------------------------
#define CRC_INIT_INIT_Pos        (0U)
#define CRC_INIT_INIT_Msk        (0xFFFFFFFFUL << CRC_INIT_INIT_Pos)           //--- 0xFFFFFFFF
#define CRC_INIT_INIT            CRC_INIT_INIT_Msk                             //--- Initial CRC value bits

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRC_POL register
//---------------------------------------------------------------------------------------------
#define CRC_POL_POL_Pos          (0U)
#define CRC_POL_POL_Msk          (0xFFFFFFFFUL << CRC_POL_POL_Pos)             //--- 0xFFFFFFFF
#define CRC_POL_POL              CRC_POL_POL_Msk                               //--- Coefficients of the polynomial

//---------------------------------------------------------------------------------------------
//---                           CRS Clock Recovery System
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRS_CR register
//---------------------------------------------------------------------------------------------
#define CRS_CR_SYNCOKIE_Pos       (0U)
#define CRS_CR_SYNCOKIE_Msk       (0x1UL << CRS_CR_SYNCOKIE_Pos)               //--- 0x00000001
#define CRS_CR_SYNCOKIE           CRS_CR_SYNCOKIE_Msk                          //--- SYNC event OK interrupt enable
#define CRS_CR_SYNCWARNIE_Pos     (1U)
#define CRS_CR_SYNCWARNIE_Msk     (0x1UL << CRS_CR_SYNCWARNIE_Pos)             //--- 0x00000002
#define CRS_CR_SYNCWARNIE         CRS_CR_SYNCWARNIE_Msk                        //--- SYNC warning interrupt enable
#define CRS_CR_ERRIE_Pos          (2U)
#define CRS_CR_ERRIE_Msk          (0x1UL << CRS_CR_ERRIE_Pos)                  //--- 0x00000004
#define CRS_CR_ERRIE              CRS_CR_ERRIE_Msk                             //--- SYNC error or trimming error interrupt enable
#define CRS_CR_ESYNCIE_Pos        (3U)
#define CRS_CR_ESYNCIE_Msk        (0x1UL << CRS_CR_ESYNCIE_Pos)                //--- 0x00000008
#define CRS_CR_ESYNCIE            CRS_CR_ESYNCIE_Msk                           //--- Expected SYNC interrupt enable
#define CRS_CR_CEN_Pos            (5U)
#define CRS_CR_CEN_Msk            (0x1UL << CRS_CR_CEN_Pos)                    //--- 0x00000020
#define CRS_CR_CEN                CRS_CR_CEN_Msk                               //--- Frequency error counter enable
#define CRS_CR_AUTOTRIMEN_Pos     (6U)
#define CRS_CR_AUTOTRIMEN_Msk     (0x1UL << CRS_CR_AUTOTRIMEN_Pos)             //--- 0x00000040
#define CRS_CR_AUTOTRIMEN         CRS_CR_AUTOTRIMEN_Msk                        //--- Automatic trimming enable
#define CRS_CR_SWSYNC_Pos         (7U)
#define CRS_CR_SWSYNC_Msk         (0x1UL << CRS_CR_SWSYNC_Pos)                 //--- 0x00000080
#define CRS_CR_SWSYNC             CRS_CR_SWSYNC_Msk                            //--- Generate software SYNC event
#define CRS_CR_TRIM_Pos           (8U)
#define CRS_CR_TRIM_Msk           (0x3FUL << CRS_CR_TRIM_Pos)                  //--- 0x00003F00
#define CRS_CR_TRIM               CRS_CR_TRIM_Msk                              //--- HSI48 oscillator smooth trimming

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRS_CFGR register
//---------------------------------------------------------------------------------------------
#define CRS_CFGR_RELOAD_Pos       (0U)
#define CRS_CFGR_RELOAD_Msk       (0xFFFFUL << CRS_CFGR_RELOAD_Pos)            //--- 0x0000FFFF
#define CRS_CFGR_RELOAD           CRS_CFGR_RELOAD_Msk                          //--- Counter reload value
#define CRS_CFGR_FELIM_Pos        (16U)
#define CRS_CFGR_FELIM_Msk        (0xFFUL << CRS_CFGR_FELIM_Pos)               //--- 0x00FF0000
#define CRS_CFGR_FELIM            CRS_CFGR_FELIM_Msk                           //--- Frequency error limit

#define CRS_CFGR_SYNCDIV_Pos      (24U)
#define CRS_CFGR_SYNCDIV_Msk      (0x7UL << CRS_CFGR_SYNCDIV_Pos)              //--- 0x07000000
#define CRS_CFGR_SYNCDIV          CRS_CFGR_SYNCDIV_Msk                         //--- SYNC divider
#define CRS_CFGR_SYNCDIV_0        (0x1UL << CRS_CFGR_SYNCDIV_Pos)              //--- 0x01000000
#define CRS_CFGR_SYNCDIV_1        (0x2UL << CRS_CFGR_SYNCDIV_Pos)              //--- 0x02000000
#define CRS_CFGR_SYNCDIV_2        (0x4UL << CRS_CFGR_SYNCDIV_Pos)              //--- 0x04000000

#define CRS_CFGR_SYNCSRC_Pos      (28U)
#define CRS_CFGR_SYNCSRC_Msk      (0x3UL << CRS_CFGR_SYNCSRC_Pos)              //--- 0x30000000
#define CRS_CFGR_SYNCSRC          CRS_CFGR_SYNCSRC_Msk                         //--- SYNC signal source selection
#define CRS_CFGR_SYNCSRC_0        (0x1UL << CRS_CFGR_SYNCSRC_Pos)              //--- 0x10000000
#define CRS_CFGR_SYNCSRC_1        (0x2UL << CRS_CFGR_SYNCSRC_Pos)              //--- 0x20000000

#define CRS_CFGR_SYNCPOL_Pos      (31U)
#define CRS_CFGR_SYNCPOL_Msk      (0x1UL << CRS_CFGR_SYNCPOL_Pos)              //--- 0x80000000
#define CRS_CFGR_SYNCPOL          CRS_CFGR_SYNCPOL_Msk                         //--- SYNC polarity selection

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRS_ISR register
//---------------------------------------------------------------------------------------------
#define CRS_ISR_SYNCOKF_Pos       (0U)
#define CRS_ISR_SYNCOKF_Msk       (0x1UL << CRS_ISR_SYNCOKF_Pos)               //--- 0x00000001
#define CRS_ISR_SYNCOKF           CRS_ISR_SYNCOKF_Msk                          //--- SYNC event OK flag
#define CRS_ISR_SYNCWARNF_Pos     (1U)
#define CRS_ISR_SYNCWARNF_Msk     (0x1UL << CRS_ISR_SYNCWARNF_Pos)             //--- 0x00000002
#define CRS_ISR_SYNCWARNF         CRS_ISR_SYNCWARNF_Msk                        //--- SYNC warning flag
#define CRS_ISR_ERRF_Pos          (2U)
#define CRS_ISR_ERRF_Msk          (0x1UL << CRS_ISR_ERRF_Pos)                  //--- 0x00000004
#define CRS_ISR_ERRF              CRS_ISR_ERRF_Msk                             //--- Error flag
#define CRS_ISR_ESYNCF_Pos        (3U)
#define CRS_ISR_ESYNCF_Msk        (0x1UL << CRS_ISR_ESYNCF_Pos)                //--- 0x00000008
#define CRS_ISR_ESYNCF            CRS_ISR_ESYNCF_Msk                           //--- Expected SYNC flag
#define CRS_ISR_SYNCERR_Pos       (8U)
#define CRS_ISR_SYNCERR_Msk       (0x1UL << CRS_ISR_SYNCERR_Pos)               //--- 0x00000100
#define CRS_ISR_SYNCERR           CRS_ISR_SYNCERR_Msk                          //--- SYNC error
#define CRS_ISR_SYNCMISS_Pos      (9U)
#define CRS_ISR_SYNCMISS_Msk      (0x1UL << CRS_ISR_SYNCMISS_Pos)              //--- 0x00000200
#define CRS_ISR_SYNCMISS          CRS_ISR_SYNCMISS_Msk                         //--- SYNC missed
#define CRS_ISR_TRIMOVF_Pos       (10U)
#define CRS_ISR_TRIMOVF_Msk       (0x1UL << CRS_ISR_TRIMOVF_Pos)               //--- 0x00000400
#define CRS_ISR_TRIMOVF           CRS_ISR_TRIMOVF_Msk                          //--- Trimming overflow or underflow
#define CRS_ISR_FEDIR_Pos         (15U)
#define CRS_ISR_FEDIR_Msk         (0x1UL << CRS_ISR_FEDIR_Pos)                 //--- 0x00008000
#define CRS_ISR_FEDIR             CRS_ISR_FEDIR_Msk                            //--- Frequency error direction
#define CRS_ISR_FECAP_Pos         (16U)
#define CRS_ISR_FECAP_Msk         (0xFFFFUL << CRS_ISR_FECAP_Pos)              //--- 0xFFFF0000
#define CRS_ISR_FECAP             CRS_ISR_FECAP_Msk                            //--- Frequency error capture

//---------------------------------------------------------------------------------------------
//---  Bit definition for CRS_ICR register
//---------------------------------------------------------------------------------------------
#define CRS_ICR_SYNCOKC_Pos       (0U)
#define CRS_ICR_SYNCOKC_Msk       (0x1UL << CRS_ICR_SYNCOKC_Pos)               //--- 0x00000001
#define CRS_ICR_SYNCOKC           CRS_ICR_SYNCOKC_Msk                          //--- SYNC event OK clear flag
#define CRS_ICR_SYNCWARNC_Pos     (1U)
#define CRS_ICR_SYNCWARNC_Msk     (0x1UL << CRS_ICR_SYNCWARNC_Pos)             //--- 0x00000002
#define CRS_ICR_SYNCWARNC         CRS_ICR_SYNCWARNC_Msk                        //--- SYNC warning clear flag
#define CRS_ICR_ERRC_Pos          (2U)
#define CRS_ICR_ERRC_Msk          (0x1UL << CRS_ICR_ERRC_Pos)                  //--- 0x00000004
#define CRS_ICR_ERRC              CRS_ICR_ERRC_Msk                             //--- Error clear flag
#define CRS_ICR_ESYNCC_Pos        (3U)
#define CRS_ICR_ESYNCC_Msk        (0x1UL << CRS_ICR_ESYNCC_Pos)                //--- 0x00000008
#define CRS_ICR_ESYNCC            CRS_ICR_ESYNCC_Msk                           //--- Expected SYNC clear flag

//---------------------------------------------------------------------------------------------
//---                       Digital to Analog Converter
//---------------------------------------------------------------------------------------------

#define DAC_CHANNEL2_SUPPORT                           //--- DAC feature available only on specific devices: DAC channel 2 available

//---------------------------------------------------------------------------------------------
//--- Bit definition for DAC_CR register
//---------------------------------------------------------------------------------------------
#define DAC_CR_EN1_Pos              (0U)
#define DAC_CR_EN1_Msk              (0x1UL << DAC_CR_EN1_Pos)                  //--- 0x00000001
#define DAC_CR_EN1                  DAC_CR_EN1_Msk                             //----DAC channel1 enable
#define DAC_CR_TEN1_Pos             (2U)
#define DAC_CR_TEN1_Msk             (0x1UL << DAC_CR_TEN1_Pos)                 //--- 0x00000004
#define DAC_CR_TEN1                 DAC_CR_TEN1_Msk                            //----DAC channel1 Trigger enable

