Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---   Bit definition for I2C_PECR register
//---------------------------------------------------------------------------------------------
#define I2C_PECR_PEC_Pos             (0U)
#define I2C_PECR_PEC_Msk             (0xFFUL << I2C_PECR_PEC_Pos)              //--- 0x000000FF
#define I2C_PECR_PEC                 I2C_PECR_PEC_Msk                          //--- PEC register

//---------------------------------------------------------------------------------------------
//---   Bit definition for I2C_RXDR register
//---------------------------------------------------------------------------------------------
#define I2C_RXDR_RXDATA_Pos          (0U)
#define I2C_RXDR_RXDATA_Msk          (0xFFUL << I2C_RXDR_RXDATA_Pos)           //--- 0x000000FF
#define I2C_RXDR_RXDATA              I2C_RXDR_RXDATA_Msk                       //--- 8-bit receive data

//---------------------------------------------------------------------------------------------
//---   Bit definition for I2C_TXDR register
//---------------------------------------------------------------------------------------------
#define I2C_TXDR_TXDATA_Pos          (0U)
#define I2C_TXDR_TXDATA_Msk          (0xFFUL << I2C_TXDR_TXDATA_Pos)           //--- 0x000000FF
#define I2C_TXDR_TXDATA              I2C_TXDR_TXDATA_Msk                       //--- 8-bit transmit data

//---------------------------------------------------------------------------------------------
//---                            Independent WATCHDOG
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for IWDG_KR register
//---------------------------------------------------------------------------------------------
#define IWDG_KR_KEY_Pos      (0U)
#define IWDG_KR_KEY_Msk      (0xFFFFUL << IWDG_KR_KEY_Pos)                     //--- 0x0000FFFF
#define IWDG_KR_KEY          IWDG_KR_KEY_Msk                                   //----Key value (write only, read 0000h)

//---------------------------------------------------------------------------------------------
//---  Bit definition for IWDG_PR register
//---------------------------------------------------------------------------------------------
#define IWDG_PR_PR_Pos       (0U)
#define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         //--- 0x00000007
#define IWDG_PR_PR           IWDG_PR_PR_Msk                                    //----PR[2:0] (Prescaler divider)
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                         //--- 0x00000001
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                         //--- 0x00000002
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                         //--- 0x00000004

//---------------------------------------------------------------------------------------------
//---  Bit definition for IWDG_RLR register
//---------------------------------------------------------------------------------------------
#define IWDG_RLR_RL_Pos      (0U)
#define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      //--- 0x00000FFF
#define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   //----Watchdog counter reload value

//---------------------------------------------------------------------------------------------
//---  Bit definition for IWDG_SR register
//---------------------------------------------------------------------------------------------
#define IWDG_SR_PVU_Pos      (0U)
#define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        //--- 0x00000001
#define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   //--- Watchdog prescaler value update
#define IWDG_SR_RVU_Pos      (1U)
#define IWDG_SR_RVU_Msk      (0x1UL << IWDG_SR_RVU_Pos)                        //--- 0x00000002
#define IWDG_SR_RVU          IWDG_SR_RVU_Msk                                   //--- Watchdog counter reload value update
#define IWDG_SR_WVU_Pos      (2U)
#define IWDG_SR_WVU_Msk      (0x1UL << IWDG_SR_WVU_Pos)                        //--- 0x00000004
#define IWDG_SR_WVU          IWDG_SR_WVU_Msk                                   //--- Watchdog counter window value update

//---------------------------------------------------------------------------------------------
//---  Bit definition for IWDG_KR register
//---------------------------------------------------------------------------------------------
#define IWDG_WINR_WIN_Pos    (0U)
#define IWDG_WINR_WIN_Msk    (0xFFFUL << IWDG_WINR_WIN_Pos)                    //--- 0x00000FFF
#define IWDG_WINR_WIN        IWDG_WINR_WIN_Msk                                 //--- Watchdog counter window value

//---------------------------------------------------------------------------------------------
//   Firewall
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for CSSA;CSL;NVDSSA;NVDSL;VDSSA;VDSL register
//---------------------------------------------------------------------------------------------
#define FW_CSSA_ADD_Pos      (8U)
#define FW_CSSA_ADD_Msk      (0xFFFFUL << FW_CSSA_ADD_Pos)                     //--- 0x00FFFF00
#define FW_CSSA_ADD          FW_CSSA_ADD_Msk                                   //--- Code Segment Start Address
#define FW_CSL_LENG_Pos      (8U)
#define FW_CSL_LENG_Msk      (0x3FFFUL << FW_CSL_LENG_Pos)                     //--- 0x003FFF00
#define FW_CSL_LENG          FW_CSL_LENG_Msk                                   //--- Code Segment Length
#define FW_NVDSSA_ADD_Pos    (8U)
#define FW_NVDSSA_ADD_Msk    (0xFFFFUL << FW_NVDSSA_ADD_Pos)                   //--- 0x00FFFF00
#define FW_NVDSSA_ADD        FW_NVDSSA_ADD_Msk                                 //--- Non Volatile Dat Segment Start Address
#define FW_NVDSL_LENG_Pos    (8U)
#define FW_NVDSL_LENG_Msk    (0x3FFFUL << FW_NVDSL_LENG_Pos)                   //--- 0x003FFF00
#define FW_NVDSL_LENG        FW_NVDSL_LENG_Msk                                 //--- Non Volatile Data Segment Length
#define FW_VDSSA_ADD_Pos     (6U)
#define FW_VDSSA_ADD_Msk     (0x7FFUL << FW_VDSSA_ADD_Pos)                     //--- 0x0001FFC0
#define FW_VDSSA_ADD         FW_VDSSA_ADD_Msk                                  //--- Volatile Data Segment Start Address
#define FW_VDSL_LENG_Pos     (6U)
#define FW_VDSL_LENG_Msk     (0x7FFUL << FW_VDSL_LENG_Pos)                     //--- 0x0001FFC0
#define FW_VDSL_LENG         FW_VDSL_LENG_Msk                                  //--- Volatile Data Segment Length

//---------------------------------------------------------------------------------------------
//    Bit definition for CR register
//---------------------------------------------------------------------------------------------
#define FW_CR_FPA_Pos        (0U)
#define FW_CR_FPA_Msk        (0x1UL << FW_CR_FPA_Pos)                          //--- 0x00000001
#define FW_CR_FPA            FW_CR_FPA_Msk                                     //--- Firewall Pre Arm
#define FW_CR_VDS_Pos        (1U)
#define FW_CR_VDS_Msk        (0x1UL << FW_CR_VDS_Pos)                          //--- 0x00000002
#define FW_CR_VDS            FW_CR_VDS_Msk                                     //--- Volatile Data Sharing
#define FW_CR_VDE_Pos        (2U)
#define FW_CR_VDE_Msk        (0x1UL << FW_CR_VDE_Pos)                          //--- 0x00000004
#define FW_CR_VDE            FW_CR_VDE_Msk                                     //--- Volatile Data Execution

//---------------------------------------------------------------------------------------------
//---                              Power Control
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_CR1 register
//---------------------------------------------------------------------------------------------
#define PWR_CR1_LPR_Pos              (14U)
#define PWR_CR1_LPR_Msk              (0x1UL << PWR_CR1_LPR_Pos)                //--- 0x00004000
#define PWR_CR1_LPR                  PWR_CR1_LPR_Msk                           //--- Regulator low-power mode
#define PWR_CR1_VOS_Pos              (9U)
#define PWR_CR1_VOS_Msk              (0x3UL << PWR_CR1_VOS_Pos)                //--- 0x00000600
#define PWR_CR1_VOS                  PWR_CR1_VOS_Msk                           //--- VOS[1:0] bits (Regulator voltage scaling output selection)
#define PWR_CR1_VOS_0                (0x1UL << PWR_CR1_VOS_Pos)                //--- 0x00000200
#define PWR_CR1_VOS_1                (0x2UL << PWR_CR1_VOS_Pos)                //--- 0x00000400
#define PWR_CR1_DBP_Pos              (8U)
#define PWR_CR1_DBP_Msk              (0x1UL << PWR_CR1_DBP_Pos)                //--- 0x00000100
#define PWR_CR1_DBP                  PWR_CR1_DBP_Msk                           //--- Disable Back-up domain Protection
#define PWR_CR1_LPMS_Pos             (0U)
#define PWR_CR1_LPMS_Msk             (0x7UL << PWR_CR1_LPMS_Pos)               //--- 0x00000007
#define PWR_CR1_LPMS                 PWR_CR1_LPMS_Msk                          //--- Low-power mode selection field
#define PWR_CR1_LPMS_STOP0           (0x00000000UL)                            //--- Stop 0 mode
#define PWR_CR1_LPMS_STOP1_Pos       (0U)
#define PWR_CR1_LPMS_STOP1_Msk       (0x1UL << PWR_CR1_LPMS_STOP1_Pos)         //--- 0x00000001
#define PWR_CR1_LPMS_STOP1           PWR_CR1_LPMS_STOP1_Msk                    //--- Stop 1 mode
#define PWR_CR1_LPMS_STOP2_Pos       (1U)
#define PWR_CR1_LPMS_STOP2_Msk       (0x1UL << PWR_CR1_LPMS_STOP2_Pos)         //--- 0x00000002
#define PWR_CR1_LPMS_STOP2           PWR_CR1_LPMS_STOP2_Msk                    //--- Stop 2 mode
#define PWR_CR1_LPMS_STANDBY_Pos     (0U)
#define PWR_CR1_LPMS_STANDBY_Msk     (0x3UL << PWR_CR1_LPMS_STANDBY_Pos)       //--- 0x00000003
#define PWR_CR1_LPMS_STANDBY         PWR_CR1_LPMS_STANDBY_Msk                  //--- Stand-by mode
#define PWR_CR1_LPMS_SHUTDOWN_Pos    (2U)
#define PWR_CR1_LPMS_SHUTDOWN_Msk    (0x1UL << PWR_CR1_LPMS_SHUTDOWN_Pos)      //--- 0x00000004
#define PWR_CR1_LPMS_SHUTDOWN        PWR_CR1_LPMS_SHUTDOWN_Msk                 //--- Shut-down mode


//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_CR2 register
//---------------------------------------------------------------------------------------------
#define PWR_CR2_USV_Pos              (10U)
#define PWR_CR2_USV_Msk              (0x1UL << PWR_CR2_USV_Pos)                //--- 0x00000400
#define PWR_CR2_USV                  PWR_CR2_USV_Msk                           //--- VDD USB Supply Valid
//---------------------------------------------------------------------------------------------
//--- PVME  Peripheral Voltage Monitor Enable
//---------------------------------------------------------------------------------------------
#define PWR_CR2_PVME_Pos             (4U)
#define PWR_CR2_PVME_Msk             (0xDUL << PWR_CR2_PVME_Pos)               //--- 0x000000D0
#define PWR_CR2_PVME                 PWR_CR2_PVME_Msk                          //--- PVM bits field
#define PWR_CR2_PVME4_Pos            (7U)
#define PWR_CR2_PVME4_Msk            (0x1UL << PWR_CR2_PVME4_Pos)              //--- 0x00000080
#define PWR_CR2_PVME4                PWR_CR2_PVME4_Msk                         //--- PVM 4 Enable
#define PWR_CR2_PVME3_Pos            (6U)
#define PWR_CR2_PVME3_Msk            (0x1UL << PWR_CR2_PVME3_Pos)              //--- 0x00000040
#define PWR_CR2_PVME3                PWR_CR2_PVME3_Msk                         //--- PVM 3 Enable
#define PWR_CR2_PVME1_Pos            (4U)
#define PWR_CR2_PVME1_Msk            (0x1UL << PWR_CR2_PVME1_Pos)              //--- 0x00000010
#define PWR_CR2_PVME1                PWR_CR2_PVME1_Msk                         //--- PVM 1 Enable
//---------------------------------------------------------------------------------------------
//--- PVD level configuration
//---------------------------------------------------------------------------------------------
#define PWR_CR2_PLS_Pos              (1U)
#define PWR_CR2_PLS_Msk              (0x7UL << PWR_CR2_PLS_Pos)                //--- 0x0000000E
#define PWR_CR2_PLS                  PWR_CR2_PLS_Msk                           //--- PVD level selection
#define PWR_CR2_PLS_LEV0             (0x00000000UL)                            //--- PVD level 0
#define PWR_CR2_PLS_LEV1_Pos         (1U)
#define PWR_CR2_PLS_LEV1_Msk         (0x1UL << PWR_CR2_PLS_LEV1_Pos)           //--- 0x00000002
#define PWR_CR2_PLS_LEV1             PWR_CR2_PLS_LEV1_Msk                      //--- PVD level 1
#define PWR_CR2_PLS_LEV2_Pos         (2U)
#define PWR_CR2_PLS_LEV2_Msk         (0x1UL << PWR_CR2_PLS_LEV2_Pos)           //--- 0x00000004
#define PWR_CR2_PLS_LEV2             PWR_CR2_PLS_LEV2_Msk                      //--- PVD level 2
#define PWR_CR2_PLS_LEV3_Pos         (1U)
#define PWR_CR2_PLS_LEV3_Msk         (0x3UL << PWR_CR2_PLS_LEV3_Pos)           //--- 0x00000006
#define PWR_CR2_PLS_LEV3             PWR_CR2_PLS_LEV3_Msk                      //--- PVD level 3
#define PWR_CR2_PLS_LEV4_Pos         (3U)
#define PWR_CR2_PLS_LEV4_Msk         (0x1UL << PWR_CR2_PLS_LEV4_Pos)           //--- 0x00000008
#define PWR_CR2_PLS_LEV4             PWR_CR2_PLS_LEV4_Msk                      //--- PVD level 4
#define PWR_CR2_PLS_LEV5_Pos         (1U)
#define PWR_CR2_PLS_LEV5_Msk         (0x5UL << PWR_CR2_PLS_LEV5_Pos)           //--- 0x0000000A
#define PWR_CR2_PLS_LEV5             PWR_CR2_PLS_LEV5_Msk                      //--- PVD level 5
#define PWR_CR2_PLS_LEV6_Pos         (2U)
#define PWR_CR2_PLS_LEV6_Msk         (0x3UL << PWR_CR2_PLS_LEV6_Pos)           //--- 0x0000000C
#define PWR_CR2_PLS_LEV6             PWR_CR2_PLS_LEV6_Msk                      //--- PVD level 6
#define PWR_CR2_PLS_LEV7_Pos         (1U)
#define PWR_CR2_PLS_LEV7_Msk         (0x7UL << PWR_CR2_PLS_LEV7_Pos)           //--- 0x0000000E
#define PWR_CR2_PLS_LEV7             PWR_CR2_PLS_LEV7_Msk                      //--- PVD level 7
#define PWR_CR2_PVDE_Pos             (0U)
#define PWR_CR2_PVDE_Msk             (0x1UL << PWR_CR2_PVDE_Pos)               //--- 0x00000001
#define PWR_CR2_PVDE                 PWR_CR2_PVDE_Msk                          //--- Power Voltage Detector Enable

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_CR3 register
//---------------------------------------------------------------------------------------------
#define PWR_CR3_EIWUL_Pos            (15U)
#define PWR_CR3_EIWUL_Msk            (0x1UL << PWR_CR3_EIWUL_Pos)              //--- 0x00008000
#define PWR_CR3_EIWUL                PWR_CR3_EIWUL_Msk                         //--- Enable Internal Wake-up line
#define PWR_CR3_APC_Pos              (10U)
#define PWR_CR3_APC_Msk              (0x1UL << PWR_CR3_APC_Pos)                //--- 0x00000400
#define PWR_CR3_APC                  PWR_CR3_APC_Msk                           //--- Apply pull-up and pull-down configuration
#define PWR_CR3_RRS_Pos              (8U)
#define PWR_CR3_RRS_Msk              (0x1UL << PWR_CR3_RRS_Pos)                //--- 0x00000100
#define PWR_CR3_RRS                  PWR_CR3_RRS_Msk                           //--- SRAM2 Retention in Stand-by mode
#define PWR_CR3_EWUP5_Pos            (4U)
#define PWR_CR3_EWUP5_Msk            (0x1UL << PWR_CR3_EWUP5_Pos)              //--- 0x00000010
#define PWR_CR3_EWUP5                PWR_CR3_EWUP5_Msk                         //--- Enable Wake-Up Pin 5
#define PWR_CR3_EWUP4_Pos            (3U)
#define PWR_CR3_EWUP4_Msk            (0x1UL << PWR_CR3_EWUP4_Pos)              //--- 0x00000008
#define PWR_CR3_EWUP4                PWR_CR3_EWUP4_Msk                         //--- Enable Wake-Up Pin 4
#define PWR_CR3_EWUP3_Pos            (2U)
#define PWR_CR3_EWUP3_Msk            (0x1UL << PWR_CR3_EWUP3_Pos)              //--- 0x00000004
#define PWR_CR3_EWUP3                PWR_CR3_EWUP3_Msk                         //--- Enable Wake-Up Pin 3
#define PWR_CR3_EWUP2_Pos            (1U)
#define PWR_CR3_EWUP2_Msk            (0x1UL << PWR_CR3_EWUP2_Pos)              //--- 0x00000002
#define PWR_CR3_EWUP2                PWR_CR3_EWUP2_Msk                         //--- Enable Wake-Up Pin 2
#define PWR_CR3_EWUP1_Pos            (0U)
#define PWR_CR3_EWUP1_Msk            (0x1UL << PWR_CR3_EWUP1_Pos)              //--- 0x00000001
#define PWR_CR3_EWUP1                PWR_CR3_EWUP1_Msk                         //--- Enable Wake-Up Pin 1
#define PWR_CR3_EWUP_Pos             (0U)
#define PWR_CR3_EWUP_Msk             (0x1FUL << PWR_CR3_EWUP_Pos)              //--- 0x0000001F
#define PWR_CR3_EWUP                 PWR_CR3_EWUP_Msk                          //--- Enable Wake-Up Pins

//---------------------------------------------------------------------------------------------
//---  Legacy defines
//---------------------------------------------------------------------------------------------
#define PWR_CR3_EIWF_Pos             PWR_CR3_EIWUL_Pos
#define PWR_CR3_EIWF_Msk             PWR_CR3_EIWUL_Msk
#define PWR_CR3_EIWF                 PWR_CR3_EIWUL


//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_CR4 register
//---------------------------------------------------------------------------------------------
#define PWR_CR4_VBRS_Pos             (9U)
#define PWR_CR4_VBRS_Msk             (0x1UL << PWR_CR4_VBRS_Pos)               //--- 0x00000200
#define PWR_CR4_VBRS                 PWR_CR4_VBRS_Msk                          //--- VBAT Battery charging Resistor Selection
#define PWR_CR4_VBE_Pos              (8U)
#define PWR_CR4_VBE_Msk              (0x1UL << PWR_CR4_VBE_Pos)                //--- 0x00000100
#define PWR_CR4_VBE                  PWR_CR4_VBE_Msk                           //--- VBAT Battery charging Enable
#define PWR_CR4_WP5_Pos              (4U)
#define PWR_CR4_WP5_Msk              (0x1UL << PWR_CR4_WP5_Pos)                //--- 0x00000010
#define PWR_CR4_WP5                  PWR_CR4_WP5_Msk                           //--- Wake-Up Pin 5 polarity
#define PWR_CR4_WP4_Pos              (3U)
#define PWR_CR4_WP4_Msk              (0x1UL << PWR_CR4_WP4_Pos)                //--- 0x00000008
#define PWR_CR4_WP4                  PWR_CR4_WP4_Msk                           //--- Wake-Up Pin 4 polarity
#define PWR_CR4_WP3_Pos              (2U)
#define PWR_CR4_WP3_Msk              (0x1UL << PWR_CR4_WP3_Pos)                //--- 0x00000004
#define PWR_CR4_WP3                  PWR_CR4_WP3_Msk                           //--- Wake-Up Pin 3 polarity
#define PWR_CR4_WP2_Pos              (1U)
#define PWR_CR4_WP2_Msk              (0x1UL << PWR_CR4_WP2_Pos)                //--- 0x00000002
#define PWR_CR4_WP2                  PWR_CR4_WP2_Msk                           //--- Wake-Up Pin 2 polarity
#define PWR_CR4_WP1_Pos              (0U)
#define PWR_CR4_WP1_Msk              (0x1UL << PWR_CR4_WP1_Pos)                //--- 0x00000001
#define PWR_CR4_WP1                  PWR_CR4_WP1_Msk                           //--- Wake-Up Pin 1 polarity

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_SR1 register
//---------------------------------------------------------------------------------------------
#define PWR_SR1_WUFI_Pos             (15U)
#define PWR_SR1_WUFI_Msk             (0x1UL << PWR_SR1_WUFI_Pos)               //--- 0x00008000
#define PWR_SR1_WUFI                 PWR_SR1_WUFI_Msk                          //--- Wake-Up Flag Internal
#define PWR_SR1_SBF_Pos              (8U)
#define PWR_SR1_SBF_Msk              (0x1UL << PWR_SR1_SBF_Pos)                //--- 0x00000100
#define PWR_SR1_SBF                  PWR_SR1_SBF_Msk                           //--- Stand-By Flag
#define PWR_SR1_WUF_Pos              (0U)
#define PWR_SR1_WUF_Msk              (0x1FUL << PWR_SR1_WUF_Pos)               //--- 0x0000001F
#define PWR_SR1_WUF                  PWR_SR1_WUF_Msk                           //--- Wake-up Flags
#define PWR_SR1_WUF5_Pos             (4U)
#define PWR_SR1_WUF5_Msk             (0x1UL << PWR_SR1_WUF5_Pos)               //--- 0x00000010
#define PWR_SR1_WUF5                 PWR_SR1_WUF5_Msk                          //--- Wake-up Flag 5
#define PWR_SR1_WUF4_Pos             (3U)
#define PWR_SR1_WUF4_Msk             (0x1UL << PWR_SR1_WUF4_Pos)               //--- 0x00000008
#define PWR_SR1_WUF4                 PWR_SR1_WUF4_Msk                          //--- Wake-up Flag 4
#define PWR_SR1_WUF3_Pos             (2U)
#define PWR_SR1_WUF3_Msk             (0x1UL << PWR_SR1_WUF3_Pos)               //--- 0x00000004
#define PWR_SR1_WUF3                 PWR_SR1_WUF3_Msk                          //--- Wake-up Flag 3
#define PWR_SR1_WUF2_Pos             (1U)
#define PWR_SR1_WUF2_Msk             (0x1UL << PWR_SR1_WUF2_Pos)               //--- 0x00000002
#define PWR_SR1_WUF2                 PWR_SR1_WUF2_Msk                          //--- Wake-up Flag 2
#define PWR_SR1_WUF1_Pos             (0U)
#define PWR_SR1_WUF1_Msk             (0x1UL << PWR_SR1_WUF1_Pos)               //--- 0x00000001
#define PWR_SR1_WUF1                 PWR_SR1_WUF1_Msk                          //--- Wake-up Flag 1

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_SR2 register
//---------------------------------------------------------------------------------------------
#define PWR_SR2_PVMO4_Pos            (15U)
#define PWR_SR2_PVMO4_Msk            (0x1UL << PWR_SR2_PVMO4_Pos)              //--- 0x00008000
#define PWR_SR2_PVMO4                PWR_SR2_PVMO4_Msk                         //--- Peripheral Voltage Monitoring Output 4
#define PWR_SR2_PVMO3_Pos            (14U)
#define PWR_SR2_PVMO3_Msk            (0x1UL << PWR_SR2_PVMO3_Pos)              //--- 0x00004000
#define PWR_SR2_PVMO3                PWR_SR2_PVMO3_Msk                         //--- Peripheral Voltage Monitoring Output 3
#define PWR_SR2_PVDO_Pos             (11U)
#define PWR_SR2_PVDO_Msk             (0x1UL << PWR_SR2_PVDO_Pos)               //--- 0x00000800
#define PWR_SR2_PVDO                 PWR_SR2_PVDO_Msk                          //--- Power Voltage Detector Output
#define PWR_SR2_VOSF_Pos             (10U)
#define PWR_SR2_VOSF_Msk             (0x1UL << PWR_SR2_VOSF_Pos)               //--- 0x00000400
#define PWR_SR2_VOSF                 PWR_SR2_VOSF_Msk                          //--- Voltage Scaling Flag
#define PWR_SR2_REGLPF_Pos           (9U)
#define PWR_SR2_REGLPF_Msk           (0x1UL << PWR_SR2_REGLPF_Pos)             //--- 0x00000200
#define PWR_SR2_REGLPF               PWR_SR2_REGLPF_Msk                        //--- Low-power Regulator Flag
#define PWR_SR2_REGLPS_Pos           (8U)
#define PWR_SR2_REGLPS_Msk           (0x1UL << PWR_SR2_REGLPS_Pos)             //--- 0x00000100
#define PWR_SR2_REGLPS               PWR_SR2_REGLPS_Msk                        //--- Low-power Regulator Started

