Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_SCR register
//---------------------------------------------------------------------------------------------
#define PWR_SCR_CSBF_Pos             (8U)
#define PWR_SCR_CSBF_Msk             (0x1UL << PWR_SCR_CSBF_Pos)               //--- 0x00000100
#define PWR_SCR_CSBF                 PWR_SCR_CSBF_Msk                          //--- Clear Stand-By Flag
#define PWR_SCR_CWUF_Pos             (0U)
#define PWR_SCR_CWUF_Msk             (0x1FUL << PWR_SCR_CWUF_Pos)              //--- 0x0000001F
#define PWR_SCR_CWUF                 PWR_SCR_CWUF_Msk                          //--- Clear Wake-up Flags
#define PWR_SCR_CWUF5_Pos            (4U)
#define PWR_SCR_CWUF5_Msk            (0x1UL << PWR_SCR_CWUF5_Pos)              //--- 0x00000010
#define PWR_SCR_CWUF5                PWR_SCR_CWUF5_Msk                         //--- Clear Wake-up Flag 5
#define PWR_SCR_CWUF4_Pos            (3U)
#define PWR_SCR_CWUF4_Msk            (0x1UL << PWR_SCR_CWUF4_Pos)              //--- 0x00000008
#define PWR_SCR_CWUF4                PWR_SCR_CWUF4_Msk                         //--- Clear Wake-up Flag 4
#define PWR_SCR_CWUF3_Pos            (2U)
#define PWR_SCR_CWUF3_Msk            (0x1UL << PWR_SCR_CWUF3_Pos)              //--- 0x00000004
#define PWR_SCR_CWUF3                PWR_SCR_CWUF3_Msk                         //--- Clear Wake-up Flag 3
#define PWR_SCR_CWUF2_Pos            (1U)
#define PWR_SCR_CWUF2_Msk            (0x1UL << PWR_SCR_CWUF2_Pos)              //--- 0x00000002
#define PWR_SCR_CWUF2                PWR_SCR_CWUF2_Msk                         //--- Clear Wake-up Flag 2
#define PWR_SCR_CWUF1_Pos            (0U)
#define PWR_SCR_CWUF1_Msk            (0x1UL << PWR_SCR_CWUF1_Pos)              //--- 0x00000001
#define PWR_SCR_CWUF1                PWR_SCR_CWUF1_Msk                         //--- Clear Wake-up Flag 1

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PUCRA register
//---------------------------------------------------------------------------------------------
#define PWR_PUCRA_PA15_Pos           (15U)
#define PWR_PUCRA_PA15_Msk           (0x1UL << PWR_PUCRA_PA15_Pos)             //--- 0x00008000
#define PWR_PUCRA_PA15               PWR_PUCRA_PA15_Msk                        //--- Port PA15 Pull-Up set
#define PWR_PUCRA_PA13_Pos           (13U)
#define PWR_PUCRA_PA13_Msk           (0x1UL << PWR_PUCRA_PA13_Pos)             //--- 0x00002000
#define PWR_PUCRA_PA13               PWR_PUCRA_PA13_Msk                        //--- Port PA13 Pull-Up set
#define PWR_PUCRA_PA12_Pos           (12U)
#define PWR_PUCRA_PA12_Msk           (0x1UL << PWR_PUCRA_PA12_Pos)             //--- 0x00001000
#define PWR_PUCRA_PA12               PWR_PUCRA_PA12_Msk                        //--- Port PA12 Pull-Up set
#define PWR_PUCRA_PA11_Pos           (11U)
#define PWR_PUCRA_PA11_Msk           (0x1UL << PWR_PUCRA_PA11_Pos)             //--- 0x00000800
#define PWR_PUCRA_PA11               PWR_PUCRA_PA11_Msk                        //--- Port PA11 Pull-Up set
#define PWR_PUCRA_PA10_Pos           (10U)
#define PWR_PUCRA_PA10_Msk           (0x1UL << PWR_PUCRA_PA10_Pos)             //--- 0x00000400
#define PWR_PUCRA_PA10               PWR_PUCRA_PA10_Msk                        //--- Port PA10 Pull-Up set
#define PWR_PUCRA_PA9_Pos            (9U)
#define PWR_PUCRA_PA9_Msk            (0x1UL << PWR_PUCRA_PA9_Pos)              //--- 0x00000200
#define PWR_PUCRA_PA9                PWR_PUCRA_PA9_Msk                         //--- Port PA9 Pull-Up set
#define PWR_PUCRA_PA8_Pos            (8U)
#define PWR_PUCRA_PA8_Msk            (0x1UL << PWR_PUCRA_PA8_Pos)              //--- 0x00000100
#define PWR_PUCRA_PA8                PWR_PUCRA_PA8_Msk                         //--- Port PA8 Pull-Up set
#define PWR_PUCRA_PA7_Pos            (7U)
#define PWR_PUCRA_PA7_Msk            (0x1UL << PWR_PUCRA_PA7_Pos)              //--- 0x00000080
#define PWR_PUCRA_PA7                PWR_PUCRA_PA7_Msk                         //--- Port PA7 Pull-Up set
#define PWR_PUCRA_PA6_Pos            (6U)
#define PWR_PUCRA_PA6_Msk            (0x1UL << PWR_PUCRA_PA6_Pos)              //--- 0x00000040
#define PWR_PUCRA_PA6                PWR_PUCRA_PA6_Msk                         //--- Port PA6 Pull-Up set
#define PWR_PUCRA_PA5_Pos            (5U)
#define PWR_PUCRA_PA5_Msk            (0x1UL << PWR_PUCRA_PA5_Pos)              //--- 0x00000020
#define PWR_PUCRA_PA5                PWR_PUCRA_PA5_Msk                         //--- Port PA5 Pull-Up set
#define PWR_PUCRA_PA4_Pos            (4U)
#define PWR_PUCRA_PA4_Msk            (0x1UL << PWR_PUCRA_PA4_Pos)              //--- 0x00000010
#define PWR_PUCRA_PA4                PWR_PUCRA_PA4_Msk                         //--- Port PA4 Pull-Up set
#define PWR_PUCRA_PA3_Pos            (3U)
#define PWR_PUCRA_PA3_Msk            (0x1UL << PWR_PUCRA_PA3_Pos)              //--- 0x00000008
#define PWR_PUCRA_PA3                PWR_PUCRA_PA3_Msk                         //--- Port PA3 Pull-Up set
#define PWR_PUCRA_PA2_Pos            (2U)
#define PWR_PUCRA_PA2_Msk            (0x1UL << PWR_PUCRA_PA2_Pos)              //--- 0x00000004
#define PWR_PUCRA_PA2                PWR_PUCRA_PA2_Msk                         //--- Port PA2 Pull-Up set
#define PWR_PUCRA_PA1_Pos            (1U)
#define PWR_PUCRA_PA1_Msk            (0x1UL << PWR_PUCRA_PA1_Pos)              //--- 0x00000002
#define PWR_PUCRA_PA1                PWR_PUCRA_PA1_Msk                         //--- Port PA1 Pull-Up set
#define PWR_PUCRA_PA0_Pos            (0U)
#define PWR_PUCRA_PA0_Msk            (0x1UL << PWR_PUCRA_PA0_Pos)              //--- 0x00000001
#define PWR_PUCRA_PA0                PWR_PUCRA_PA0_Msk                         //--- Port PA0 Pull-Up set

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PDCRA register
//---------------------------------------------------------------------------------------------
#define PWR_PDCRA_PA14_Pos           (14U)
#define PWR_PDCRA_PA14_Msk           (0x1UL << PWR_PDCRA_PA14_Pos)             //--- 0x00004000
#define PWR_PDCRA_PA14               PWR_PDCRA_PA14_Msk                        //--- Port PA14 Pull-Down set
#define PWR_PDCRA_PA12_Pos           (12U)
#define PWR_PDCRA_PA12_Msk           (0x1UL << PWR_PDCRA_PA12_Pos)             //--- 0x00001000
#define PWR_PDCRA_PA12               PWR_PDCRA_PA12_Msk                        //--- Port PA12 Pull-Down set
#define PWR_PDCRA_PA11_Pos           (11U)
#define PWR_PDCRA_PA11_Msk           (0x1UL << PWR_PDCRA_PA11_Pos)             //--- 0x00000800
#define PWR_PDCRA_PA11               PWR_PDCRA_PA11_Msk                        //--- Port PA11 Pull-Down set
#define PWR_PDCRA_PA10_Pos           (10U)
#define PWR_PDCRA_PA10_Msk           (0x1UL << PWR_PDCRA_PA10_Pos)             //--- 0x00000400
#define PWR_PDCRA_PA10               PWR_PDCRA_PA10_Msk                        //--- Port PA10 Pull-Down set
#define PWR_PDCRA_PA9_Pos            (9U)
#define PWR_PDCRA_PA9_Msk            (0x1UL << PWR_PDCRA_PA9_Pos)              //--- 0x00000200
#define PWR_PDCRA_PA9                PWR_PDCRA_PA9_Msk                         //--- Port PA9 Pull-Down set
#define PWR_PDCRA_PA8_Pos            (8U)
#define PWR_PDCRA_PA8_Msk            (0x1UL << PWR_PDCRA_PA8_Pos)              //--- 0x00000100
#define PWR_PDCRA_PA8                PWR_PDCRA_PA8_Msk                         //--- Port PA8 Pull-Down set
#define PWR_PDCRA_PA7_Pos            (7U)
#define PWR_PDCRA_PA7_Msk            (0x1UL << PWR_PDCRA_PA7_Pos)              //--- 0x00000080
#define PWR_PDCRA_PA7                PWR_PDCRA_PA7_Msk                         //--- Port PA7 Pull-Down set
#define PWR_PDCRA_PA6_Pos            (6U)
#define PWR_PDCRA_PA6_Msk            (0x1UL << PWR_PDCRA_PA6_Pos)              //--- 0x00000040
#define PWR_PDCRA_PA6                PWR_PDCRA_PA6_Msk                         //--- Port PA6 Pull-Down set
#define PWR_PDCRA_PA5_Pos            (5U)
#define PWR_PDCRA_PA5_Msk            (0x1UL << PWR_PDCRA_PA5_Pos)              //--- 0x00000020
#define PWR_PDCRA_PA5                PWR_PDCRA_PA5_Msk                         //--- Port PA5 Pull-Down set
#define PWR_PDCRA_PA4_Pos            (4U)
#define PWR_PDCRA_PA4_Msk            (0x1UL << PWR_PDCRA_PA4_Pos)              //--- 0x00000010
#define PWR_PDCRA_PA4                PWR_PDCRA_PA4_Msk                         //--- Port PA4 Pull-Down set
#define PWR_PDCRA_PA3_Pos            (3U)
#define PWR_PDCRA_PA3_Msk            (0x1UL << PWR_PDCRA_PA3_Pos)              //--- 0x00000008
#define PWR_PDCRA_PA3                PWR_PDCRA_PA3_Msk                         //--- Port PA3 Pull-Down set
#define PWR_PDCRA_PA2_Pos            (2U)
#define PWR_PDCRA_PA2_Msk            (0x1UL << PWR_PDCRA_PA2_Pos)              //--- 0x00000004
#define PWR_PDCRA_PA2                PWR_PDCRA_PA2_Msk                         //--- Port PA2 Pull-Down set
#define PWR_PDCRA_PA1_Pos            (1U)
#define PWR_PDCRA_PA1_Msk            (0x1UL << PWR_PDCRA_PA1_Pos)              //--- 0x00000002
#define PWR_PDCRA_PA1                PWR_PDCRA_PA1_Msk                         //--- Port PA1 Pull-Down set
#define PWR_PDCRA_PA0_Pos            (0U)
#define PWR_PDCRA_PA0_Msk            (0x1UL << PWR_PDCRA_PA0_Pos)              //--- 0x00000001
#define PWR_PDCRA_PA0                PWR_PDCRA_PA0_Msk                         //--- Port PA0 Pull-Down set

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PUCRB register
//---------------------------------------------------------------------------------------------
#define PWR_PUCRB_PB7_Pos            (7U)
#define PWR_PUCRB_PB7_Msk            (0x1UL << PWR_PUCRB_PB7_Pos)              //--- 0x00000080
#define PWR_PUCRB_PB7                PWR_PUCRB_PB7_Msk                         //--- Port PB7 Pull-Up set
#define PWR_PUCRB_PB6_Pos            (6U)
#define PWR_PUCRB_PB6_Msk            (0x1UL << PWR_PUCRB_PB6_Pos)              //--- 0x00000040
#define PWR_PUCRB_PB6                PWR_PUCRB_PB6_Msk                         //--- Port PB6 Pull-Up set
#define PWR_PUCRB_PB5_Pos            (5U)
#define PWR_PUCRB_PB5_Msk            (0x1UL << PWR_PUCRB_PB5_Pos)              //--- 0x00000020
#define PWR_PUCRB_PB5                PWR_PUCRB_PB5_Msk                         //--- Port PB5 Pull-Up set
#define PWR_PUCRB_PB4_Pos            (4U)
#define PWR_PUCRB_PB4_Msk            (0x1UL << PWR_PUCRB_PB4_Pos)              //--- 0x00000010
#define PWR_PUCRB_PB4                PWR_PUCRB_PB4_Msk                         //--- Port PB4 Pull-Up set
#define PWR_PUCRB_PB3_Pos            (3U)
#define PWR_PUCRB_PB3_Msk            (0x1UL << PWR_PUCRB_PB3_Pos)              //--- 0x00000008
#define PWR_PUCRB_PB3                PWR_PUCRB_PB3_Msk                         //--- Port PB3 Pull-Up set
#define PWR_PUCRB_PB1_Pos            (1U)
#define PWR_PUCRB_PB1_Msk            (0x1UL << PWR_PUCRB_PB1_Pos)              //--- 0x00000002
#define PWR_PUCRB_PB1                PWR_PUCRB_PB1_Msk                         //--- Port PB1 Pull-Up set
#define PWR_PUCRB_PB0_Pos            (0U)
#define PWR_PUCRB_PB0_Msk            (0x1UL << PWR_PUCRB_PB0_Pos)              //--- 0x00000001
#define PWR_PUCRB_PB0                PWR_PUCRB_PB0_Msk                         //--- Port PB0 Pull-Up set

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PDCRB register
//---------------------------------------------------------------------------------------------
#define PWR_PDCRB_PB7_Pos            (7U)
#define PWR_PDCRB_PB7_Msk            (0x1UL << PWR_PDCRB_PB7_Pos)              //--- 0x00000080
#define PWR_PDCRB_PB7                PWR_PDCRB_PB7_Msk                         //--- Port PB7 Pull-Down set
#define PWR_PDCRB_PB6_Pos            (6U)
#define PWR_PDCRB_PB6_Msk            (0x1UL << PWR_PDCRB_PB6_Pos)              //--- 0x00000040
#define PWR_PDCRB_PB6                PWR_PDCRB_PB6_Msk                         //--- Port PB6 Pull-Down set
#define PWR_PDCRB_PB5_Pos            (5U)
#define PWR_PDCRB_PB5_Msk            (0x1UL << PWR_PDCRB_PB5_Pos)              //--- 0x00000020
#define PWR_PDCRB_PB5                PWR_PDCRB_PB5_Msk                         //--- Port PB5 Pull-Down set
#define PWR_PDCRB_PB3_Pos            (3U)
#define PWR_PDCRB_PB3_Msk            (0x1UL << PWR_PDCRB_PB3_Pos)              //--- 0x00000008
#define PWR_PDCRB_PB3                PWR_PDCRB_PB3_Msk                         //--- Port PB3 Pull-Down set
#define PWR_PDCRB_PB1_Pos            (1U)
#define PWR_PDCRB_PB1_Msk            (0x1UL << PWR_PDCRB_PB1_Pos)              //--- 0x00000002
#define PWR_PDCRB_PB1                PWR_PDCRB_PB1_Msk                         //--- Port PB1 Pull-Down set
#define PWR_PDCRB_PB0_Pos            (0U)
#define PWR_PDCRB_PB0_Msk            (0x1UL << PWR_PDCRB_PB0_Pos)              //--- 0x00000001
#define PWR_PDCRB_PB0                PWR_PDCRB_PB0_Msk                         //--- Port PB0 Pull-Down set

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PUCRC register
//---------------------------------------------------------------------------------------------
#define PWR_PUCRC_PC15_Pos           (15U)
#define PWR_PUCRC_PC15_Msk           (0x1UL << PWR_PUCRC_PC15_Pos)             //--- 0x00008000
#define PWR_PUCRC_PC15               PWR_PUCRC_PC15_Msk                        //--- Port PC15 Pull-Up set
#define PWR_PUCRC_PC14_Pos           (14U)
#define PWR_PUCRC_PC14_Msk           (0x1UL << PWR_PUCRC_PC14_Pos)             //--- 0x00004000
#define PWR_PUCRC_PC14               PWR_PUCRC_PC14_Msk                        //--- Port PC14 Pull-Up set

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PDCRC register
//---------------------------------------------------------------------------------------------
#define PWR_PDCRC_PC15_Pos           (15U)
#define PWR_PDCRC_PC15_Msk           (0x1UL << PWR_PDCRC_PC15_Pos)             //--- 0x00008000
#define PWR_PDCRC_PC15               PWR_PDCRC_PC15_Msk                        //--- Port PC15 Pull-Down set
#define PWR_PDCRC_PC14_Pos           (14U)
#define PWR_PDCRC_PC14_Msk           (0x1UL << PWR_PDCRC_PC14_Pos)             //--- 0x00004000
#define PWR_PDCRC_PC14               PWR_PDCRC_PC14_Msk                        //--- Port PC14 Pull-Down set




//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PUCRH register
//---------------------------------------------------------------------------------------------
#define PWR_PUCRH_PH3_Pos            (3U)
#define PWR_PUCRH_PH3_Msk            (0x1UL << PWR_PUCRH_PH3_Pos)              //--- 0x00000008
#define PWR_PUCRH_PH3                PWR_PUCRH_PH3_Msk                         //--- Port PH3 Pull-Up set

//---------------------------------------------------------------------------------------------
//--- Bit definition for PWR_PDCRH register
//---------------------------------------------------------------------------------------------
#define PWR_PDCRH_PH3_Pos            (3U)
#define PWR_PDCRH_PH3_Msk            (0x1UL << PWR_PDCRH_PH3_Pos)              //--- 0x00000008
#define PWR_PDCRH_PH3                PWR_PDCRH_PH3_Msk                         //--- Port PH3 Pull-Down set


//---------------------------------------------------------------------------------------------
//---                          Reset and Clock Control
//---------------------------------------------------------------------------------------------
#define RCC_PLLSAI1_SUPPORT
#define RCC_PLLP_SUPPORT
#define RCC_HSI48_SUPPORT
#define RCC_PLLP_DIV_2_31_SUPPORT
#define RCC_PLLSAI1P_DIV_2_31_SUPPORT

//---------------------------------------------------------------------------------------------
//--- Bit definition for RCC_CR register
//---------------------------------------------------------------------------------------------
#define RCC_CR_MSION_Pos                     (0U)
#define RCC_CR_MSION_Msk                     (0x1UL << RCC_CR_MSION_Pos)       //--- 0x00000001
#define RCC_CR_MSION                         RCC_CR_MSION_Msk                  //--- Internal Multi Speed oscillator (MSI) clock enable
#define RCC_CR_MSIRDY_Pos                    (1U)
#define RCC_CR_MSIRDY_Msk                    (0x1UL << RCC_CR_MSIRDY_Pos)      //--- 0x00000002
#define RCC_CR_MSIRDY                        RCC_CR_MSIRDY_Msk                 //--- Internal Multi Speed oscillator (MSI) clock ready flag
#define RCC_CR_MSIPLLEN_Pos                  (2U)
#define RCC_CR_MSIPLLEN_Msk                  (0x1UL << RCC_CR_MSIPLLEN_Pos)    //--- 0x00000004
#define RCC_CR_MSIPLLEN                      RCC_CR_MSIPLLEN_Msk               //--- Internal Multi Speed oscillator (MSI) PLL enable
#define RCC_CR_MSIRGSEL_Pos                  (3U)
#define RCC_CR_MSIRGSEL_Msk                  (0x1UL << RCC_CR_MSIRGSEL_Pos)    //--- 0x00000008
#define RCC_CR_MSIRGSEL                      RCC_CR_MSIRGSEL_Msk               //--- Internal Multi Speed oscillator (MSI) range selection

//---------------------------------------------------------------------------------------------
//--- MSIRANGE configuration : 12 frequency ranges available
//---------------------------------------------------------------------------------------------
#define RCC_CR_MSIRANGE_Pos                  (4U)
#define RCC_CR_MSIRANGE_Msk                  (0xFUL << RCC_CR_MSIRANGE_Pos)    //--- 0x000000F0
#define RCC_CR_MSIRANGE                      RCC_CR_MSIRANGE_Msk               //--- Internal Multi Speed oscillator (MSI) clock Range
#define RCC_CR_MSIRANGE_0                    (0x0UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000000
#define RCC_CR_MSIRANGE_1                    (0x1UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000010
#define RCC_CR_MSIRANGE_2                    (0x2UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000020
#define RCC_CR_MSIRANGE_3                    (0x3UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000030
#define RCC_CR_MSIRANGE_4                    (0x4UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000040
#define RCC_CR_MSIRANGE_5                    (0x5UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000050
#define RCC_CR_MSIRANGE_6                    (0x6UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000060
#define RCC_CR_MSIRANGE_7                    (0x7UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000070
#define RCC_CR_MSIRANGE_8                    (0x8UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000080
#define RCC_CR_MSIRANGE_9                    (0x9UL << RCC_CR_MSIRANGE_Pos)    //--- 0x00000090
#define RCC_CR_MSIRANGE_10                   (0xAUL << RCC_CR_MSIRANGE_Pos)    //--- 0x000000A0
#define RCC_CR_MSIRANGE_11                   (0xBUL << RCC_CR_MSIRANGE_Pos)    //--- 0x000000B0

#define RCC_CR_HSION_Pos                     (8U)
#define RCC_CR_HSION_Msk                     (0x1UL << RCC_CR_HSION_Pos)       //--- 0x00000100
#define RCC_CR_HSION                         RCC_CR_HSION_Msk                  //--- Internal High Speed oscillator (HSI16) clock enable
#define RCC_CR_HSIKERON_Pos                  (9U)
#define RCC_CR_HSIKERON_Msk                  (0x1UL << RCC_CR_HSIKERON_Pos)    //--- 0x00000200
#define RCC_CR_HSIKERON                      RCC_CR_HSIKERON_Msk               //--- Internal High Speed oscillator (HSI16) clock enable for some IPs Kernel
#define RCC_CR_HSIRDY_Pos                    (10U)
#define RCC_CR_HSIRDY_Msk                    (0x1UL << RCC_CR_HSIRDY_Pos)      //--- 0x00000400
#define RCC_CR_HSIRDY                        RCC_CR_HSIRDY_Msk                 //--- Internal High Speed oscillator (HSI16) clock ready flag
#define RCC_CR_HSIASFS_Pos                   (11U)
#define RCC_CR_HSIASFS_Msk                   (0x1UL << RCC_CR_HSIASFS_Pos)     //--- 0x00000800
#define RCC_CR_HSIASFS                       RCC_CR_HSIASFS_Msk                //--- HSI16 Automatic Start from Stop

