Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define RCC_CR_HSEON_Pos                     (16U)
#define RCC_CR_HSEON_Msk                     (0x1UL << RCC_CR_HSEON_Pos)       //--- 0x00010000
#define RCC_CR_HSEON                         RCC_CR_HSEON_Msk                  //--- External High Speed oscillator (HSE) clock enable
#define RCC_CR_HSERDY_Pos                    (17U)
#define RCC_CR_HSERDY_Msk                    (0x1UL << RCC_CR_HSERDY_Pos)      //--- 0x00020000
#define RCC_CR_HSERDY                        RCC_CR_HSERDY_Msk                 //--- External High Speed oscillator (HSE) clock ready
#define RCC_CR_HSEBYP_Pos                    (18U)
#define RCC_CR_HSEBYP_Msk                    (0x1UL << RCC_CR_HSEBYP_Pos)      //--- 0x00040000
#define RCC_CR_HSEBYP                        RCC_CR_HSEBYP_Msk                 //--- External High Speed oscillator (HSE) clock bypass
#define RCC_CR_CSSON_Pos                     (19U)
#define RCC_CR_CSSON_Msk                     (0x1UL << RCC_CR_CSSON_Pos)       //--- 0x00080000
#define RCC_CR_CSSON                         RCC_CR_CSSON_Msk                  //--- HSE Clock Security System enable

#define RCC_CR_PLLON_Pos                     (24U)
#define RCC_CR_PLLON_Msk                     (0x1UL << RCC_CR_PLLON_Pos)       //--- 0x01000000
#define RCC_CR_PLLON                         RCC_CR_PLLON_Msk                  //--- System PLL clock enable
#define RCC_CR_PLLRDY_Pos                    (25U)
#define RCC_CR_PLLRDY_Msk                    (0x1UL << RCC_CR_PLLRDY_Pos)      //--- 0x02000000
#define RCC_CR_PLLRDY                        RCC_CR_PLLRDY_Msk                 //--- System PLL clock ready
#define RCC_CR_PLLSAI1ON_Pos                 (26U)
#define RCC_CR_PLLSAI1ON_Msk                 (0x1UL << RCC_CR_PLLSAI1ON_Pos)   //--- 0x04000000
#define RCC_CR_PLLSAI1ON                     RCC_CR_PLLSAI1ON_Msk              //--- SAI1 PLL enable
#define RCC_CR_PLLSAI1RDY_Pos                (27U)
#define RCC_CR_PLLSAI1RDY_Msk                (0x1UL << RCC_CR_PLLSAI1RDY_Pos)  //--- 0x08000000
#define RCC_CR_PLLSAI1RDY                    RCC_CR_PLLSAI1RDY_Msk             //--- SAI1 PLL ready

//---------------------------------------------------------------------------------------------
//--- Bit definition for RCC_ICSCR register
//--- MSICAL configuration
//---------------------------------------------------------------------------------------------
#define RCC_ICSCR_MSICAL_Pos                 (0U)
#define RCC_ICSCR_MSICAL_Msk                 (0xFFUL << RCC_ICSCR_MSICAL_Pos)  //--- 0x000000FF
#define RCC_ICSCR_MSICAL                     RCC_ICSCR_MSICAL_Msk              //--- MSICAL[7:0] bits
#define RCC_ICSCR_MSICAL_0                   (0x01UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000001
#define RCC_ICSCR_MSICAL_1                   (0x02UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000002
#define RCC_ICSCR_MSICAL_2                   (0x04UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000004
#define RCC_ICSCR_MSICAL_3                   (0x08UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000008
#define RCC_ICSCR_MSICAL_4                   (0x10UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000010
#define RCC_ICSCR_MSICAL_5                   (0x20UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000020
#define RCC_ICSCR_MSICAL_6                   (0x40UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000040
#define RCC_ICSCR_MSICAL_7                   (0x80UL << RCC_ICSCR_MSICAL_Pos)  //--- 0x00000080

//---------------------------------------------------------------------------------------------
//--- MSITRIM configuration
//---------------------------------------------------------------------------------------------
#define RCC_ICSCR_MSITRIM_Pos                (8U)
#define RCC_ICSCR_MSITRIM_Msk                (0xFFUL << RCC_ICSCR_MSITRIM_Pos) //--- 0x0000FF00
#define RCC_ICSCR_MSITRIM                    RCC_ICSCR_MSITRIM_Msk             //--- MSITRIM[7:0] bits
#define RCC_ICSCR_MSITRIM_0                  (0x01UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00000100
#define RCC_ICSCR_MSITRIM_1                  (0x02UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00000200
#define RCC_ICSCR_MSITRIM_2                  (0x04UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00000400
#define RCC_ICSCR_MSITRIM_3                  (0x08UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00000800
#define RCC_ICSCR_MSITRIM_4                  (0x10UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00001000
#define RCC_ICSCR_MSITRIM_5                  (0x20UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00002000
#define RCC_ICSCR_MSITRIM_6                  (0x40UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00004000
#define RCC_ICSCR_MSITRIM_7                  (0x80UL << RCC_ICSCR_MSITRIM_Pos) //--- 0x00008000

//---------------------------------------------------------------------------------------------
//--- HSICAL configuration
//---------------------------------------------------------------------------------------------
#define RCC_ICSCR_HSICAL_Pos                 (16U)
#define RCC_ICSCR_HSICAL_Msk                 (0xFFUL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00FF0000
#define RCC_ICSCR_HSICAL                     RCC_ICSCR_HSICAL_Msk              //--- HSICAL[7:0] bits
#define RCC_ICSCR_HSICAL_0                   (0x01UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00010000
#define RCC_ICSCR_HSICAL_1                   (0x02UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00020000
#define RCC_ICSCR_HSICAL_2                   (0x04UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00040000
#define RCC_ICSCR_HSICAL_3                   (0x08UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00080000
#define RCC_ICSCR_HSICAL_4                   (0x10UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00100000
#define RCC_ICSCR_HSICAL_5                   (0x20UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00200000
#define RCC_ICSCR_HSICAL_6                   (0x40UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00400000
#define RCC_ICSCR_HSICAL_7                   (0x80UL << RCC_ICSCR_HSICAL_Pos)  //--- 0x00800000

//---------------------------------------------------------------------------------------------
//--- HSITRIM configuration
//---------------------------------------------------------------------------------------------
#define RCC_ICSCR_HSITRIM_Pos                (24U)
#define RCC_ICSCR_HSITRIM_Msk                (0x1FUL << RCC_ICSCR_HSITRIM_Pos) //--- 0x1F000000
#define RCC_ICSCR_HSITRIM                    RCC_ICSCR_HSITRIM_Msk             //--- HSITRIM[4:0] bits
#define RCC_ICSCR_HSITRIM_0                  (0x01UL << RCC_ICSCR_HSITRIM_Pos) //--- 0x01000000
#define RCC_ICSCR_HSITRIM_1                  (0x02UL << RCC_ICSCR_HSITRIM_Pos) //--- 0x02000000
#define RCC_ICSCR_HSITRIM_2                  (0x04UL << RCC_ICSCR_HSITRIM_Pos) //--- 0x04000000
#define RCC_ICSCR_HSITRIM_3                  (0x08UL << RCC_ICSCR_HSITRIM_Pos) //--- 0x08000000
#define RCC_ICSCR_HSITRIM_4                  (0x10UL << RCC_ICSCR_HSITRIM_Pos) //--- 0x10000000

//---------------------------------------------------------------------------------------------
//--- Bit definition for RCC_CFGR register
//--- SW configuration
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_SW_Pos                      (0U)
#define RCC_CFGR_SW_Msk                      (0x3UL << RCC_CFGR_SW_Pos)        //--- 0x00000003
#define RCC_CFGR_SW                          RCC_CFGR_SW_Msk                   //--- SW[1:0] bits (System clock Switch)
#define RCC_CFGR_SW_0                        (0x1UL << RCC_CFGR_SW_Pos)        //--- 0x00000001
#define RCC_CFGR_SW_1                        (0x2UL << RCC_CFGR_SW_Pos)        //--- 0x00000002

#define RCC_CFGR_SW_MSI                      (0x00000000UL)                    //--- MSI oscillator selection as system clock
#define RCC_CFGR_SW_HSI                      (0x00000001UL)                    //--- HSI16 oscillator selection as system clock
#define RCC_CFGR_SW_HSE                      (0x00000002UL)                    //--- HSE oscillator selection as system clock
#define RCC_CFGR_SW_PLL                      (0x00000003UL)                    //--- PLL selection as system clock

//---------------------------------------------------------------------------------------------
//--- SWS configuration
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_SWS_Pos                     (2U)
#define RCC_CFGR_SWS_Msk                     (0x3UL << RCC_CFGR_SWS_Pos)       //--- 0x0000000C
#define RCC_CFGR_SWS                         RCC_CFGR_SWS_Msk                  //--- SWS[1:0] bits (System Clock Switch Status)
#define RCC_CFGR_SWS_0                       (0x1UL << RCC_CFGR_SWS_Pos)       //--- 0x00000004
#define RCC_CFGR_SWS_1                       (0x2UL << RCC_CFGR_SWS_Pos)       //--- 0x00000008

