Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define RCC_CFGR_SWS_MSI                     (0x00000000UL)                    //--- MSI oscillator used as system clock
#define RCC_CFGR_SWS_HSI                     (0x00000004UL)                    //--- HSI16 oscillator used as system clock
#define RCC_CFGR_SWS_HSE                     (0x00000008UL)                    //--- HSE oscillator used as system clock
#define RCC_CFGR_SWS_PLL                     (0x0000000CUL)                    //--- PLL used as system clock

//---------------------------------------------------------------------------------------------
//--- HPRE configuration
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_HPRE_Pos                    (4U)
#define RCC_CFGR_HPRE_Msk                    (0xFUL << RCC_CFGR_HPRE_Pos)      //--- 0x000000F0
#define RCC_CFGR_HPRE                        RCC_CFGR_HPRE_Msk                 //--- HPRE[3:0] bits (AHB prescaler)
#define RCC_CFGR_HPRE_0                      (0x1UL << RCC_CFGR_HPRE_Pos)      //--- 0x00000010
#define RCC_CFGR_HPRE_1                      (0x2UL << RCC_CFGR_HPRE_Pos)      //--- 0x00000020
#define RCC_CFGR_HPRE_2                      (0x4UL << RCC_CFGR_HPRE_Pos)      //--- 0x00000040
#define RCC_CFGR_HPRE_3                      (0x8UL << RCC_CFGR_HPRE_Pos)      //--- 0x00000080

#define RCC_CFGR_HPRE_DIV1                   (0x00000000UL)                    //--- SYSCLK not divided
#define RCC_CFGR_HPRE_DIV2                   (0x00000080UL)                    //--- SYSCLK divided by 2
#define RCC_CFGR_HPRE_DIV4                   (0x00000090UL)                    //--- SYSCLK divided by 4
#define RCC_CFGR_HPRE_DIV8                   (0x000000A0UL)                    //--- SYSCLK divided by 8
#define RCC_CFGR_HPRE_DIV16                  (0x000000B0UL)                    //--- SYSCLK divided by 16
#define RCC_CFGR_HPRE_DIV64                  (0x000000C0UL)                    //--- SYSCLK divided by 64
#define RCC_CFGR_HPRE_DIV128                 (0x000000D0UL)                    //--- SYSCLK divided by 128
#define RCC_CFGR_HPRE_DIV256                 (0x000000E0UL)                    //--- SYSCLK divided by 256
#define RCC_CFGR_HPRE_DIV512                 (0x000000F0UL)                    //--- SYSCLK divided by 512

//---------------------------------------------------------------------------------------------
//--- PPRE1 configuration
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_PPRE1_Pos                   (8U)
#define RCC_CFGR_PPRE1_Msk                   (0x7UL << RCC_CFGR_PPRE1_Pos)     //--- 0x00000700
#define RCC_CFGR_PPRE1                       RCC_CFGR_PPRE1_Msk                //--- PRE1[2:0] bits (APB2 prescaler)
#define RCC_CFGR_PPRE1_0                     (0x1UL << RCC_CFGR_PPRE1_Pos)     //--- 0x00000100
#define RCC_CFGR_PPRE1_1                     (0x2UL << RCC_CFGR_PPRE1_Pos)     //--- 0x00000200
#define RCC_CFGR_PPRE1_2                     (0x4UL << RCC_CFGR_PPRE1_Pos)     //--- 0x00000400

#define RCC_CFGR_PPRE1_DIV1                  (0x00000000UL)                    //--- HCLK not divided
#define RCC_CFGR_PPRE1_DIV2                  (0x00000400UL)                    //--- HCLK divided by 2
#define RCC_CFGR_PPRE1_DIV4                  (0x00000500UL)                    //--- HCLK divided by 4
#define RCC_CFGR_PPRE1_DIV8                  (0x00000600UL)                    //--- HCLK divided by 8
#define RCC_CFGR_PPRE1_DIV16                 (0x00000700UL)                    //--- HCLK divided by 16

//---------------------------------------------------------------------------------------------
//--- PPRE2 configuration
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_PPRE2_Pos                   (11U)
#define RCC_CFGR_PPRE2_Msk                   (0x7UL << RCC_CFGR_PPRE2_Pos)     //--- 0x00003800
#define RCC_CFGR_PPRE2                       RCC_CFGR_PPRE2_Msk                //--- PRE2[2:0] bits (APB2 prescaler)
#define RCC_CFGR_PPRE2_0                     (0x1UL << RCC_CFGR_PPRE2_Pos)     //--- 0x00000800
#define RCC_CFGR_PPRE2_1                     (0x2UL << RCC_CFGR_PPRE2_Pos)     //--- 0x00001000
#define RCC_CFGR_PPRE2_2                     (0x4UL << RCC_CFGR_PPRE2_Pos)     //--- 0x00002000

#define RCC_CFGR_PPRE2_DIV1                  (0x00000000UL)                    //--- HCLK not divided
#define RCC_CFGR_PPRE2_DIV2                  (0x00002000UL)                    //--- HCLK divided by 2
#define RCC_CFGR_PPRE2_DIV4                  (0x00002800UL)                    //--- HCLK divided by 4
#define RCC_CFGR_PPRE2_DIV8                  (0x00003000UL)                    //--- HCLK divided by 8
#define RCC_CFGR_PPRE2_DIV16                 (0x00003800UL)                    //--- HCLK divided by 16

#define RCC_CFGR_STOPWUCK_Pos                (15U)
#define RCC_CFGR_STOPWUCK_Msk                (0x1UL << RCC_CFGR_STOPWUCK_Pos)  //--- 0x00008000
#define RCC_CFGR_STOPWUCK                    RCC_CFGR_STOPWUCK_Msk             //--- Wake Up from stop and CSS backup clock selection

//---------------------------------------------------------------------------------------------
//--- MCOSEL configuration
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_MCOSEL_Pos                  (24U)
#define RCC_CFGR_MCOSEL_Msk                  (0xFUL << RCC_CFGR_MCOSEL_Pos)    //--- 0x0F000000
#define RCC_CFGR_MCOSEL                      RCC_CFGR_MCOSEL_Msk               //--- MCOSEL [3:0] bits (Clock output selection)
#define RCC_CFGR_MCOSEL_0                    (0x1UL << RCC_CFGR_MCOSEL_Pos)    //--- 0x01000000
#define RCC_CFGR_MCOSEL_1                    (0x2UL << RCC_CFGR_MCOSEL_Pos)    //--- 0x02000000
#define RCC_CFGR_MCOSEL_2                    (0x4UL << RCC_CFGR_MCOSEL_Pos)    //--- 0x04000000
#define RCC_CFGR_MCOSEL_3                    (0x8UL << RCC_CFGR_MCOSEL_Pos)    //--- 0x08000000

#define RCC_CFGR_MCOPRE_Pos                  (28U)
#define RCC_CFGR_MCOPRE_Msk                  (0x7UL << RCC_CFGR_MCOPRE_Pos)    //--- 0x70000000
#define RCC_CFGR_MCOPRE                      RCC_CFGR_MCOPRE_Msk               //--- MCO prescaler
#define RCC_CFGR_MCOPRE_0                    (0x1UL << RCC_CFGR_MCOPRE_Pos)    //--- 0x10000000
#define RCC_CFGR_MCOPRE_1                    (0x2UL << RCC_CFGR_MCOPRE_Pos)    //--- 0x20000000
#define RCC_CFGR_MCOPRE_2                    (0x4UL << RCC_CFGR_MCOPRE_Pos)    //--- 0x40000000

#define RCC_CFGR_MCOPRE_DIV1                 (0x00000000UL)                    //--- MCO is divided by 1
#define RCC_CFGR_MCOPRE_DIV2                 (0x10000000UL)                    //--- MCO is divided by 2
#define RCC_CFGR_MCOPRE_DIV4                 (0x20000000UL)                    //--- MCO is divided by 4
#define RCC_CFGR_MCOPRE_DIV8                 (0x30000000UL)                    //--- MCO is divided by 8
#define RCC_CFGR_MCOPRE_DIV16                (0x40000000UL)                    //--- MCO is divided by 16

//---------------------------------------------------------------------------------------------
//---  Legacy aliases
//---------------------------------------------------------------------------------------------
#define RCC_CFGR_MCO_PRE                     RCC_CFGR_MCOPRE
#define RCC_CFGR_MCO_PRE_1                   RCC_CFGR_MCOPRE_DIV1
#define RCC_CFGR_MCO_PRE_2                   RCC_CFGR_MCOPRE_DIV2
#define RCC_CFGR_MCO_PRE_4                   RCC_CFGR_MCOPRE_DIV4
#define RCC_CFGR_MCO_PRE_8                   RCC_CFGR_MCOPRE_DIV8
#define RCC_CFGR_MCO_PRE_16                  RCC_CFGR_MCOPRE_DIV16

//---------------------------------------------------------------------------------------------
//--- Bit definition for RCC_PLLCFGR register
//---------------------------------------------------------------------------------------------
#define RCC_PLLCFGR_PLLSRC_Pos               (0U)
#define RCC_PLLCFGR_PLLSRC_Msk               (0x3UL << RCC_PLLCFGR_PLLSRC_Pos) //--- 0x00000003
#define RCC_PLLCFGR_PLLSRC                   RCC_PLLCFGR_PLLSRC_Msk

