Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_CAL register
//---------------------------------------------------------------------------------------------
#define RTC_CALR_CALP_Pos              (15U)
#define RTC_CALR_CALP_Msk              (0x1UL << RTC_CALR_CALP_Pos)            //--- 0x00008000
#define RTC_CALR_CALP                  RTC_CALR_CALP_Msk
#define RTC_CALR_CALW8_Pos             (14U)
#define RTC_CALR_CALW8_Msk             (0x1UL << RTC_CALR_CALW8_Pos)           //--- 0x00004000
#define RTC_CALR_CALW8                 RTC_CALR_CALW8_Msk
#define RTC_CALR_CALW16_Pos            (13U)
#define RTC_CALR_CALW16_Msk            (0x1UL << RTC_CALR_CALW16_Pos)          //--- 0x00002000
#define RTC_CALR_CALW16                RTC_CALR_CALW16_Msk
#define RTC_CALR_CALM_Pos              (0U)
#define RTC_CALR_CALM_Msk              (0x1FFUL << RTC_CALR_CALM_Pos)          //--- 0x000001FF
#define RTC_CALR_CALM                  RTC_CALR_CALM_Msk
#define RTC_CALR_CALM_0                (0x001UL << RTC_CALR_CALM_Pos)          //--- 0x00000001
#define RTC_CALR_CALM_1                (0x002UL << RTC_CALR_CALM_Pos)          //--- 0x00000002
#define RTC_CALR_CALM_2                (0x004UL << RTC_CALR_CALM_Pos)          //--- 0x00000004
#define RTC_CALR_CALM_3                (0x008UL << RTC_CALR_CALM_Pos)          //--- 0x00000008
#define RTC_CALR_CALM_4                (0x010UL << RTC_CALR_CALM_Pos)          //--- 0x00000010
#define RTC_CALR_CALM_5                (0x020UL << RTC_CALR_CALM_Pos)          //--- 0x00000020
#define RTC_CALR_CALM_6                (0x040UL << RTC_CALR_CALM_Pos)          //--- 0x00000040
#define RTC_CALR_CALM_7                (0x080UL << RTC_CALR_CALM_Pos)          //--- 0x00000080
#define RTC_CALR_CALM_8                (0x100UL << RTC_CALR_CALM_Pos)          //--- 0x00000100

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_TAMPCR register
//---------------------------------------------------------------------------------------------
#define RTC_TAMPCR_TAMP2MF_Pos         (21U)
#define RTC_TAMPCR_TAMP2MF_Msk         (0x1UL << RTC_TAMPCR_TAMP2MF_Pos)       //--- 0x00200000
#define RTC_TAMPCR_TAMP2MF             RTC_TAMPCR_TAMP2MF_Msk
#define RTC_TAMPCR_TAMP2NOERASE_Pos    (20U)
#define RTC_TAMPCR_TAMP2NOERASE_Msk    (0x1UL << RTC_TAMPCR_TAMP2NOERASE_Pos)  //--- 0x00100000
#define RTC_TAMPCR_TAMP2NOERASE        RTC_TAMPCR_TAMP2NOERASE_Msk
#define RTC_TAMPCR_TAMP2IE_Pos         (19U)
#define RTC_TAMPCR_TAMP2IE_Msk         (0x1UL << RTC_TAMPCR_TAMP2IE_Pos)       //--- 0x00080000
#define RTC_TAMPCR_TAMP2IE             RTC_TAMPCR_TAMP2IE_Msk
#define RTC_TAMPCR_TAMPPUDIS_Pos       (15U)
#define RTC_TAMPCR_TAMPPUDIS_Msk       (0x1UL << RTC_TAMPCR_TAMPPUDIS_Pos)     //--- 0x00008000
#define RTC_TAMPCR_TAMPPUDIS           RTC_TAMPCR_TAMPPUDIS_Msk
#define RTC_TAMPCR_TAMPPRCH_Pos        (13U)
#define RTC_TAMPCR_TAMPPRCH_Msk        (0x3UL << RTC_TAMPCR_TAMPPRCH_Pos)      //--- 0x00006000
#define RTC_TAMPCR_TAMPPRCH            RTC_TAMPCR_TAMPPRCH_Msk
#define RTC_TAMPCR_TAMPPRCH_0          (0x1UL << RTC_TAMPCR_TAMPPRCH_Pos)      //--- 0x00002000
#define RTC_TAMPCR_TAMPPRCH_1          (0x2UL << RTC_TAMPCR_TAMPPRCH_Pos)      //--- 0x00004000
#define RTC_TAMPCR_TAMPFLT_Pos         (11U)
#define RTC_TAMPCR_TAMPFLT_Msk         (0x3UL << RTC_TAMPCR_TAMPFLT_Pos)       //--- 0x00001800
#define RTC_TAMPCR_TAMPFLT             RTC_TAMPCR_TAMPFLT_Msk
#define RTC_TAMPCR_TAMPFLT_0           (0x1UL << RTC_TAMPCR_TAMPFLT_Pos)       //--- 0x00000800
#define RTC_TAMPCR_TAMPFLT_1           (0x2UL << RTC_TAMPCR_TAMPFLT_Pos)       //--- 0x00001000
#define RTC_TAMPCR_TAMPFREQ_Pos        (8U)
#define RTC_TAMPCR_TAMPFREQ_Msk        (0x7UL << RTC_TAMPCR_TAMPFREQ_Pos)      //--- 0x00000700
#define RTC_TAMPCR_TAMPFREQ            RTC_TAMPCR_TAMPFREQ_Msk
#define RTC_TAMPCR_TAMPFREQ_0          (0x1UL << RTC_TAMPCR_TAMPFREQ_Pos)      //--- 0x00000100
#define RTC_TAMPCR_TAMPFREQ_1          (0x2UL << RTC_TAMPCR_TAMPFREQ_Pos)      //--- 0x00000200
#define RTC_TAMPCR_TAMPFREQ_2          (0x4UL << RTC_TAMPCR_TAMPFREQ_Pos)      //--- 0x00000400
#define RTC_TAMPCR_TAMPTS_Pos          (7U)
#define RTC_TAMPCR_TAMPTS_Msk          (0x1UL << RTC_TAMPCR_TAMPTS_Pos)        //--- 0x00000080
#define RTC_TAMPCR_TAMPTS              RTC_TAMPCR_TAMPTS_Msk
#define RTC_TAMPCR_TAMP2TRG_Pos        (4U)
#define RTC_TAMPCR_TAMP2TRG_Msk        (0x1UL << RTC_TAMPCR_TAMP2TRG_Pos)      //--- 0x00000010
#define RTC_TAMPCR_TAMP2TRG            RTC_TAMPCR_TAMP2TRG_Msk
#define RTC_TAMPCR_TAMP2E_Pos          (3U)
#define RTC_TAMPCR_TAMP2E_Msk          (0x1UL << RTC_TAMPCR_TAMP2E_Pos)        //--- 0x00000008
#define RTC_TAMPCR_TAMP2E              RTC_TAMPCR_TAMP2E_Msk
#define RTC_TAMPCR_TAMPIE_Pos          (2U)
#define RTC_TAMPCR_TAMPIE_Msk          (0x1UL << RTC_TAMPCR_TAMPIE_Pos)        //--- 0x00000004
#define RTC_TAMPCR_TAMPIE              RTC_TAMPCR_TAMPIE_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_ALRMASSR register
//---------------------------------------------------------------------------------------------
#define RTC_ALRMASSR_MASKSS_Pos        (24U)
#define RTC_ALRMASSR_MASKSS_Msk        (0xFUL << RTC_ALRMASSR_MASKSS_Pos)      //--- 0x0F000000
#define RTC_ALRMASSR_MASKSS            RTC_ALRMASSR_MASKSS_Msk
#define RTC_ALRMASSR_MASKSS_0          (0x1UL << RTC_ALRMASSR_MASKSS_Pos)      //--- 0x01000000
#define RTC_ALRMASSR_MASKSS_1          (0x2UL << RTC_ALRMASSR_MASKSS_Pos)      //--- 0x02000000
#define RTC_ALRMASSR_MASKSS_2          (0x4UL << RTC_ALRMASSR_MASKSS_Pos)      //--- 0x04000000
#define RTC_ALRMASSR_MASKSS_3          (0x8UL << RTC_ALRMASSR_MASKSS_Pos)      //--- 0x08000000
#define RTC_ALRMASSR_SS_Pos            (0U)
#define RTC_ALRMASSR_SS_Msk            (0x7FFFUL << RTC_ALRMASSR_SS_Pos)       //--- 0x00007FFF
#define RTC_ALRMASSR_SS                RTC_ALRMASSR_SS_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_ALRMBSSR register
//---------------------------------------------------------------------------------------------
#define RTC_ALRMBSSR_MASKSS_Pos        (24U)
#define RTC_ALRMBSSR_MASKSS_Msk        (0xFUL << RTC_ALRMBSSR_MASKSS_Pos)      //--- 0x0F000000
#define RTC_ALRMBSSR_MASKSS            RTC_ALRMBSSR_MASKSS_Msk
#define RTC_ALRMBSSR_MASKSS_0          (0x1UL << RTC_ALRMBSSR_MASKSS_Pos)      //--- 0x01000000
#define RTC_ALRMBSSR_MASKSS_1          (0x2UL << RTC_ALRMBSSR_MASKSS_Pos)      //--- 0x02000000
#define RTC_ALRMBSSR_MASKSS_2          (0x4UL << RTC_ALRMBSSR_MASKSS_Pos)      //--- 0x04000000
#define RTC_ALRMBSSR_MASKSS_3          (0x8UL << RTC_ALRMBSSR_MASKSS_Pos)      //--- 0x08000000
#define RTC_ALRMBSSR_SS_Pos            (0U)
#define RTC_ALRMBSSR_SS_Msk            (0x7FFFUL << RTC_ALRMBSSR_SS_Pos)       //--- 0x00007FFF
#define RTC_ALRMBSSR_SS                RTC_ALRMBSSR_SS_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_0R register
//---------------------------------------------------------------------------------------------
#define RTC_OR_OUT_RMP_Pos             (1U)
#define RTC_OR_OUT_RMP_Msk             (0x1UL << RTC_OR_OUT_RMP_Pos)           //--- 0x00000002
#define RTC_OR_OUT_RMP                 RTC_OR_OUT_RMP_Msk
#define RTC_OR_ALARMOUTTYPE_Pos        (0U)
#define RTC_OR_ALARMOUTTYPE_Msk        (0x1UL << RTC_OR_ALARMOUTTYPE_Pos)      //--- 0x00000001
#define RTC_OR_ALARMOUTTYPE            RTC_OR_ALARMOUTTYPE_Msk


//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP0R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP0R_Pos                  (0U)
#define RTC_BKP0R_Msk                  (0xFFFFFFFFUL << RTC_BKP0R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP0R                      RTC_BKP0R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP1R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP1R_Pos                  (0U)
#define RTC_BKP1R_Msk                  (0xFFFFFFFFUL << RTC_BKP1R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP1R                      RTC_BKP1R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP2R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP2R_Pos                  (0U)
#define RTC_BKP2R_Msk                  (0xFFFFFFFFUL << RTC_BKP2R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP2R                      RTC_BKP2R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP3R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP3R_Pos                  (0U)
#define RTC_BKP3R_Msk                  (0xFFFFFFFFUL << RTC_BKP3R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP3R                      RTC_BKP3R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP4R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP4R_Pos                  (0U)
#define RTC_BKP4R_Msk                  (0xFFFFFFFFUL << RTC_BKP4R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP4R                      RTC_BKP4R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP5R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP5R_Pos                  (0U)
#define RTC_BKP5R_Msk                  (0xFFFFFFFFUL << RTC_BKP5R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP5R                      RTC_BKP5R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP6R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP6R_Pos                  (0U)
#define RTC_BKP6R_Msk                  (0xFFFFFFFFUL << RTC_BKP6R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP6R                      RTC_BKP6R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP7R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP7R_Pos                  (0U)
#define RTC_BKP7R_Msk                  (0xFFFFFFFFUL << RTC_BKP7R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP7R                      RTC_BKP7R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP8R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP8R_Pos                  (0U)
#define RTC_BKP8R_Msk                  (0xFFFFFFFFUL << RTC_BKP8R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP8R                      RTC_BKP8R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP9R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP9R_Pos                  (0U)
#define RTC_BKP9R_Msk                  (0xFFFFFFFFUL << RTC_BKP9R_Pos)         //--- 0xFFFFFFFF
//#define RTC_BKP9R                      RTC_BKP9R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP10R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP10R_Pos                 (0U)
#define RTC_BKP10R_Msk                 (0xFFFFFFFFUL << RTC_BKP10R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP10R                     RTC_BKP10R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP11R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP11R_Pos                 (0U)
#define RTC_BKP11R_Msk                 (0xFFFFFFFFUL << RTC_BKP11R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP11R                     RTC_BKP11R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP12R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP12R_Pos                 (0U)
#define RTC_BKP12R_Msk                 (0xFFFFFFFFUL << RTC_BKP12R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP12R                     RTC_BKP12R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP13R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP13R_Pos                 (0U)
#define RTC_BKP13R_Msk                 (0xFFFFFFFFUL << RTC_BKP13R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP13R                     RTC_BKP13R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP14R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP14R_Pos                 (0U)
#define RTC_BKP14R_Msk                 (0xFFFFFFFFUL << RTC_BKP14R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP14R                     RTC_BKP14R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP15R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP15R_Pos                 (0U)
#define RTC_BKP15R_Msk                 (0xFFFFFFFFUL << RTC_BKP15R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP15R                     RTC_BKP15R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP16R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP16R_Pos                 (0U)
#define RTC_BKP16R_Msk                 (0xFFFFFFFFUL << RTC_BKP16R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP16R                     RTC_BKP16R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP17R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP17R_Pos                 (0U)
#define RTC_BKP17R_Msk                 (0xFFFFFFFFUL << RTC_BKP17R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP17R                     RTC_BKP17R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP18R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP18R_Pos                 (0U)
#define RTC_BKP18R_Msk                 (0xFFFFFFFFUL << RTC_BKP18R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP18R                     RTC_BKP18R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP19R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP19R_Pos                 (0U)
#define RTC_BKP19R_Msk                 (0xFFFFFFFFUL << RTC_BKP19R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP19R                     RTC_BKP19R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP20R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP20R_Pos                 (0U)
#define RTC_BKP20R_Msk                 (0xFFFFFFFFUL << RTC_BKP20R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP20R                     RTC_BKP20R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP21R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP21R_Pos                 (0U)
#define RTC_BKP21R_Msk                 (0xFFFFFFFFUL << RTC_BKP21R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP21R                     RTC_BKP21R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP22R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP22R_Pos                 (0U)
#define RTC_BKP22R_Msk                 (0xFFFFFFFFUL << RTC_BKP22R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP22R                     RTC_BKP22R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP23R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP23R_Pos                 (0U)
#define RTC_BKP23R_Msk                 (0xFFFFFFFFUL << RTC_BKP23R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP23R                     RTC_BKP23R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP24R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP24R_Pos                 (0U)
#define RTC_BKP24R_Msk                 (0xFFFFFFFFUL << RTC_BKP24R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP24R                     RTC_BKP24R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP25R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP25R_Pos                 (0U)
#define RTC_BKP25R_Msk                 (0xFFFFFFFFUL << RTC_BKP25R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP25R                     RTC_BKP25R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP26R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP26R_Pos                 (0U)
#define RTC_BKP26R_Msk                 (0xFFFFFFFFUL << RTC_BKP26R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP26R                     RTC_BKP26R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP27R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP27R_Pos                 (0U)
#define RTC_BKP27R_Msk                 (0xFFFFFFFFUL << RTC_BKP27R_Pos)        //--- 0xFFFFFFFF
#define RTC_BKP27R                     RTC_BKP27R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP28R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP28R_Pos                 (0U)
#define RTC_BKP28R_Msk                 (0xFFFFFFFFUL << RTC_BKP28R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP28R                     RTC_BKP28R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP29R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP29R_Pos                 (0U)
#define RTC_BKP29R_Msk                 (0xFFFFFFFFUL << RTC_BKP29R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP29R                     RTC_BKP29R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP30R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP30R_Pos                 (0U)
#define RTC_BKP30R_Msk                 (0xFFFFFFFFUL << RTC_BKP30R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP30R                     RTC_BKP30R_Msk

//---------------------------------------------------------------------------------------------
//--- Bits definition for RTC_BKP31R register
//---------------------------------------------------------------------------------------------
#define RTC_BKP31R_Pos                 (0U)
#define RTC_BKP31R_Msk                 (0xFFFFFFFFUL << RTC_BKP31R_Pos)        //--- 0xFFFFFFFF
//#define RTC_BKP31R                     RTC_BKP31R_Msk

//---------------------------------------------------------------------------------------------
//---  Number of backup registers
//---------------------------------------------------------------------------------------------
#define RTC_BKP_NUMBER                       32U

//---------------------------------------------------------------------------------------------
//---                           Serial Audio Interface
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//--- Bit definition for SAI_GCR register
//---------------------------------------------------------------------------------------------
#define SAI_GCR_SYNCIN_Pos         (0U)
#define SAI_GCR_SYNCIN_Msk         (0x3UL << SAI_GCR_SYNCIN_Pos)               //--- 0x00000003
#define SAI_GCR_SYNCIN             SAI_GCR_SYNCIN_Msk                          //----SYNCIN[1:0] bits (Synchronization Inputs)
#define SAI_GCR_SYNCIN_0           (0x1UL << SAI_GCR_SYNCIN_Pos)               //--- 0x00000001
#define SAI_GCR_SYNCIN_1           (0x2UL << SAI_GCR_SYNCIN_Pos)               //--- 0x00000002

#define SAI_GCR_SYNCOUT_Pos        (4U)
#define SAI_GCR_SYNCOUT_Msk        (0x3UL << SAI_GCR_SYNCOUT_Pos)              //--- 0x00000030
#define SAI_GCR_SYNCOUT            SAI_GCR_SYNCOUT_Msk                         //----SYNCOUT[1:0] bits (Synchronization Outputs)
#define SAI_GCR_SYNCOUT_0          (0x1UL << SAI_GCR_SYNCOUT_Pos)              //--- 0x00000010
#define SAI_GCR_SYNCOUT_1          (0x2UL << SAI_GCR_SYNCOUT_Pos)              //--- 0x00000020

