Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  Bit definition for SAI_xCR1 register
//---------------------------------------------------------------------------------------------
#define SAI_xCR1_MODE_Pos          (0U)
#define SAI_xCR1_MODE_Msk          (0x3UL << SAI_xCR1_MODE_Pos)                //--- 0x00000003
#define SAI_xCR1_MODE              SAI_xCR1_MODE_Msk                           //----MODE[1:0] bits (Audio Block Mode)
#define SAI_xCR1_MODE_0            (0x1UL << SAI_xCR1_MODE_Pos)                //--- 0x00000001
#define SAI_xCR1_MODE_1            (0x2UL << SAI_xCR1_MODE_Pos)                //--- 0x00000002

#define SAI_xCR1_PRTCFG_Pos        (2U)
#define SAI_xCR1_PRTCFG_Msk        (0x3UL << SAI_xCR1_PRTCFG_Pos)              //--- 0x0000000C
#define SAI_xCR1_PRTCFG            SAI_xCR1_PRTCFG_Msk                         //----PRTCFG[1:0] bits (Protocol Configuration)
#define SAI_xCR1_PRTCFG_0          (0x1UL << SAI_xCR1_PRTCFG_Pos)              //--- 0x00000004
#define SAI_xCR1_PRTCFG_1          (0x2UL << SAI_xCR1_PRTCFG_Pos)              //--- 0x00000008

#define SAI_xCR1_DS_Pos            (5U)
#define SAI_xCR1_DS_Msk            (0x7UL << SAI_xCR1_DS_Pos)                  //--- 0x000000E0
#define SAI_xCR1_DS                SAI_xCR1_DS_Msk                             //----DS[1:0] bits (Data Size)
#define SAI_xCR1_DS_0              (0x1UL << SAI_xCR1_DS_Pos)                  //--- 0x00000020
#define SAI_xCR1_DS_1              (0x2UL << SAI_xCR1_DS_Pos)                  //--- 0x00000040
#define SAI_xCR1_DS_2              (0x4UL << SAI_xCR1_DS_Pos)                  //--- 0x00000080

#define SAI_xCR1_LSBFIRST_Pos      (8U)
#define SAI_xCR1_LSBFIRST_Msk      (0x1UL << SAI_xCR1_LSBFIRST_Pos)            //--- 0x00000100
#define SAI_xCR1_LSBFIRST          SAI_xCR1_LSBFIRST_Msk                       //----LSB First Configuration
#define SAI_xCR1_CKSTR_Pos         (9U)
#define SAI_xCR1_CKSTR_Msk         (0x1UL << SAI_xCR1_CKSTR_Pos)               //--- 0x00000200
#define SAI_xCR1_CKSTR             SAI_xCR1_CKSTR_Msk                          //----ClocK STRobing edge

#define SAI_xCR1_SYNCEN_Pos        (10U)
#define SAI_xCR1_SYNCEN_Msk        (0x3UL << SAI_xCR1_SYNCEN_Pos)              //--- 0x00000C00
#define SAI_xCR1_SYNCEN            SAI_xCR1_SYNCEN_Msk                         //----SYNCEN[1:0](SYNChronization ENable)
#define SAI_xCR1_SYNCEN_0          (0x1UL << SAI_xCR1_SYNCEN_Pos)              //--- 0x00000400
#define SAI_xCR1_SYNCEN_1          (0x2UL << SAI_xCR1_SYNCEN_Pos)              //--- 0x00000800

#define SAI_xCR1_MONO_Pos          (12U)
#define SAI_xCR1_MONO_Msk          (0x1UL << SAI_xCR1_MONO_Pos)                //--- 0x00001000
#define SAI_xCR1_MONO              SAI_xCR1_MONO_Msk                           //----Mono mode
#define SAI_xCR1_OUTDRIV_Pos       (13U)
#define SAI_xCR1_OUTDRIV_Msk       (0x1UL << SAI_xCR1_OUTDRIV_Pos)             //--- 0x00002000
#define SAI_xCR1_OUTDRIV           SAI_xCR1_OUTDRIV_Msk                        //----Output Drive
#define SAI_xCR1_SAIEN_Pos         (16U)
#define SAI_xCR1_SAIEN_Msk         (0x1UL << SAI_xCR1_SAIEN_Pos)               //--- 0x00010000
#define SAI_xCR1_SAIEN             SAI_xCR1_SAIEN_Msk                          //----Audio Block enable
#define SAI_xCR1_DMAEN_Pos         (17U)
#define SAI_xCR1_DMAEN_Msk         (0x1UL << SAI_xCR1_DMAEN_Pos)               //--- 0x00020000
#define SAI_xCR1_DMAEN             SAI_xCR1_DMAEN_Msk                          //----DMA enable
#define SAI_xCR1_NODIV_Pos         (19U)
#define SAI_xCR1_NODIV_Msk         (0x1UL << SAI_xCR1_NODIV_Pos)               //--- 0x00080000
#define SAI_xCR1_NODIV             SAI_xCR1_NODIV_Msk                          //----No Divider Configuration

#define SAI_xCR1_MCKDIV_Pos        (20U)
#define SAI_xCR1_MCKDIV_Msk        (0xFUL << SAI_xCR1_MCKDIV_Pos)              //--- 0x00F00000
#define SAI_xCR1_MCKDIV            SAI_xCR1_MCKDIV_Msk                         //----MCKDIV[3:0] (Master ClocK Divider)
#define SAI_xCR1_MCKDIV_0          (0x1UL << SAI_xCR1_MCKDIV_Pos)              //--- 0x00100000
#define SAI_xCR1_MCKDIV_1          (0x2UL << SAI_xCR1_MCKDIV_Pos)              //--- 0x00200000
#define SAI_xCR1_MCKDIV_2          (0x4UL << SAI_xCR1_MCKDIV_Pos)              //--- 0x00400000
#define SAI_xCR1_MCKDIV_3          (0x8UL << SAI_xCR1_MCKDIV_Pos)              //--- 0x00800000

//---------------------------------------------------------------------------------------------
//---  Bit definition for SAI_xCR2 register
//---------------------------------------------------------------------------------------------
#define SAI_xCR2_FTH_Pos           (0U)
#define SAI_xCR2_FTH_Msk           (0x7UL << SAI_xCR2_FTH_Pos)                 //--- 0x00000007
#define SAI_xCR2_FTH               SAI_xCR2_FTH_Msk                            //----FTH[2:0](Fifo THreshold)
#define SAI_xCR2_FTH_0             (0x1UL << SAI_xCR2_FTH_Pos)                 //--- 0x00000001
#define SAI_xCR2_FTH_1             (0x2UL << SAI_xCR2_FTH_Pos)                 //--- 0x00000002
#define SAI_xCR2_FTH_2             (0x4UL << SAI_xCR2_FTH_Pos)                 //--- 0x00000004

#define SAI_xCR2_FFLUSH_Pos        (3U)
#define SAI_xCR2_FFLUSH_Msk        (0x1UL << SAI_xCR2_FFLUSH_Pos)              //--- 0x00000008
#define SAI_xCR2_FFLUSH            SAI_xCR2_FFLUSH_Msk                         //----Fifo FLUSH
#define SAI_xCR2_TRIS_Pos          (4U)
#define SAI_xCR2_TRIS_Msk          (0x1UL << SAI_xCR2_TRIS_Pos)                //--- 0x00000010
#define SAI_xCR2_TRIS              SAI_xCR2_TRIS_Msk                           //----TRIState Management on data line
#define SAI_xCR2_MUTE_Pos          (5U)
#define SAI_xCR2_MUTE_Msk          (0x1UL << SAI_xCR2_MUTE_Pos)                //--- 0x00000020
#define SAI_xCR2_MUTE              SAI_xCR2_MUTE_Msk                           //----Mute mode
#define SAI_xCR2_MUTEVAL_Pos       (6U)
#define SAI_xCR2_MUTEVAL_Msk       (0x1UL << SAI_xCR2_MUTEVAL_Pos)             //--- 0x00000040
#define SAI_xCR2_MUTEVAL           SAI_xCR2_MUTEVAL_Msk                        //----Muate value


