Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define SPI_CR1_BR_Pos           (3U)
#define SPI_CR1_BR_Msk           (0x7UL << SPI_CR1_BR_Pos)                     //--- 0x00000038
#define SPI_CR1_BR               SPI_CR1_BR_Msk                                //----BR[2:0] bits (Baud Rate Control)
#define SPI_CR1_BR_0             (0x1UL << SPI_CR1_BR_Pos)                     //--- 0x00000008
#define SPI_CR1_BR_1             (0x2UL << SPI_CR1_BR_Pos)                     //--- 0x00000010
#define SPI_CR1_BR_2             (0x4UL << SPI_CR1_BR_Pos)                     //--- 0x00000020

#define SPI_CR1_SPE_Pos          (6U)
#define SPI_CR1_SPE_Msk          (0x1UL << SPI_CR1_SPE_Pos)                    //--- 0x00000040
#define SPI_CR1_SPE              SPI_CR1_SPE_Msk                               //----SPI Enable
#define SPI_CR1_LSBFIRST_Pos     (7U)
#define SPI_CR1_LSBFIRST_Msk     (0x1UL << SPI_CR1_LSBFIRST_Pos)               //--- 0x00000080
#define SPI_CR1_LSBFIRST         SPI_CR1_LSBFIRST_Msk                          //----Frame Format
#define SPI_CR1_SSI_Pos          (8U)
#define SPI_CR1_SSI_Msk          (0x1UL << SPI_CR1_SSI_Pos)                    //--- 0x00000100
#define SPI_CR1_SSI              SPI_CR1_SSI_Msk                               //----Internal slave select
#define SPI_CR1_SSM_Pos          (9U)
#define SPI_CR1_SSM_Msk          (0x1UL << SPI_CR1_SSM_Pos)                    //--- 0x00000200
#define SPI_CR1_SSM              SPI_CR1_SSM_Msk                               //----Software slave management
#define SPI_CR1_RXONLY_Pos       (10U)
#define SPI_CR1_RXONLY_Msk       (0x1UL << SPI_CR1_RXONLY_Pos)                 //--- 0x00000400
#define SPI_CR1_RXONLY           SPI_CR1_RXONLY_Msk                            //----Receive only
#define SPI_CR1_CRCL_Pos         (11U)
#define SPI_CR1_CRCL_Msk         (0x1UL << SPI_CR1_CRCL_Pos)                   //--- 0x00000800
#define SPI_CR1_CRCL             SPI_CR1_CRCL_Msk                              //--- CRC Length
#define SPI_CR1_CRCNEXT_Pos      (12U)
#define SPI_CR1_CRCNEXT_Msk      (0x1UL << SPI_CR1_CRCNEXT_Pos)                //--- 0x00001000
#define SPI_CR1_CRCNEXT          SPI_CR1_CRCNEXT_Msk                           //----Transmit CRC next
#define SPI_CR1_CRCEN_Pos        (13U)
#define SPI_CR1_CRCEN_Msk        (0x1UL << SPI_CR1_CRCEN_Pos)                  //--- 0x00002000
#define SPI_CR1_CRCEN            SPI_CR1_CRCEN_Msk                             //----Hardware CRC calculation enable
#define SPI_CR1_BIDIOE_Pos       (14U)
#define SPI_CR1_BIDIOE_Msk       (0x1UL << SPI_CR1_BIDIOE_Pos)                 //--- 0x00004000
#define SPI_CR1_BIDIOE           SPI_CR1_BIDIOE_Msk                            //----Output enable in bidirectional mode
#define SPI_CR1_BIDIMODE_Pos     (15U)
#define SPI_CR1_BIDIMODE_Msk     (0x1UL << SPI_CR1_BIDIMODE_Pos)               //--- 0x00008000
#define SPI_CR1_BIDIMODE         SPI_CR1_BIDIMODE_Msk                          //----Bidirectional data mode enable

//---------------------------------------------------------------------------------------------
//---  Bit definition for SPI_CR2 register
//---------------------------------------------------------------------------------------------
#define SPI_CR2_RXDMAEN_Pos      (0U)
#define SPI_CR2_RXDMAEN_Msk      (0x1UL << SPI_CR2_RXDMAEN_Pos)                //--- 0x00000001
#define SPI_CR2_RXDMAEN          SPI_CR2_RXDMAEN_Msk                           //--- Rx Buffer DMA Enable
#define SPI_CR2_TXDMAEN_Pos      (1U)
#define SPI_CR2_TXDMAEN_Msk      (0x1UL << SPI_CR2_TXDMAEN_Pos)                //--- 0x00000002
#define SPI_CR2_TXDMAEN          SPI_CR2_TXDMAEN_Msk                           //--- Tx Buffer DMA Enable
#define SPI_CR2_SSOE_Pos         (2U)
#define SPI_CR2_SSOE_Msk         (0x1UL << SPI_CR2_SSOE_Pos)                   //--- 0x00000004
#define SPI_CR2_SSOE             SPI_CR2_SSOE_Msk                              //--- SS Output Enable
#define SPI_CR2_NSSP_Pos         (3U)
#define SPI_CR2_NSSP_Msk         (0x1UL << SPI_CR2_NSSP_Pos)                   //--- 0x00000008
#define SPI_CR2_NSSP             SPI_CR2_NSSP_Msk                              //--- NSS pulse management Enable
#define SPI_CR2_FRF_Pos          (4U)
#define SPI_CR2_FRF_Msk          (0x1UL << SPI_CR2_FRF_Pos)                    //--- 0x00000010
#define SPI_CR2_FRF              SPI_CR2_FRF_Msk                               //--- Frame Format Enable
#define SPI_CR2_ERRIE_Pos        (5U)
#define SPI_CR2_ERRIE_Msk        (0x1UL << SPI_CR2_ERRIE_Pos)                  //--- 0x00000020
#define SPI_CR2_ERRIE            SPI_CR2_ERRIE_Msk                             //--- Error Interrupt Enable
#define SPI_CR2_RXNEIE_Pos       (6U)
#define SPI_CR2_RXNEIE_Msk       (0x1UL << SPI_CR2_RXNEIE_Pos)                 //--- 0x00000040
#define SPI_CR2_RXNEIE           SPI_CR2_RXNEIE_Msk                            //--- RX buffer Not Empty Interrupt Enable
#define SPI_CR2_TXEIE_Pos        (7U)
#define SPI_CR2_TXEIE_Msk        (0x1UL << SPI_CR2_TXEIE_Pos)                  //--- 0x00000080
#define SPI_CR2_TXEIE            SPI_CR2_TXEIE_Msk                             //--- Tx buffer Empty Interrupt Enable
#define SPI_CR2_DS_Pos           (8U)
#define SPI_CR2_DS_Msk           (0xFUL << SPI_CR2_DS_Pos)                     //--- 0x00000F00
#define SPI_CR2_DS               SPI_CR2_DS_Msk                                //--- DS[3:0] Data Size
#define SPI_CR2_DS_0             (0x1UL << SPI_CR2_DS_Pos)                     //--- 0x00000100
#define SPI_CR2_DS_1             (0x2UL << SPI_CR2_DS_Pos)                     //--- 0x00000200
#define SPI_CR2_DS_2             (0x4UL << SPI_CR2_DS_Pos)                     //--- 0x00000400
#define SPI_CR2_DS_3             (0x8UL << SPI_CR2_DS_Pos)                     //--- 0x00000800
#define SPI_CR2_FRXTH_Pos        (12U)
#define SPI_CR2_FRXTH_Msk        (0x1UL << SPI_CR2_FRXTH_Pos)                  //--- 0x00001000
#define SPI_CR2_FRXTH            SPI_CR2_FRXTH_Msk                             //--- FIFO reception Threshold
#define SPI_CR2_LDMARX_Pos       (13U)
#define SPI_CR2_LDMARX_Msk       (0x1UL << SPI_CR2_LDMARX_Pos)                 //--- 0x00002000
#define SPI_CR2_LDMARX           SPI_CR2_LDMARX_Msk                            //--- Last DMA transfer for reception
#define SPI_CR2_LDMATX_Pos       (14U)
#define SPI_CR2_LDMATX_Msk       (0x1UL << SPI_CR2_LDMATX_Pos)                 //--- 0x00004000
#define SPI_CR2_LDMATX           SPI_CR2_LDMATX_Msk                            //--- Last DMA transfer for transmission

//---------------------------------------------------------------------------------------------
//--- Bit definition for SPI_SR register
//---------------------------------------------------------------------------------------------
#define SPI_SR_RXNE_Pos          (0U)
#define SPI_SR_RXNE_Msk          (0x1UL << SPI_SR_RXNE_Pos)                    //--- 0x00000001
#define SPI_SR_RXNE              SPI_SR_RXNE_Msk                               //--- Receive buffer Not Empty
#define SPI_SR_TXE_Pos           (1U)
#define SPI_SR_TXE_Msk           (0x1UL << SPI_SR_TXE_Pos)                     //--- 0x00000002
#define SPI_SR_TXE               SPI_SR_TXE_Msk                                //--- Transmit buffer Empty
#define SPI_SR_CHSIDE_Pos        (2U)
#define SPI_SR_CHSIDE_Msk        (0x1UL << SPI_SR_CHSIDE_Pos)                  //--- 0x00000004
#define SPI_SR_CHSIDE            SPI_SR_CHSIDE_Msk                             //--- Channel side
#define SPI_SR_UDR_Pos           (3U)
#define SPI_SR_UDR_Msk           (0x1UL << SPI_SR_UDR_Pos)                     //--- 0x00000008
#define SPI_SR_UDR               SPI_SR_UDR_Msk                                //--- Underrun flag
#define SPI_SR_CRCERR_Pos        (4U)
#define SPI_SR_CRCERR_Msk        (0x1UL << SPI_SR_CRCERR_Pos)                  //--- 0x00000010
#define SPI_SR_CRCERR            SPI_SR_CRCERR_Msk                             //--- CRC Error flag
#define SPI_SR_MODF_Pos          (5U)
#define SPI_SR_MODF_Msk          (0x1UL << SPI_SR_MODF_Pos)                    //--- 0x00000020
#define SPI_SR_MODF              SPI_SR_MODF_Msk                               //--- Mode fault
#define SPI_SR_OVR_Pos           (6U)
#define SPI_SR_OVR_Msk           (0x1UL << SPI_SR_OVR_Pos)                     //--- 0x00000040
#define SPI_SR_OVR               SPI_SR_OVR_Msk                                //--- Overrun flag
#define SPI_SR_BSY_Pos           (7U)
#define SPI_SR_BSY_Msk           (0x1UL << SPI_SR_BSY_Pos)                     //--- 0x00000080
#define SPI_SR_BSY               SPI_SR_BSY_Msk                                //--- Busy flag
#define SPI_SR_FRE_Pos           (8U)
#define SPI_SR_FRE_Msk           (0x1UL << SPI_SR_FRE_Pos)                     //--- 0x00000100
#define SPI_SR_FRE               SPI_SR_FRE_Msk                                //--- TI frame format error
#define SPI_SR_FRLVL_Pos         (9U)
#define SPI_SR_FRLVL_Msk         (0x3UL << SPI_SR_FRLVL_Pos)                   //--- 0x00000600
#define SPI_SR_FRLVL             SPI_SR_FRLVL_Msk                              //--- FIFO Reception Level
#define SPI_SR_FRLVL_0           (0x1UL << SPI_SR_FRLVL_Pos)                   //--- 0x00000200
#define SPI_SR_FRLVL_1           (0x2UL << SPI_SR_FRLVL_Pos)                   //--- 0x00000400
#define SPI_SR_FTLVL_Pos         (11U)
#define SPI_SR_FTLVL_Msk         (0x3UL << SPI_SR_FTLVL_Pos)                   //--- 0x00001800
#define SPI_SR_FTLVL             SPI_SR_FTLVL_Msk                              //--- FIFO Transmission Level
#define SPI_SR_FTLVL_0           (0x1UL << SPI_SR_FTLVL_Pos)                   //--- 0x00000800
#define SPI_SR_FTLVL_1           (0x2UL << SPI_SR_FTLVL_Pos)                   //--- 0x00001000

//---------------------------------------------------------------------------------------------
//---  Bit definition for SPI_DR register
//---------------------------------------------------------------------------------------------
#define SPI_DR_DR_Pos            (0U)
#define SPI_DR_DR_Msk            (0xFFFFUL << SPI_DR_DR_Pos)                   //--- 0x0000FFFF
#define SPI_DR_DR                SPI_DR_DR_Msk                                 //----Data Register

//---------------------------------------------------------------------------------------------
//---  Bit definition for SPI_CRCPR register
//---------------------------------------------------------------------------------------------
#define SPI_CRCPR_CRCPOLY_Pos    (0U)
#define SPI_CRCPR_CRCPOLY_Msk    (0xFFFFUL << SPI_CRCPR_CRCPOLY_Pos)           //--- 0x0000FFFF
#define SPI_CRCPR_CRCPOLY        SPI_CRCPR_CRCPOLY_Msk                         //----CRC polynomial register

//---------------------------------------------------------------------------------------------
//---   Bit definition for SPI_RXCRCR register
//---------------------------------------------------------------------------------------------
#define SPI_RXCRCR_RXCRC_Pos     (0U)
#define SPI_RXCRCR_RXCRC_Msk     (0xFFFFUL << SPI_RXCRCR_RXCRC_Pos)            //--- 0x0000FFFF
#define SPI_RXCRCR_RXCRC         SPI_RXCRCR_RXCRC_Msk                          //----Rx CRC Register

//---------------------------------------------------------------------------------------------
//---   Bit definition for SPI_TXCRCR register
//---------------------------------------------------------------------------------------------
#define SPI_TXCRCR_TXCRC_Pos     (0U)
#define SPI_TXCRCR_TXCRC_Msk     (0xFFFFUL << SPI_TXCRCR_TXCRC_Pos)            //--- 0x0000FFFF
#define SPI_TXCRCR_TXCRC         SPI_TXCRCR_TXCRC_Msk                          //----Tx CRC Register

//---------------------------------------------------------------------------------------------
//---                                     QUADSPI
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for QUADSPI_CR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_CR_EN_Pos              (0U)
#define QUADSPI_CR_EN_Msk              (0x1UL << QUADSPI_CR_EN_Pos)            //--- 0x00000001
#define QUADSPI_CR_EN                  QUADSPI_CR_EN_Msk                       //--- Enable
#define QUADSPI_CR_ABORT_Pos           (1U)
#define QUADSPI_CR_ABORT_Msk           (0x1UL << QUADSPI_CR_ABORT_Pos)         //--- 0x00000002
#define QUADSPI_CR_ABORT               QUADSPI_CR_ABORT_Msk                    //--- Abort request
#define QUADSPI_CR_DMAEN_Pos           (2U)
#define QUADSPI_CR_DMAEN_Msk           (0x1UL << QUADSPI_CR_DMAEN_Pos)         //--- 0x00000004
#define QUADSPI_CR_DMAEN               QUADSPI_CR_DMAEN_Msk                    //--- DMA Enable
#define QUADSPI_CR_TCEN_Pos            (3U)
#define QUADSPI_CR_TCEN_Msk            (0x1UL << QUADSPI_CR_TCEN_Pos)          //--- 0x00000008
#define QUADSPI_CR_TCEN                QUADSPI_CR_TCEN_Msk                     //--- Timeout Counter Enable
#define QUADSPI_CR_SSHIFT_Pos          (4U)
#define QUADSPI_CR_SSHIFT_Msk          (0x1UL << QUADSPI_CR_SSHIFT_Pos)        //--- 0x00000010
#define QUADSPI_CR_SSHIFT              QUADSPI_CR_SSHIFT_Msk                   //--- Sample Shift
#define QUADSPI_CR_DFM_Pos             (6U)
#define QUADSPI_CR_DFM_Msk             (0x1UL << QUADSPI_CR_DFM_Pos)           //--- 0x00000040
#define QUADSPI_CR_DFM                 QUADSPI_CR_DFM_Msk                      //--- Dual-flash mode
#define QUADSPI_CR_FSEL_Pos            (7U)
#define QUADSPI_CR_FSEL_Msk            (0x1UL << QUADSPI_CR_FSEL_Pos)          //--- 0x00000080
#define QUADSPI_CR_FSEL                QUADSPI_CR_FSEL_Msk                     //--- Flash memory selection
#define QUADSPI_CR_FTHRES_Pos          (8U)
#define QUADSPI_CR_FTHRES_Msk          (0xFUL << QUADSPI_CR_FTHRES_Pos)        //--- 0x00000F00
#define QUADSPI_CR_FTHRES              QUADSPI_CR_FTHRES_Msk                   //--- FTHRES[3:0] FIFO Level
#define QUADSPI_CR_TEIE_Pos            (16U)
#define QUADSPI_CR_TEIE_Msk            (0x1UL << QUADSPI_CR_TEIE_Pos)          //--- 0x00010000
#define QUADSPI_CR_TEIE                QUADSPI_CR_TEIE_Msk                     //--- Transfer Error Interrupt Enable
#define QUADSPI_CR_TCIE_Pos            (17U)
#define QUADSPI_CR_TCIE_Msk            (0x1UL << QUADSPI_CR_TCIE_Pos)          //--- 0x00020000
#define QUADSPI_CR_TCIE                QUADSPI_CR_TCIE_Msk                     //--- Transfer Complete Interrupt Enable
#define QUADSPI_CR_FTIE_Pos            (18U)
#define QUADSPI_CR_FTIE_Msk            (0x1UL << QUADSPI_CR_FTIE_Pos)          //--- 0x00040000
#define QUADSPI_CR_FTIE                QUADSPI_CR_FTIE_Msk                     //--- FIFO Threshold Interrupt Enable
#define QUADSPI_CR_SMIE_Pos            (19U)
#define QUADSPI_CR_SMIE_Msk            (0x1UL << QUADSPI_CR_SMIE_Pos)          //--- 0x00080000
#define QUADSPI_CR_SMIE                QUADSPI_CR_SMIE_Msk                     //--- Status Match Interrupt Enable
#define QUADSPI_CR_TOIE_Pos            (20U)
#define QUADSPI_CR_TOIE_Msk            (0x1UL << QUADSPI_CR_TOIE_Pos)          //--- 0x00100000
#define QUADSPI_CR_TOIE                QUADSPI_CR_TOIE_Msk                     //--- TimeOut Interrupt Enable
#define QUADSPI_CR_APMS_Pos            (22U)
#define QUADSPI_CR_APMS_Msk            (0x1UL << QUADSPI_CR_APMS_Pos)          //--- 0x00400000
#define QUADSPI_CR_APMS                QUADSPI_CR_APMS_Msk                     //--- Automatic Polling Mode Stop
#define QUADSPI_CR_PMM_Pos             (23U)
#define QUADSPI_CR_PMM_Msk             (0x1UL << QUADSPI_CR_PMM_Pos)           //--- 0x00800000
#define QUADSPI_CR_PMM                 QUADSPI_CR_PMM_Msk                      //--- Polling Match Mode
#define QUADSPI_CR_PRESCALER_Pos       (24U)
#define QUADSPI_CR_PRESCALER_Msk       (0xFFUL << QUADSPI_CR_PRESCALER_Pos)    //--- 0xFF000000
#define QUADSPI_CR_PRESCALER           QUADSPI_CR_PRESCALER_Msk                //--- PRESCALER[7:0] Clock prescaler

//---------------------------------------------------------------------------------------------
//---  Bit definition for QUADSPI_DCR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_DCR_CKMODE_Pos         (0U)
#define QUADSPI_DCR_CKMODE_Msk         (0x1UL << QUADSPI_DCR_CKMODE_Pos)       //--- 0x00000001
#define QUADSPI_DCR_CKMODE             QUADSPI_DCR_CKMODE_Msk                  //--- Mode 0 / Mode 3
#define QUADSPI_DCR_CSHT_Pos           (8U)
#define QUADSPI_DCR_CSHT_Msk           (0x7UL << QUADSPI_DCR_CSHT_Pos)         //--- 0x00000700
#define QUADSPI_DCR_CSHT               QUADSPI_DCR_CSHT_Msk                    //--- CSHT[2:0]: ChipSelect High Time
#define QUADSPI_DCR_CSHT_0             (0x1UL << QUADSPI_DCR_CSHT_Pos)         //--- 0x00000100
#define QUADSPI_DCR_CSHT_1             (0x2UL << QUADSPI_DCR_CSHT_Pos)         //--- 0x00000200
#define QUADSPI_DCR_CSHT_2             (0x4UL << QUADSPI_DCR_CSHT_Pos)         //--- 0x00000400
#define QUADSPI_DCR_FSIZE_Pos          (16U)
#define QUADSPI_DCR_FSIZE_Msk          (0x1FUL << QUADSPI_DCR_FSIZE_Pos)       //--- 0x001F0000
#define QUADSPI_DCR_FSIZE              QUADSPI_DCR_FSIZE_Msk                   //--- FSIZE[4:0]: Flash Size

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_SR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_SR_TEF_Pos             (0U)
#define QUADSPI_SR_TEF_Msk             (0x1UL << QUADSPI_SR_TEF_Pos)           //--- 0x00000001
#define QUADSPI_SR_TEF                 QUADSPI_SR_TEF_Msk                      //--- Transfer Error Flag
#define QUADSPI_SR_TCF_Pos             (1U)
#define QUADSPI_SR_TCF_Msk             (0x1UL << QUADSPI_SR_TCF_Pos)           //--- 0x00000002
#define QUADSPI_SR_TCF                 QUADSPI_SR_TCF_Msk                      //--- Transfer Complete Flag
#define QUADSPI_SR_FTF_Pos             (2U)
#define QUADSPI_SR_FTF_Msk             (0x1UL << QUADSPI_SR_FTF_Pos)           //--- 0x00000004
#define QUADSPI_SR_FTF                 QUADSPI_SR_FTF_Msk                      //--- FIFO Threshlod Flag
#define QUADSPI_SR_SMF_Pos             (3U)
#define QUADSPI_SR_SMF_Msk             (0x1UL << QUADSPI_SR_SMF_Pos)           //--- 0x00000008
#define QUADSPI_SR_SMF                 QUADSPI_SR_SMF_Msk                      //--- Status Match Flag
#define QUADSPI_SR_TOF_Pos             (4U)
#define QUADSPI_SR_TOF_Msk             (0x1UL << QUADSPI_SR_TOF_Pos)           //--- 0x00000010
#define QUADSPI_SR_TOF                 QUADSPI_SR_TOF_Msk                      //--- Timeout Flag
#define QUADSPI_SR_BUSY_Pos            (5U)
#define QUADSPI_SR_BUSY_Msk            (0x1UL << QUADSPI_SR_BUSY_Pos)          //--- 0x00000020
#define QUADSPI_SR_BUSY                QUADSPI_SR_BUSY_Msk                     //--- Busy
#define QUADSPI_SR_FLEVEL_Pos          (8U)
#define QUADSPI_SR_FLEVEL_Msk          (0x1FUL << QUADSPI_SR_FLEVEL_Pos)       //--- 0x00001F00
#define QUADSPI_SR_FLEVEL              QUADSPI_SR_FLEVEL_Msk                   //--- FIFO Threshlod Flag

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_FCR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_FCR_CTEF_Pos           (0U)
#define QUADSPI_FCR_CTEF_Msk           (0x1UL << QUADSPI_FCR_CTEF_Pos)         //--- 0x00000001
#define QUADSPI_FCR_CTEF               QUADSPI_FCR_CTEF_Msk                    //--- Clear Transfer Error Flag
#define QUADSPI_FCR_CTCF_Pos           (1U)
#define QUADSPI_FCR_CTCF_Msk           (0x1UL << QUADSPI_FCR_CTCF_Pos)         //--- 0x00000002
#define QUADSPI_FCR_CTCF               QUADSPI_FCR_CTCF_Msk                    //--- Clear Transfer Complete Flag
#define QUADSPI_FCR_CSMF_Pos           (3U)
#define QUADSPI_FCR_CSMF_Msk           (0x1UL << QUADSPI_FCR_CSMF_Pos)         //--- 0x00000008
#define QUADSPI_FCR_CSMF               QUADSPI_FCR_CSMF_Msk                    //--- Clear Status Match Flag
#define QUADSPI_FCR_CTOF_Pos           (4U)
#define QUADSPI_FCR_CTOF_Msk           (0x1UL << QUADSPI_FCR_CTOF_Pos)         //--- 0x00000010
#define QUADSPI_FCR_CTOF               QUADSPI_FCR_CTOF_Msk                    //--- Clear Timeout Flag

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_DLR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_DLR_DL_Pos             (0U)
#define QUADSPI_DLR_DL_Msk             (0xFFFFFFFFUL << QUADSPI_DLR_DL_Pos)    //--- 0xFFFFFFFF
#define QUADSPI_DLR_DL                 QUADSPI_DLR_DL_Msk                      //--- DL[31:0]: Data Length

