Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_CCR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_CCR_INSTRUCTION_Pos    (0U)
#define QUADSPI_CCR_INSTRUCTION_Msk    (0xFFUL << QUADSPI_CCR_INSTRUCTION_Pos) //--- 0x000000FF
#define QUADSPI_CCR_INSTRUCTION        QUADSPI_CCR_INSTRUCTION_Msk             //--- INSTRUCTION[7:0]: Instruction
#define QUADSPI_CCR_IMODE_Pos          (8U)
#define QUADSPI_CCR_IMODE_Msk          (0x3UL << QUADSPI_CCR_IMODE_Pos)        //--- 0x00000300
#define QUADSPI_CCR_IMODE              QUADSPI_CCR_IMODE_Msk                   //--- IMODE[1:0]: Instruction Mode
#define QUADSPI_CCR_IMODE_0            (0x1UL << QUADSPI_CCR_IMODE_Pos)        //--- 0x00000100
#define QUADSPI_CCR_IMODE_1            (0x2UL << QUADSPI_CCR_IMODE_Pos)        //--- 0x00000200
#define QUADSPI_CCR_ADMODE_Pos         (10U)
#define QUADSPI_CCR_ADMODE_Msk         (0x3UL << QUADSPI_CCR_ADMODE_Pos)       //--- 0x00000C00
#define QUADSPI_CCR_ADMODE             QUADSPI_CCR_ADMODE_Msk                  //--- ADMODE[1:0]: Address Mode
#define QUADSPI_CCR_ADMODE_0           (0x1UL << QUADSPI_CCR_ADMODE_Pos)       //--- 0x00000400
#define QUADSPI_CCR_ADMODE_1           (0x2UL << QUADSPI_CCR_ADMODE_Pos)       //--- 0x00000800
#define QUADSPI_CCR_ADSIZE_Pos         (12U)
#define QUADSPI_CCR_ADSIZE_Msk         (0x3UL << QUADSPI_CCR_ADSIZE_Pos)       //--- 0x00003000
#define QUADSPI_CCR_ADSIZE             QUADSPI_CCR_ADSIZE_Msk                  //--- ADSIZE[1:0]: Address Size
#define QUADSPI_CCR_ADSIZE_0           (0x1UL << QUADSPI_CCR_ADSIZE_Pos)       //--- 0x00001000
#define QUADSPI_CCR_ADSIZE_1           (0x2UL << QUADSPI_CCR_ADSIZE_Pos)       //--- 0x00002000
#define QUADSPI_CCR_ABMODE_Pos         (14U)
#define QUADSPI_CCR_ABMODE_Msk         (0x3UL << QUADSPI_CCR_ABMODE_Pos)       //--- 0x0000C000
#define QUADSPI_CCR_ABMODE             QUADSPI_CCR_ABMODE_Msk                  //--- ABMODE[1:0]: Alternate Bytes Mode
#define QUADSPI_CCR_ABMODE_0           (0x1UL << QUADSPI_CCR_ABMODE_Pos)       //--- 0x00004000
#define QUADSPI_CCR_ABMODE_1           (0x2UL << QUADSPI_CCR_ABMODE_Pos)       //--- 0x00008000
#define QUADSPI_CCR_ABSIZE_Pos         (16U)
#define QUADSPI_CCR_ABSIZE_Msk         (0x3UL << QUADSPI_CCR_ABSIZE_Pos)       //--- 0x00030000
#define QUADSPI_CCR_ABSIZE             QUADSPI_CCR_ABSIZE_Msk                  //--- ABSIZE[1:0]: Instruction Mode
#define QUADSPI_CCR_ABSIZE_0           (0x1UL << QUADSPI_CCR_ABSIZE_Pos)       //--- 0x00010000
#define QUADSPI_CCR_ABSIZE_1           (0x2UL << QUADSPI_CCR_ABSIZE_Pos)       //--- 0x00020000
#define QUADSPI_CCR_DCYC_Pos           (18U)
#define QUADSPI_CCR_DCYC_Msk           (0x1FUL << QUADSPI_CCR_DCYC_Pos)        //--- 0x007C0000
#define QUADSPI_CCR_DCYC               QUADSPI_CCR_DCYC_Msk                    //--- DCYC[4:0]: Dummy Cycles
#define QUADSPI_CCR_DMODE_Pos          (24U)
#define QUADSPI_CCR_DMODE_Msk          (0x3UL << QUADSPI_CCR_DMODE_Pos)        //--- 0x03000000
#define QUADSPI_CCR_DMODE              QUADSPI_CCR_DMODE_Msk                   //--- DMODE[1:0]: Data Mode
#define QUADSPI_CCR_DMODE_0            (0x1UL << QUADSPI_CCR_DMODE_Pos)        //--- 0x01000000
#define QUADSPI_CCR_DMODE_1            (0x2UL << QUADSPI_CCR_DMODE_Pos)        //--- 0x02000000
#define QUADSPI_CCR_FMODE_Pos          (26U)
#define QUADSPI_CCR_FMODE_Msk          (0x3UL << QUADSPI_CCR_FMODE_Pos)        //--- 0x0C000000
#define QUADSPI_CCR_FMODE              QUADSPI_CCR_FMODE_Msk                   //--- FMODE[1:0]: Functional Mode
#define QUADSPI_CCR_FMODE_0            (0x1UL << QUADSPI_CCR_FMODE_Pos)        //--- 0x04000000
#define QUADSPI_CCR_FMODE_1            (0x2UL << QUADSPI_CCR_FMODE_Pos)        //--- 0x08000000
#define QUADSPI_CCR_SIOO_Pos           (28U)
#define QUADSPI_CCR_SIOO_Msk           (0x1UL << QUADSPI_CCR_SIOO_Pos)         //--- 0x10000000
#define QUADSPI_CCR_SIOO               QUADSPI_CCR_SIOO_Msk                    //--- SIOO: Send Instruction Only Once Mode
#define QUADSPI_CCR_DHHC_Pos           (30U)
#define QUADSPI_CCR_DHHC_Msk           (0x1UL << QUADSPI_CCR_DHHC_Pos)         //--- 0x40000000
#define QUADSPI_CCR_DHHC               QUADSPI_CCR_DHHC_Msk                    //--- DHHC: DDR hold
#define QUADSPI_CCR_DDRM_Pos           (31U)
#define QUADSPI_CCR_DDRM_Msk           (0x1UL << QUADSPI_CCR_DDRM_Pos)         //--- 0x80000000
#define QUADSPI_CCR_DDRM               QUADSPI_CCR_DDRM_Msk                    //--- DDRM: Double Data Rate Mode

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_AR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_AR_ADDRESS_Pos         (0U)
#define QUADSPI_AR_ADDRESS_Msk         (0xFFFFFFFFUL << QUADSPI_AR_ADDRESS_Pos) //--- 0xFFFFFFFF
#define QUADSPI_AR_ADDRESS             QUADSPI_AR_ADDRESS_Msk                  //--- ADDRESS[31:0]: Address

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_ABR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_ABR_ALTERNATE_Pos      (0U)
#define QUADSPI_ABR_ALTERNATE_Msk      (0xFFFFFFFFUL << QUADSPI_ABR_ALTERNATE_Pos) //--- 0xFFFFFFFF
#define QUADSPI_ABR_ALTERNATE          QUADSPI_ABR_ALTERNATE_Msk               //--- ALTERNATE[31:0]: Alternate Bytes

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_DR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_DR_DATA_Pos            (0U)
#define QUADSPI_DR_DATA_Msk            (0xFFFFFFFFUL << QUADSPI_DR_DATA_Pos)   //--- 0xFFFFFFFF
#define QUADSPI_DR_DATA                QUADSPI_DR_DATA_Msk                     //--- DATA[31:0]: Data

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_PSMKR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_PSMKR_MASK_Pos         (0U)
#define QUADSPI_PSMKR_MASK_Msk         (0xFFFFFFFFUL << QUADSPI_PSMKR_MASK_Pos) //--- 0xFFFFFFFF
#define QUADSPI_PSMKR_MASK             QUADSPI_PSMKR_MASK_Msk                  //--- MASK[31:0]: Status Mask

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_PSMAR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_PSMAR_MATCH_Pos        (0U)
#define QUADSPI_PSMAR_MATCH_Msk        (0xFFFFFFFFUL << QUADSPI_PSMAR_MATCH_Pos) //--- 0xFFFFFFFF
#define QUADSPI_PSMAR_MATCH            QUADSPI_PSMAR_MATCH_Msk                 //--- MATCH[31:0]: Status Match

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_PIR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_PIR_INTERVAL_Pos       (0U)
#define QUADSPI_PIR_INTERVAL_Msk       (0xFFFFUL << QUADSPI_PIR_INTERVAL_Pos)  //--- 0x0000FFFF
#define QUADSPI_PIR_INTERVAL           QUADSPI_PIR_INTERVAL_Msk                //--- INTERVAL[15:0]: Polling Interval

//---------------------------------------------------------------------------------------------
//---   Bit definition for QUADSPI_LPTR register
//---------------------------------------------------------------------------------------------
#define QUADSPI_LPTR_TIMEOUT_Pos       (0U)
#define QUADSPI_LPTR_TIMEOUT_Msk       (0xFFFFUL << QUADSPI_LPTR_TIMEOUT_Pos)  //--- 0x0000FFFF
#define QUADSPI_LPTR_TIMEOUT           QUADSPI_LPTR_TIMEOUT_Msk                //--- TIMEOUT[15:0]: Timeout period

//---------------------------------------------------------------------------------------------
//---                                  SYSCFG
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---   Bit definition for SYSCFG_MEMRMP register
//---------------------------------------------------------------------------------------------
#define SYSCFG_MEMRMP_MEM_MODE_Pos      (0U)
#define SYSCFG_MEMRMP_MEM_MODE_Msk      (0x7UL << SYSCFG_MEMRMP_MEM_MODE_Pos)  //--- 0x00000007
#define SYSCFG_MEMRMP_MEM_MODE          SYSCFG_MEMRMP_MEM_MODE_Msk             //--- SYSCFG_Memory Remap Config
#define SYSCFG_MEMRMP_MEM_MODE_0        (0x1UL << SYSCFG_MEMRMP_MEM_MODE_Pos)  //--- 0x00000001
#define SYSCFG_MEMRMP_MEM_MODE_1        (0x2UL << SYSCFG_MEMRMP_MEM_MODE_Pos)  //--- 0x00000002
#define SYSCFG_MEMRMP_MEM_MODE_2        (0x4UL << SYSCFG_MEMRMP_MEM_MODE_Pos)  //--- 0x00000004

//---------------------------------------------------------------------------------------------
//---   Bit definition for SYSCFG_CFGR1 register
//---------------------------------------------------------------------------------------------
#define SYSCFG_CFGR1_FWDIS_Pos          (0U)
#define SYSCFG_CFGR1_FWDIS_Msk          (0x1UL << SYSCFG_CFGR1_FWDIS_Pos)      //--- 0x00000001
#define SYSCFG_CFGR1_FWDIS              SYSCFG_CFGR1_FWDIS_Msk                 //--- FIREWALL access enable
#define SYSCFG_CFGR1_BOOSTEN_Pos        (8U)
#define SYSCFG_CFGR1_BOOSTEN_Msk        (0x1UL << SYSCFG_CFGR1_BOOSTEN_Pos)    //--- 0x00000100
#define SYSCFG_CFGR1_BOOSTEN            SYSCFG_CFGR1_BOOSTEN_Msk               //--- I/O analog switch voltage booster enable
#define SYSCFG_CFGR1_I2C_PB6_FMP_Pos    (16U)
#define SYSCFG_CFGR1_I2C_PB6_FMP_Msk    (0x1UL << SYSCFG_CFGR1_I2C_PB6_FMP_Pos) //--- 0x00010000
#define SYSCFG_CFGR1_I2C_PB6_FMP        SYSCFG_CFGR1_I2C_PB6_FMP_Msk           //--- I2C PB6 Fast mode plus
#define SYSCFG_CFGR1_I2C_PB7_FMP_Pos    (17U)
#define SYSCFG_CFGR1_I2C_PB7_FMP_Msk    (0x1UL << SYSCFG_CFGR1_I2C_PB7_FMP_Pos) //--- 0x00020000
#define SYSCFG_CFGR1_I2C_PB7_FMP        SYSCFG_CFGR1_I2C_PB7_FMP_Msk           //--- I2C PB7 Fast mode plus
#define SYSCFG_CFGR1_I2C1_FMP_Pos       (20U)
#define SYSCFG_CFGR1_I2C1_FMP_Msk       (0x1UL << SYSCFG_CFGR1_I2C1_FMP_Pos)   //--- 0x00100000
#define SYSCFG_CFGR1_I2C1_FMP           SYSCFG_CFGR1_I2C1_FMP_Msk              //--- I2C1 Fast mode plus
#define SYSCFG_CFGR1_I2C3_FMP_Pos       (22U)
#define SYSCFG_CFGR1_I2C3_FMP_Msk       (0x1UL << SYSCFG_CFGR1_I2C3_FMP_Pos)   //--- 0x00400000
#define SYSCFG_CFGR1_I2C3_FMP           SYSCFG_CFGR1_I2C3_FMP_Msk              //--- I2C3 Fast mode plus
#define SYSCFG_CFGR1_FPU_IE_0           (0x04000000UL)                         //---  Invalid operation Interrupt enable
#define SYSCFG_CFGR1_FPU_IE_1           (0x08000000UL)                         //---  Divide-by-zero Interrupt enable
#define SYSCFG_CFGR1_FPU_IE_2           (0x10000000UL)                         //---  Underflow Interrupt enable
#define SYSCFG_CFGR1_FPU_IE_3           (0x20000000UL)                         //---  Overflow Interrupt enable
#define SYSCFG_CFGR1_FPU_IE_4           (0x40000000UL)                         //---  Input denormal Interrupt enable
#define SYSCFG_CFGR1_FPU_IE_5           (0x80000000UL)                         //---  Inexact Interrupt enable (interrupt disabled at reset)

//---------------------------------------------------------------------------------------------
//---  Bit definition for SYSCFG_EXTICR1 register
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR1_EXTI0_Pos        (0U)
#define SYSCFG_EXTICR1_EXTI0_Msk        (0x7UL << SYSCFG_EXTICR1_EXTI0_Pos)    //--- 0x00000007
#define SYSCFG_EXTICR1_EXTI0            SYSCFG_EXTICR1_EXTI0_Msk               //----EXTI 0 configuration
#define SYSCFG_EXTICR1_EXTI1_Pos        (4U)
#define SYSCFG_EXTICR1_EXTI1_Msk        (0x7UL << SYSCFG_EXTICR1_EXTI1_Pos)    //--- 0x00000070
#define SYSCFG_EXTICR1_EXTI1            SYSCFG_EXTICR1_EXTI1_Msk               //----EXTI 1 configuration
#define SYSCFG_EXTICR1_EXTI2_Pos        (8U)
#define SYSCFG_EXTICR1_EXTI2_Msk        (0x7UL << SYSCFG_EXTICR1_EXTI2_Pos)    //--- 0x00000700
#define SYSCFG_EXTICR1_EXTI2            SYSCFG_EXTICR1_EXTI2_Msk               //----EXTI 2 configuration
#define SYSCFG_EXTICR1_EXTI3_Pos        (12U)
#define SYSCFG_EXTICR1_EXTI3_Msk        (0x7UL << SYSCFG_EXTICR1_EXTI3_Pos)    //--- 0x00007000
#define SYSCFG_EXTICR1_EXTI3            SYSCFG_EXTICR1_EXTI3_Msk               //----EXTI 3 configuration

//---------------------------------------------------------------------------------------------
//  @brief   EXTI0 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR1_EXTI0_PA             (0x00000000UL)                     //----PA[0] pin
#define SYSCFG_EXTICR1_EXTI0_PB             (0x00000001UL)                     //----PB[0] pin
#define SYSCFG_EXTICR1_EXTI0_PH             (0x00000007UL)                     //----PH[0] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI1 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR1_EXTI1_PA             (0x00000000UL)                     //----PA[1] pin
#define SYSCFG_EXTICR1_EXTI1_PB             (0x00000010UL)                     //----PB[1] pin
#define SYSCFG_EXTICR1_EXTI1_PH             (0x00000070UL)                     //----PH[1] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI2 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR1_EXTI2_PA             (0x00000000UL)                     //----PA[2] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI3 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR1_EXTI3_PA             (0x00000000UL)                     //----PA[3] pin
#define SYSCFG_EXTICR1_EXTI3_PB             (0x00001000UL)                     //----PB[3] pin
#define SYSCFG_EXTICR1_EXTI3_PG             (0x00006000UL)                     //----PG[3] pin

//---------------------------------------------------------------------------------------------
//---  Bit definition for SYSCFG_EXTICR2 register
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR2_EXTI4_Pos        (0U)
#define SYSCFG_EXTICR2_EXTI4_Msk        (0x7UL << SYSCFG_EXTICR2_EXTI4_Pos)    //--- 0x00000007
#define SYSCFG_EXTICR2_EXTI4            SYSCFG_EXTICR2_EXTI4_Msk               //----EXTI 4 configuration
#define SYSCFG_EXTICR2_EXTI5_Pos        (4U)
#define SYSCFG_EXTICR2_EXTI5_Msk        (0x7UL << SYSCFG_EXTICR2_EXTI5_Pos)    //--- 0x00000070
#define SYSCFG_EXTICR2_EXTI5            SYSCFG_EXTICR2_EXTI5_Msk               //----EXTI 5 configuration
#define SYSCFG_EXTICR2_EXTI6_Pos        (8U)
#define SYSCFG_EXTICR2_EXTI6_Msk        (0x7UL << SYSCFG_EXTICR2_EXTI6_Pos)    //--- 0x00000700
#define SYSCFG_EXTICR2_EXTI6            SYSCFG_EXTICR2_EXTI6_Msk               //----EXTI 6 configuration
#define SYSCFG_EXTICR2_EXTI7_Pos        (12U)
#define SYSCFG_EXTICR2_EXTI7_Msk        (0x7UL << SYSCFG_EXTICR2_EXTI7_Pos)    //--- 0x00007000
#define SYSCFG_EXTICR2_EXTI7            SYSCFG_EXTICR2_EXTI7_Msk               //----EXTI 7 configuration
//---------------------------------------------------------------------------------------------
//  @brief   EXTI4 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR2_EXTI4_PA             (0x00000000UL)                     //----PA[4] pin
#define SYSCFG_EXTICR2_EXTI4_PB             (0x00000001UL)                     //----PB[4] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI5 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR2_EXTI5_PA             (0x00000000UL)                     //----PA[5] pin
#define SYSCFG_EXTICR2_EXTI5_PB             (0x00000010UL)                     //----PB[5] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI6 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR2_EXTI6_PA             (0x00000000UL)                     //----PA[6] pin
#define SYSCFG_EXTICR2_EXTI6_PB             (0x00000100UL)                     //----PB[6] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI7 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR2_EXTI7_PA             (0x00000000UL)                     //----PA[7] pin
#define SYSCFG_EXTICR2_EXTI7_PB             (0x00001000UL)                     //----PB[7] pin

//---------------------------------------------------------------------------------------------
//---  Bit definition for SYSCFG_EXTICR3 register
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR3_EXTI8_Pos        (0U)
#define SYSCFG_EXTICR3_EXTI8_Msk        (0x7UL << SYSCFG_EXTICR3_EXTI8_Pos)    //--- 0x00000007
#define SYSCFG_EXTICR3_EXTI8            SYSCFG_EXTICR3_EXTI8_Msk               //----EXTI 8 configuration
#define SYSCFG_EXTICR3_EXTI9_Pos        (4U)
#define SYSCFG_EXTICR3_EXTI9_Msk        (0x7UL << SYSCFG_EXTICR3_EXTI9_Pos)    //--- 0x00000070
#define SYSCFG_EXTICR3_EXTI9            SYSCFG_EXTICR3_EXTI9_Msk               //----EXTI 9 configuration
#define SYSCFG_EXTICR3_EXTI10_Pos       (8U)
#define SYSCFG_EXTICR3_EXTI10_Msk       (0x7UL << SYSCFG_EXTICR3_EXTI10_Pos)   //--- 0x00000700
#define SYSCFG_EXTICR3_EXTI10           SYSCFG_EXTICR3_EXTI10_Msk              //----EXTI 10 configuration
#define SYSCFG_EXTICR3_EXTI11_Pos       (12U)
#define SYSCFG_EXTICR3_EXTI11_Msk       (0x7UL << SYSCFG_EXTICR3_EXTI11_Pos)   //--- 0x00007000
#define SYSCFG_EXTICR3_EXTI11           SYSCFG_EXTICR3_EXTI11_Msk              //----EXTI 11 configuration

//---------------------------------------------------------------------------------------------
//  @brief   EXTI8 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR3_EXTI8_PA             (0x00000000UL)                     //----PA[8] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI9 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR3_EXTI9_PA             (0x00000000UL)                     //----PA[9] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI10 configuration
//---------------------------------------------------------------------------------------------

#define SYSCFG_EXTICR3_EXTI10_PA            (0x00000000UL)                     //----PA[10] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI11 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR3_EXTI11_PA            (0x00000000UL)                     //----PA[11] pin

//---------------------------------------------------------------------------------------------
//---  Bit definition for SYSCFG_EXTICR4 register
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR4_EXTI12_Pos       (0U)
#define SYSCFG_EXTICR4_EXTI12_Msk       (0x7UL << SYSCFG_EXTICR4_EXTI12_Pos)   //--- 0x00000007
#define SYSCFG_EXTICR4_EXTI12           SYSCFG_EXTICR4_EXTI12_Msk              //----EXTI 12 configuration
#define SYSCFG_EXTICR4_EXTI13_Pos       (4U)
#define SYSCFG_EXTICR4_EXTI13_Msk       (0x7UL << SYSCFG_EXTICR4_EXTI13_Pos)   //--- 0x00000070
#define SYSCFG_EXTICR4_EXTI13           SYSCFG_EXTICR4_EXTI13_Msk              //----EXTI 13 configuration
#define SYSCFG_EXTICR4_EXTI14_Pos       (8U)
#define SYSCFG_EXTICR4_EXTI14_Msk       (0x7UL << SYSCFG_EXTICR4_EXTI14_Pos)   //--- 0x00000700
#define SYSCFG_EXTICR4_EXTI14           SYSCFG_EXTICR4_EXTI14_Msk              //----EXTI 14 configuration
#define SYSCFG_EXTICR4_EXTI15_Pos       (12U)
#define SYSCFG_EXTICR4_EXTI15_Msk       (0x7UL << SYSCFG_EXTICR4_EXTI15_Pos)   //--- 0x00007000
#define SYSCFG_EXTICR4_EXTI15           SYSCFG_EXTICR4_EXTI15_Msk              //----EXTI 15 configuration

//---------------------------------------------------------------------------------------------
//  @brief   EXTI12 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR4_EXTI12_PA            (0x00000000UL)                     //----PA[12] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI13 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR4_EXTI13_PA            (0x00000000UL)                     //----PA[13] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI14 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR4_EXTI14_PA            (0x00000000UL)                     //----PA[14] pin
#define SYSCFG_EXTICR4_EXTI14_PC            (0x00000200UL)                     //----PC[14] pin

//---------------------------------------------------------------------------------------------
//  @brief   EXTI15 configuration
//---------------------------------------------------------------------------------------------
#define SYSCFG_EXTICR4_EXTI15_PA            (0x00000000UL)                     //----PA[15] pin
#define SYSCFG_EXTICR4_EXTI15_PC            (0x00002000UL)                     //----PC[15] pin

//---------------------------------------------------------------------------------------------
//---   Bit definition for SYSCFG_SCSR register
//---------------------------------------------------------------------------------------------
#define SYSCFG_SCSR_SRAM2ER_Pos         (0U)
#define SYSCFG_SCSR_SRAM2ER_Msk         (0x1UL << SYSCFG_SCSR_SRAM2ER_Pos)     //--- 0x00000001
#define SYSCFG_SCSR_SRAM2ER             SYSCFG_SCSR_SRAM2ER_Msk                //--- SRAM2 Erase Request
#define SYSCFG_SCSR_SRAM2BSY_Pos        (1U)
#define SYSCFG_SCSR_SRAM2BSY_Msk        (0x1UL << SYSCFG_SCSR_SRAM2BSY_Pos)    //--- 0x00000002
#define SYSCFG_SCSR_SRAM2BSY            SYSCFG_SCSR_SRAM2BSY_Msk               //--- SRAM2 Erase Ongoing

