Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---   Bit definition for SYSCFG_CFGR2 register
//---------------------------------------------------------------------------------------------
#define SYSCFG_CFGR2_CLL_Pos            (0U)
#define SYSCFG_CFGR2_CLL_Msk            (0x1UL << SYSCFG_CFGR2_CLL_Pos)        //--- 0x00000001
#define SYSCFG_CFGR2_CLL                SYSCFG_CFGR2_CLL_Msk                   //--- Core Lockup Lock
#define SYSCFG_CFGR2_SPL_Pos            (1U)
#define SYSCFG_CFGR2_SPL_Msk            (0x1UL << SYSCFG_CFGR2_SPL_Pos)        //--- 0x00000002
#define SYSCFG_CFGR2_SPL                SYSCFG_CFGR2_SPL_Msk                   //--- SRAM Parity Lock
#define SYSCFG_CFGR2_PVDL_Pos           (2U)
#define SYSCFG_CFGR2_PVDL_Msk           (0x1UL << SYSCFG_CFGR2_PVDL_Pos)       //--- 0x00000004
#define SYSCFG_CFGR2_PVDL               SYSCFG_CFGR2_PVDL_Msk                  //---  PVD Lock
#define SYSCFG_CFGR2_ECCL_Pos           (3U)
#define SYSCFG_CFGR2_ECCL_Msk           (0x1UL << SYSCFG_CFGR2_ECCL_Pos)       //--- 0x00000008
#define SYSCFG_CFGR2_ECCL               SYSCFG_CFGR2_ECCL_Msk                  //--- ECC Lock
#define SYSCFG_CFGR2_SPF_Pos            (8U)
#define SYSCFG_CFGR2_SPF_Msk            (0x1UL << SYSCFG_CFGR2_SPF_Pos)        //--- 0x00000100
#define SYSCFG_CFGR2_SPF                SYSCFG_CFGR2_SPF_Msk                   //--- SRAM Parity Flag

//----------------------------------------------------------------------------------------------
//---  Bit definition for SYSCFG_SWPR register
//----------------------------------------------------------------------------------------------
#define SYSCFG_SWPR_PAGE0_Pos           (0U)
#define SYSCFG_SWPR_PAGE0_Msk           (0x1UL << SYSCFG_SWPR_PAGE0_Pos)       //--- 0x00000001
#define SYSCFG_SWPR_PAGE0               SYSCFG_SWPR_PAGE0_Msk                  //--- SRAM2 Write protection page 0
#define SYSCFG_SWPR_PAGE1_Pos           (1U)
#define SYSCFG_SWPR_PAGE1_Msk           (0x1UL << SYSCFG_SWPR_PAGE1_Pos)       //--- 0x00000002
#define SYSCFG_SWPR_PAGE1               SYSCFG_SWPR_PAGE1_Msk                  //--- SRAM2 Write protection page 1
#define SYSCFG_SWPR_PAGE2_Pos           (2U)
#define SYSCFG_SWPR_PAGE2_Msk           (0x1UL << SYSCFG_SWPR_PAGE2_Pos)       //--- 0x00000004
#define SYSCFG_SWPR_PAGE2               SYSCFG_SWPR_PAGE2_Msk                  //--- SRAM2 Write protection page 2
#define SYSCFG_SWPR_PAGE3_Pos           (3U)
#define SYSCFG_SWPR_PAGE3_Msk           (0x1UL << SYSCFG_SWPR_PAGE3_Pos)       //--- 0x00000008
#define SYSCFG_SWPR_PAGE3               SYSCFG_SWPR_PAGE3_Msk                  //--- SRAM2 Write protection page 3
#define SYSCFG_SWPR_PAGE4_Pos           (4U)
#define SYSCFG_SWPR_PAGE4_Msk           (0x1UL << SYSCFG_SWPR_PAGE4_Pos)       //--- 0x00000010
#define SYSCFG_SWPR_PAGE4               SYSCFG_SWPR_PAGE4_Msk                  //--- SRAM2 Write protection page 4
#define SYSCFG_SWPR_PAGE5_Pos           (5U)
#define SYSCFG_SWPR_PAGE5_Msk           (0x1UL << SYSCFG_SWPR_PAGE5_Pos)       //--- 0x00000020
#define SYSCFG_SWPR_PAGE5               SYSCFG_SWPR_PAGE5_Msk                  //--- SRAM2 Write protection page 5
#define SYSCFG_SWPR_PAGE6_Pos           (6U)
#define SYSCFG_SWPR_PAGE6_Msk           (0x1UL << SYSCFG_SWPR_PAGE6_Pos)       //--- 0x00000040
#define SYSCFG_SWPR_PAGE6               SYSCFG_SWPR_PAGE6_Msk                  //--- SRAM2 Write protection page 6
#define SYSCFG_SWPR_PAGE7_Pos           (7U)
#define SYSCFG_SWPR_PAGE7_Msk           (0x1UL << SYSCFG_SWPR_PAGE7_Pos)       //--- 0x00000080
#define SYSCFG_SWPR_PAGE7               SYSCFG_SWPR_PAGE7_Msk                  //--- SRAM2 Write protection page 7
#define SYSCFG_SWPR_PAGE8_Pos           (8U)
#define SYSCFG_SWPR_PAGE8_Msk           (0x1UL << SYSCFG_SWPR_PAGE8_Pos)       //--- 0x00000100
#define SYSCFG_SWPR_PAGE8               SYSCFG_SWPR_PAGE8_Msk                  //--- SRAM2 Write protection page 8
#define SYSCFG_SWPR_PAGE9_Pos           (9U)
#define SYSCFG_SWPR_PAGE9_Msk           (0x1UL << SYSCFG_SWPR_PAGE9_Pos)       //--- 0x00000200
#define SYSCFG_SWPR_PAGE9               SYSCFG_SWPR_PAGE9_Msk                  //--- SRAM2 Write protection page 9
#define SYSCFG_SWPR_PAGE10_Pos          (10U)
#define SYSCFG_SWPR_PAGE10_Msk          (0x1UL << SYSCFG_SWPR_PAGE10_Pos)      //--- 0x00000400
#define SYSCFG_SWPR_PAGE10              SYSCFG_SWPR_PAGE10_Msk                 //--- SRAM2 Write protection page 10
#define SYSCFG_SWPR_PAGE11_Pos          (11U)
#define SYSCFG_SWPR_PAGE11_Msk          (0x1UL << SYSCFG_SWPR_PAGE11_Pos)      //--- 0x00000800
#define SYSCFG_SWPR_PAGE11              SYSCFG_SWPR_PAGE11_Msk                 //--- SRAM2 Write protection page 11
#define SYSCFG_SWPR_PAGE12_Pos          (12U)
#define SYSCFG_SWPR_PAGE12_Msk          (0x1UL << SYSCFG_SWPR_PAGE12_Pos)      //--- 0x00001000
#define SYSCFG_SWPR_PAGE12              SYSCFG_SWPR_PAGE12_Msk                 //--- SRAM2 Write protection page 12
#define SYSCFG_SWPR_PAGE13_Pos          (13U)
#define SYSCFG_SWPR_PAGE13_Msk          (0x1UL << SYSCFG_SWPR_PAGE13_Pos)      //--- 0x00002000
#define SYSCFG_SWPR_PAGE13              SYSCFG_SWPR_PAGE13_Msk                 //--- SRAM2 Write protection page 13
#define SYSCFG_SWPR_PAGE14_Pos          (14U)
#define SYSCFG_SWPR_PAGE14_Msk          (0x1UL << SYSCFG_SWPR_PAGE14_Pos)      //--- 0x00004000
#define SYSCFG_SWPR_PAGE14              SYSCFG_SWPR_PAGE14_Msk                 //--- SRAM2 Write protection page 14
#define SYSCFG_SWPR_PAGE15_Pos          (15U)
#define SYSCFG_SWPR_PAGE15_Msk          (0x1UL << SYSCFG_SWPR_PAGE15_Pos)      //--- 0x00008000
#define SYSCFG_SWPR_PAGE15              SYSCFG_SWPR_PAGE15_Msk                 //--- SRAM2 Write protection page 15

//----------------------------------------------------------------------------------------------
//---   Bit definition for SYSCFG_SKR register
//----------------------------------------------------------------------------------------------
#define SYSCFG_SKR_KEY_Pos              (0U)
#define SYSCFG_SKR_KEY_Msk              (0xFFUL << SYSCFG_SKR_KEY_Pos)         //--- 0x000000FF
#define SYSCFG_SKR_KEY                  SYSCFG_SKR_KEY_Msk                     //---  SRAM2 write protection key for software erase


