Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//----------------------------------------------------------------------------------------------
//--- Bit definition for TIM_CR1 register
//----------------------------------------------------------------------------------------------
#define TIM_CR1_CEN_Pos           (0U)
#define TIM_CR1_CEN_Msk           (0x1UL << TIM_CR1_CEN_Pos)                   //--- 0x00000001
#define TIM_CR1_CEN               TIM_CR1_CEN_Msk                              //----Counter enable
#define TIM_CR1_UDIS_Pos          (1U)
#define TIM_CR1_UDIS_Msk          (0x1UL << TIM_CR1_UDIS_Pos)                  //--- 0x00000002
#define TIM_CR1_UDIS              TIM_CR1_UDIS_Msk                             //----Update disable
#define TIM_CR1_URS_Pos           (2U)
#define TIM_CR1_URS_Msk           (0x1UL << TIM_CR1_URS_Pos)                   //--- 0x00000004
#define TIM_CR1_URS               TIM_CR1_URS_Msk                              //----Update request source
#define TIM_CR1_OPM_Pos           (3U)
#define TIM_CR1_OPM_Msk           (0x1UL << TIM_CR1_OPM_Pos)                   //--- 0x00000008
#define TIM_CR1_OPM               TIM_CR1_OPM_Msk                              //----One pulse mode
#define TIM_CR1_DIR_Pos           (4U)
#define TIM_CR1_DIR_Msk           (0x1UL << TIM_CR1_DIR_Pos)                   //--- 0x00000010
#define TIM_CR1_DIR               TIM_CR1_DIR_Msk                              //----Direction

#define TIM_CR1_CMS_Pos           (5U)
#define TIM_CR1_CMS_Msk           (0x3UL << TIM_CR1_CMS_Pos)                   //--- 0x00000060
#define TIM_CR1_CMS               TIM_CR1_CMS_Msk                              //----CMS[1:0] bits (Center-aligned mode selection)
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_Pos)                   //--- 0x00000020
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_Pos)                   //--- 0x00000040

#define TIM_CR1_ARPE_Pos          (7U)
#define TIM_CR1_ARPE_Msk          (0x1UL << TIM_CR1_ARPE_Pos)                  //--- 0x00000080
#define TIM_CR1_ARPE              TIM_CR1_ARPE_Msk                             //----Auto-reload preload enable

#define TIM_CR1_CKD_Pos           (8U)
#define TIM_CR1_CKD_Msk           (0x3UL << TIM_CR1_CKD_Pos)                   //--- 0x00000300
#define TIM_CR1_CKD               TIM_CR1_CKD_Msk                              //----CKD[1:0] bits (clock division)
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_Pos)                   //--- 0x00000100
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_Pos)                   //--- 0x00000200

#define TIM_CR1_UIFREMAP_Pos      (11U)
#define TIM_CR1_UIFREMAP_Msk      (0x1UL << TIM_CR1_UIFREMAP_Pos)              //--- 0x00000800
#define TIM_CR1_UIFREMAP          TIM_CR1_UIFREMAP_Msk                         //----Update interrupt flag remap

//----------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CR2 register
//----------------------------------------------------------------------------------------------
#define TIM_CR2_CCPC_Pos          (0U)
#define TIM_CR2_CCPC_Msk          (0x1UL << TIM_CR2_CCPC_Pos)                  //--- 0x00000001
#define TIM_CR2_CCPC              TIM_CR2_CCPC_Msk                             //----Capture/Compare Preloaded Control
#define TIM_CR2_CCUS_Pos          (2U)
#define TIM_CR2_CCUS_Msk          (0x1UL << TIM_CR2_CCUS_Pos)                  //--- 0x00000004
#define TIM_CR2_CCUS              TIM_CR2_CCUS_Msk                             //----Capture/Compare Control Update Selection
#define TIM_CR2_CCDS_Pos          (3U)
#define TIM_CR2_CCDS_Msk          (0x1UL << TIM_CR2_CCDS_Pos)                  //--- 0x00000008
#define TIM_CR2_CCDS              TIM_CR2_CCDS_Msk                             //----Capture/Compare DMA Selection

#define TIM_CR2_MMS_Pos           (4U)
#define TIM_CR2_MMS_Msk           (0x7UL << TIM_CR2_MMS_Pos)                   //--- 0x00000070
#define TIM_CR2_MMS               TIM_CR2_MMS_Msk                              //----MMS[2:0] bits (Master Mode Selection)
#define TIM_CR2_MMS_0             (0x1UL << TIM_CR2_MMS_Pos)                   //--- 0x00000010
#define TIM_CR2_MMS_1             (0x2UL << TIM_CR2_MMS_Pos)                   //--- 0x00000020
#define TIM_CR2_MMS_2             (0x4UL << TIM_CR2_MMS_Pos)                   //--- 0x00000040

#define TIM_CR2_TI1S_Pos          (7U)
#define TIM_CR2_TI1S_Msk          (0x1UL << TIM_CR2_TI1S_Pos)                  //--- 0x00000080
#define TIM_CR2_TI1S              TIM_CR2_TI1S_Msk                             //----TI1 Selection
#define TIM_CR2_OIS1_Pos          (8U)
#define TIM_CR2_OIS1_Msk          (0x1UL << TIM_CR2_OIS1_Pos)                  //--- 0x00000100
#define TIM_CR2_OIS1              TIM_CR2_OIS1_Msk                             //--- Output Idle state 1 (OC1 output)
#define TIM_CR2_OIS1N_Pos         (9U)
#define TIM_CR2_OIS1N_Msk         (0x1UL << TIM_CR2_OIS1N_Pos)                 //--- 0x00000200
#define TIM_CR2_OIS1N             TIM_CR2_OIS1N_Msk                            //--- Output Idle state 1 (OC1N output)
#define TIM_CR2_OIS2_Pos          (10U)
#define TIM_CR2_OIS2_Msk          (0x1UL << TIM_CR2_OIS2_Pos)                  //--- 0x00000400
#define TIM_CR2_OIS2              TIM_CR2_OIS2_Msk                             //--- Output Idle state 2 (OC2 output)
#define TIM_CR2_OIS2N_Pos         (11U)
#define TIM_CR2_OIS2N_Msk         (0x1UL << TIM_CR2_OIS2N_Pos)                 //--- 0x00000800
#define TIM_CR2_OIS2N             TIM_CR2_OIS2N_Msk                            //--- Output Idle state 2 (OC2N output)
#define TIM_CR2_OIS3_Pos          (12U)
#define TIM_CR2_OIS3_Msk          (0x1UL << TIM_CR2_OIS3_Pos)                  //--- 0x00001000
#define TIM_CR2_OIS3              TIM_CR2_OIS3_Msk                             //--- Output Idle state 3 (OC3 output)
#define TIM_CR2_OIS3N_Pos         (13U)
#define TIM_CR2_OIS3N_Msk         (0x1UL << TIM_CR2_OIS3N_Pos)                 //--- 0x00002000
#define TIM_CR2_OIS3N             TIM_CR2_OIS3N_Msk                            //--- Output Idle state 3 (OC3N output)
#define TIM_CR2_OIS4_Pos          (14U)
#define TIM_CR2_OIS4_Msk          (0x1UL << TIM_CR2_OIS4_Pos)                  //--- 0x00004000
#define TIM_CR2_OIS4              TIM_CR2_OIS4_Msk                             //--- Output Idle state 4 (OC4 output)
#define TIM_CR2_OIS5_Pos          (16U)
#define TIM_CR2_OIS5_Msk          (0x1UL << TIM_CR2_OIS5_Pos)                  //--- 0x00010000
#define TIM_CR2_OIS5              TIM_CR2_OIS5_Msk                             //--- Output Idle state 5 (OC5 output)
#define TIM_CR2_OIS6_Pos          (18U)
#define TIM_CR2_OIS6_Msk          (0x1UL << TIM_CR2_OIS6_Pos)                  //--- 0x00040000
#define TIM_CR2_OIS6              TIM_CR2_OIS6_Msk                             //--- Output Idle state 6 (OC6 output)

#define TIM_CR2_MMS2_Pos          (20U)
#define TIM_CR2_MMS2_Msk          (0xFUL << TIM_CR2_MMS2_Pos)                  //--- 0x00F00000
#define TIM_CR2_MMS2              TIM_CR2_MMS2_Msk                             //--- MMS[2:0] bits (Master Mode Selection)
#define TIM_CR2_MMS2_0            (0x1UL << TIM_CR2_MMS2_Pos)                  //--- 0x00100000
#define TIM_CR2_MMS2_1            (0x2UL << TIM_CR2_MMS2_Pos)                  //--- 0x00200000
#define TIM_CR2_MMS2_2            (0x4UL << TIM_CR2_MMS2_Pos)                  //--- 0x00400000
#define TIM_CR2_MMS2_3            (0x8UL << TIM_CR2_MMS2_Pos)                  //--- 0x00800000

