Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//----------------------------------------------------------------------------------------------
//---  Bit definition for TIM_SMCR register
//----------------------------------------------------------------------------------------------
#define TIM_SMCR_SMS_Pos          (0U)
#define TIM_SMCR_SMS_Msk          (0x10007UL << TIM_SMCR_SMS_Pos)              //--- 0x00010007
#define TIM_SMCR_SMS              TIM_SMCR_SMS_Msk                             //----SMS[2:0] bits (Slave mode selection)
#define TIM_SMCR_SMS_0            (0x00001UL << TIM_SMCR_SMS_Pos)              //--- 0x00000001
#define TIM_SMCR_SMS_1            (0x00002UL << TIM_SMCR_SMS_Pos)              //--- 0x00000002
#define TIM_SMCR_SMS_2            (0x00004UL << TIM_SMCR_SMS_Pos)              //--- 0x00000004
#define TIM_SMCR_SMS_3            (0x10000UL << TIM_SMCR_SMS_Pos)              //--- 0x00010000

#define TIM_SMCR_OCCS_Pos         (3U)
#define TIM_SMCR_OCCS_Msk         (0x1UL << TIM_SMCR_OCCS_Pos)                 //--- 0x00000008
#define TIM_SMCR_OCCS             TIM_SMCR_OCCS_Msk                            //--- OCREF clear selection

#define TIM_SMCR_TS_Pos           (4U)
#define TIM_SMCR_TS_Msk           (0x7UL << TIM_SMCR_TS_Pos)                   //--- 0x00000070
#define TIM_SMCR_TS               TIM_SMCR_TS_Msk                              //----TS[2:0] bits (Trigger selection)
#define TIM_SMCR_TS_0             (0x1UL << TIM_SMCR_TS_Pos)                   //--- 0x00000010
#define TIM_SMCR_TS_1             (0x2UL << TIM_SMCR_TS_Pos)                   //--- 0x00000020
#define TIM_SMCR_TS_2             (0x4UL << TIM_SMCR_TS_Pos)                   //--- 0x00000040

#define TIM_SMCR_MSM_Pos          (7U)
#define TIM_SMCR_MSM_Msk          (0x1UL << TIM_SMCR_MSM_Pos)                  //--- 0x00000080
#define TIM_SMCR_MSM              TIM_SMCR_MSM_Msk                             //----Master/slave mode

#define TIM_SMCR_ETF_Pos          (8U)
#define TIM_SMCR_ETF_Msk          (0xFUL << TIM_SMCR_ETF_Pos)                  //--- 0x00000F00
#define TIM_SMCR_ETF              TIM_SMCR_ETF_Msk                             //----ETF[3:0] bits (External trigger filter)
#define TIM_SMCR_ETF_0            (0x1UL << TIM_SMCR_ETF_Pos)                  //--- 0x00000100
#define TIM_SMCR_ETF_1            (0x2UL << TIM_SMCR_ETF_Pos)                  //--- 0x00000200
#define TIM_SMCR_ETF_2            (0x4UL << TIM_SMCR_ETF_Pos)                  //--- 0x00000400
#define TIM_SMCR_ETF_3            (0x8UL << TIM_SMCR_ETF_Pos)                  //--- 0x00000800

#define TIM_SMCR_ETPS_Pos         (12U)
#define TIM_SMCR_ETPS_Msk         (0x3UL << TIM_SMCR_ETPS_Pos)                 //--- 0x00003000
#define TIM_SMCR_ETPS             TIM_SMCR_ETPS_Msk                            //----ETPS[1:0] bits (External trigger prescaler)
#define TIM_SMCR_ETPS_0           (0x1UL << TIM_SMCR_ETPS_Pos)                 //--- 0x00001000
#define TIM_SMCR_ETPS_1           (0x2UL << TIM_SMCR_ETPS_Pos)                 //--- 0x00002000

#define TIM_SMCR_ECE_Pos          (14U)
#define TIM_SMCR_ECE_Msk          (0x1UL << TIM_SMCR_ECE_Pos)                  //--- 0x00004000
#define TIM_SMCR_ECE              TIM_SMCR_ECE_Msk                             //----External clock enable
#define TIM_SMCR_ETP_Pos          (15U)
#define TIM_SMCR_ETP_Msk          (0x1UL << TIM_SMCR_ETP_Pos)                  //--- 0x00008000
#define TIM_SMCR_ETP              TIM_SMCR_ETP_Msk                             //----External trigger polarity

//----------------------------------------------------------------------------------------------
//---   Bit definition for TIM_DIER register
//----------------------------------------------------------------------------------------------
#define TIM_DIER_UIE_Pos          (0U)
#define TIM_DIER_UIE_Msk          (0x1UL << TIM_DIER_UIE_Pos)                  //--- 0x00000001
#define TIM_DIER_UIE              TIM_DIER_UIE_Msk                             //----Update interrupt enable
#define TIM_DIER_CC1IE_Pos        (1U)
#define TIM_DIER_CC1IE_Msk        (0x1UL << TIM_DIER_CC1IE_Pos)                //--- 0x00000002
#define TIM_DIER_CC1IE            TIM_DIER_CC1IE_Msk                           //----Capture/Compare 1 interrupt enable
#define TIM_DIER_CC2IE_Pos        (2U)
#define TIM_DIER_CC2IE_Msk        (0x1UL << TIM_DIER_CC2IE_Pos)                //--- 0x00000004
#define TIM_DIER_CC2IE            TIM_DIER_CC2IE_Msk                           //----Capture/Compare 2 interrupt enable
#define TIM_DIER_CC3IE_Pos        (3U)
#define TIM_DIER_CC3IE_Msk        (0x1UL << TIM_DIER_CC3IE_Pos)                //--- 0x00000008
#define TIM_DIER_CC3IE            TIM_DIER_CC3IE_Msk                           //----Capture/Compare 3 interrupt enable
#define TIM_DIER_CC4IE_Pos        (4U)
#define TIM_DIER_CC4IE_Msk        (0x1UL << TIM_DIER_CC4IE_Pos)                //--- 0x00000010
#define TIM_DIER_CC4IE            TIM_DIER_CC4IE_Msk                           //----Capture/Compare 4 interrupt enable
#define TIM_DIER_COMIE_Pos        (5U)
#define TIM_DIER_COMIE_Msk        (0x1UL << TIM_DIER_COMIE_Pos)                //--- 0x00000020
#define TIM_DIER_COMIE            TIM_DIER_COMIE_Msk                           //----COM interrupt enable
#define TIM_DIER_TIE_Pos          (6U)
#define TIM_DIER_TIE_Msk          (0x1UL << TIM_DIER_TIE_Pos)                  //--- 0x00000040
#define TIM_DIER_TIE              TIM_DIER_TIE_Msk                             //----Trigger interrupt enable
#define TIM_DIER_BIE_Pos          (7U)
#define TIM_DIER_BIE_Msk          (0x1UL << TIM_DIER_BIE_Pos)                  //--- 0x00000080
#define TIM_DIER_BIE              TIM_DIER_BIE_Msk                             //----Break interrupt enable
#define TIM_DIER_UDE_Pos          (8U)
#define TIM_DIER_UDE_Msk          (0x1UL << TIM_DIER_UDE_Pos)                  //--- 0x00000100
#define TIM_DIER_UDE              TIM_DIER_UDE_Msk                             //----Update DMA request enable
#define TIM_DIER_CC1DE_Pos        (9U)
#define TIM_DIER_CC1DE_Msk        (0x1UL << TIM_DIER_CC1DE_Pos)                //--- 0x00000200
#define TIM_DIER_CC1DE            TIM_DIER_CC1DE_Msk                           //----Capture/Compare 1 DMA request enable
#define TIM_DIER_CC2DE_Pos        (10U)
#define TIM_DIER_CC2DE_Msk        (0x1UL << TIM_DIER_CC2DE_Pos)                //--- 0x00000400
#define TIM_DIER_CC2DE            TIM_DIER_CC2DE_Msk                           //----Capture/Compare 2 DMA request enable
#define TIM_DIER_CC3DE_Pos        (11U)
#define TIM_DIER_CC3DE_Msk        (0x1UL << TIM_DIER_CC3DE_Pos)                //--- 0x00000800
#define TIM_DIER_CC3DE            TIM_DIER_CC3DE_Msk                           //----Capture/Compare 3 DMA request enable
#define TIM_DIER_CC4DE_Pos        (12U)
#define TIM_DIER_CC4DE_Msk        (0x1UL << TIM_DIER_CC4DE_Pos)                //--- 0x00001000
#define TIM_DIER_CC4DE            TIM_DIER_CC4DE_Msk                           //----Capture/Compare 4 DMA request enable
#define TIM_DIER_COMDE_Pos        (13U)
#define TIM_DIER_COMDE_Msk        (0x1UL << TIM_DIER_COMDE_Pos)                //--- 0x00002000
#define TIM_DIER_COMDE            TIM_DIER_COMDE_Msk                           //----COM DMA request enable
#define TIM_DIER_TDE_Pos          (14U)
#define TIM_DIER_TDE_Msk          (0x1UL << TIM_DIER_TDE_Pos)                  //--- 0x00004000
#define TIM_DIER_TDE              TIM_DIER_TDE_Msk                             //----Trigger DMA request enable

