Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//----------------------------------------------------------------------------------------------
//--- Bit definition for TIM_SR register
//----------------------------------------------------------------------------------------------
#define TIM_SR_UIF_Pos            (0U)
#define TIM_SR_UIF_Msk            (0x1UL << TIM_SR_UIF_Pos)                    //--- 0x00000001
#define TIM_SR_UIF                TIM_SR_UIF_Msk                               //----Update interrupt Flag
#define TIM_SR_CC1IF_Pos          (1U)
#define TIM_SR_CC1IF_Msk          (0x1UL << TIM_SR_CC1IF_Pos)                  //--- 0x00000002
#define TIM_SR_CC1IF              TIM_SR_CC1IF_Msk                             //----Capture/Compare 1 interrupt Flag
#define TIM_SR_CC2IF_Pos          (2U)
#define TIM_SR_CC2IF_Msk          (0x1UL << TIM_SR_CC2IF_Pos)                  //--- 0x00000004
#define TIM_SR_CC2IF              TIM_SR_CC2IF_Msk                             //----Capture/Compare 2 interrupt Flag
#define TIM_SR_CC3IF_Pos          (3U)
#define TIM_SR_CC3IF_Msk          (0x1UL << TIM_SR_CC3IF_Pos)                  //--- 0x00000008
#define TIM_SR_CC3IF              TIM_SR_CC3IF_Msk                             //----Capture/Compare 3 interrupt Flag
#define TIM_SR_CC4IF_Pos          (4U)
#define TIM_SR_CC4IF_Msk          (0x1UL << TIM_SR_CC4IF_Pos)                  //--- 0x00000010
#define TIM_SR_CC4IF              TIM_SR_CC4IF_Msk                             //----Capture/Compare 4 interrupt Flag
#define TIM_SR_COMIF_Pos          (5U)
#define TIM_SR_COMIF_Msk          (0x1UL << TIM_SR_COMIF_Pos)                  //--- 0x00000020
#define TIM_SR_COMIF              TIM_SR_COMIF_Msk                             //----COM interrupt Flag
#define TIM_SR_TIF_Pos            (6U)
#define TIM_SR_TIF_Msk            (0x1UL << TIM_SR_TIF_Pos)                    //--- 0x00000040
#define TIM_SR_TIF                TIM_SR_TIF_Msk                               //----Trigger interrupt Flag
#define TIM_SR_BIF_Pos            (7U)
#define TIM_SR_BIF_Msk            (0x1UL << TIM_SR_BIF_Pos)                    //--- 0x00000080
#define TIM_SR_BIF                TIM_SR_BIF_Msk                               //----Break interrupt Flag
#define TIM_SR_B2IF_Pos           (8U)
#define TIM_SR_B2IF_Msk           (0x1UL << TIM_SR_B2IF_Pos)                   //--- 0x00000100
#define TIM_SR_B2IF               TIM_SR_B2IF_Msk                              //----Break 2 interrupt Flag
#define TIM_SR_CC1OF_Pos          (9U)
#define TIM_SR_CC1OF_Msk          (0x1UL << TIM_SR_CC1OF_Pos)                  //--- 0x00000200
#define TIM_SR_CC1OF              TIM_SR_CC1OF_Msk                             //----Capture/Compare 1 Overcapture Flag
#define TIM_SR_CC2OF_Pos          (10U)
#define TIM_SR_CC2OF_Msk          (0x1UL << TIM_SR_CC2OF_Pos)                  //--- 0x00000400
#define TIM_SR_CC2OF              TIM_SR_CC2OF_Msk                             //----Capture/Compare 2 Overcapture Flag
#define TIM_SR_CC3OF_Pos          (11U)
#define TIM_SR_CC3OF_Msk          (0x1UL << TIM_SR_CC3OF_Pos)                  //--- 0x00000800
#define TIM_SR_CC3OF              TIM_SR_CC3OF_Msk                             //----Capture/Compare 3 Overcapture Flag
#define TIM_SR_CC4OF_Pos          (12U)
#define TIM_SR_CC4OF_Msk          (0x1UL << TIM_SR_CC4OF_Pos)                  //--- 0x00001000
#define TIM_SR_CC4OF              TIM_SR_CC4OF_Msk                             //----Capture/Compare 4 Overcapture Flag
#define TIM_SR_SBIF_Pos           (13U)
#define TIM_SR_SBIF_Msk           (0x1UL << TIM_SR_SBIF_Pos)                   //--- 0x00002000
#define TIM_SR_SBIF               TIM_SR_SBIF_Msk                              //----System Break interrupt Flag
#define TIM_SR_CC5IF_Pos          (16U)
#define TIM_SR_CC5IF_Msk          (0x1UL << TIM_SR_CC5IF_Pos)                  //--- 0x00010000
#define TIM_SR_CC5IF              TIM_SR_CC5IF_Msk                             //----Capture/Compare 5 interrupt Flag
#define TIM_SR_CC6IF_Pos          (17U)
#define TIM_SR_CC6IF_Msk          (0x1UL << TIM_SR_CC6IF_Pos)                  //--- 0x00020000
#define TIM_SR_CC6IF              TIM_SR_CC6IF_Msk                             //----Capture/Compare 6 interrupt Flag

//----------------------------------------------------------------------------------------------
//---   Bit definition for TIM_EGR register
//----------------------------------------------------------------------------------------------
#define TIM_EGR_UG_Pos            (0U)
#define TIM_EGR_UG_Msk            (0x1UL << TIM_EGR_UG_Pos)                    //--- 0x00000001
#define TIM_EGR_UG                TIM_EGR_UG_Msk                               //----Update Generation
#define TIM_EGR_CC1G_Pos          (1U)
#define TIM_EGR_CC1G_Msk          (0x1UL << TIM_EGR_CC1G_Pos)                  //--- 0x00000002
#define TIM_EGR_CC1G              TIM_EGR_CC1G_Msk                             //----Capture/Compare 1 Generation
#define TIM_EGR_CC2G_Pos          (2U)
#define TIM_EGR_CC2G_Msk          (0x1UL << TIM_EGR_CC2G_Pos)                  //--- 0x00000004
#define TIM_EGR_CC2G              TIM_EGR_CC2G_Msk                             //----Capture/Compare 2 Generation
#define TIM_EGR_CC3G_Pos          (3U)
#define TIM_EGR_CC3G_Msk          (0x1UL << TIM_EGR_CC3G_Pos)                  //--- 0x00000008
#define TIM_EGR_CC3G              TIM_EGR_CC3G_Msk                             //----Capture/Compare 3 Generation
#define TIM_EGR_CC4G_Pos          (4U)
#define TIM_EGR_CC4G_Msk          (0x1UL << TIM_EGR_CC4G_Pos)                  //--- 0x00000010
#define TIM_EGR_CC4G              TIM_EGR_CC4G_Msk                             //----Capture/Compare 4 Generation
#define TIM_EGR_COMG_Pos          (5U)
#define TIM_EGR_COMG_Msk          (0x1UL << TIM_EGR_COMG_Pos)                  //--- 0x00000020
#define TIM_EGR_COMG              TIM_EGR_COMG_Msk                             //----Capture/Compare Control Update Generation
#define TIM_EGR_TG_Pos            (6U)
#define TIM_EGR_TG_Msk            (0x1UL << TIM_EGR_TG_Pos)                    //--- 0x00000040
#define TIM_EGR_TG                TIM_EGR_TG_Msk                               //----Trigger Generation
#define TIM_EGR_BG_Pos            (7U)
#define TIM_EGR_BG_Msk            (0x1UL << TIM_EGR_BG_Pos)                    //--- 0x00000080
#define TIM_EGR_BG                TIM_EGR_BG_Msk                               //----Break Generation
#define TIM_EGR_B2G_Pos           (8U)
#define TIM_EGR_B2G_Msk           (0x1UL << TIM_EGR_B2G_Pos)                   //--- 0x00000100
#define TIM_EGR_B2G               TIM_EGR_B2G_Msk                              //----Break 2 Generation

