Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//----------------------------------------------------------------------------------------------
//---   Bit definition for TIM_CCMR1 register
//----------------------------------------------------------------------------------------------
#define TIM_CCMR1_CC1S_Pos        (0U)
#define TIM_CCMR1_CC1S_Msk        (0x3UL << TIM_CCMR1_CC1S_Pos)                //--- 0x00000003
#define TIM_CCMR1_CC1S            TIM_CCMR1_CC1S_Msk                           //----CC1S[1:0] bits (Capture/Compare 1 Selection)
#define TIM_CCMR1_CC1S_0          (0x1UL << TIM_CCMR1_CC1S_Pos)                //--- 0x00000001
#define TIM_CCMR1_CC1S_1          (0x2UL << TIM_CCMR1_CC1S_Pos)                //--- 0x00000002

#define TIM_CCMR1_OC1FE_Pos       (2U)
#define TIM_CCMR1_OC1FE_Msk       (0x1UL << TIM_CCMR1_OC1FE_Pos)               //--- 0x00000004
#define TIM_CCMR1_OC1FE           TIM_CCMR1_OC1FE_Msk                          //----Output Compare 1 Fast enable
#define TIM_CCMR1_OC1PE_Pos       (3U)
#define TIM_CCMR1_OC1PE_Msk       (0x1UL << TIM_CCMR1_OC1PE_Pos)               //--- 0x00000008
#define TIM_CCMR1_OC1PE           TIM_CCMR1_OC1PE_Msk                          //----Output Compare 1 Preload enable

#define TIM_CCMR1_OC1M_Pos        (4U)
#define TIM_CCMR1_OC1M_Msk        (0x1007UL << TIM_CCMR1_OC1M_Pos)             //--- 0x00010070
#define TIM_CCMR1_OC1M            TIM_CCMR1_OC1M_Msk                           //----OC1M[2:0] bits (Output Compare 1 Mode)
#define TIM_CCMR1_OC1M_0          (0x0001UL << TIM_CCMR1_OC1M_Pos)             //--- 0x00000010
#define TIM_CCMR1_OC1M_1          (0x0002UL << TIM_CCMR1_OC1M_Pos)             //--- 0x00000020
#define TIM_CCMR1_OC1M_2          (0x0004UL << TIM_CCMR1_OC1M_Pos)             //--- 0x00000040
#define TIM_CCMR1_OC1M_3          (0x1000UL << TIM_CCMR1_OC1M_Pos)             //--- 0x00010000

#define TIM_CCMR1_OC1CE_Pos       (7U)
#define TIM_CCMR1_OC1CE_Msk       (0x1UL << TIM_CCMR1_OC1CE_Pos)               //--- 0x00000080
#define TIM_CCMR1_OC1CE           TIM_CCMR1_OC1CE_Msk                          //----Output Compare 1 Clear Enable

#define TIM_CCMR1_CC2S_Pos        (8U)
#define TIM_CCMR1_CC2S_Msk        (0x3UL << TIM_CCMR1_CC2S_Pos)                //--- 0x00000300
#define TIM_CCMR1_CC2S            TIM_CCMR1_CC2S_Msk                           //----CC2S[1:0] bits (Capture/Compare 2 Selection)
#define TIM_CCMR1_CC2S_0          (0x1UL << TIM_CCMR1_CC2S_Pos)                //--- 0x00000100
#define TIM_CCMR1_CC2S_1          (0x2UL << TIM_CCMR1_CC2S_Pos)                //--- 0x00000200

#define TIM_CCMR1_OC2FE_Pos       (10U)
#define TIM_CCMR1_OC2FE_Msk       (0x1UL << TIM_CCMR1_OC2FE_Pos)               //--- 0x00000400
#define TIM_CCMR1_OC2FE           TIM_CCMR1_OC2FE_Msk                          //----Output Compare 2 Fast enable
#define TIM_CCMR1_OC2PE_Pos       (11U)
#define TIM_CCMR1_OC2PE_Msk       (0x1UL << TIM_CCMR1_OC2PE_Pos)               //--- 0x00000800
#define TIM_CCMR1_OC2PE           TIM_CCMR1_OC2PE_Msk                          //----Output Compare 2 Preload enable

#define TIM_CCMR1_OC2M_Pos        (12U)
#define TIM_CCMR1_OC2M_Msk        (0x1007UL << TIM_CCMR1_OC2M_Pos)             //--- 0x01007000
#define TIM_CCMR1_OC2M            TIM_CCMR1_OC2M_Msk                           //----OC2M[2:0] bits (Output Compare 2 Mode)
#define TIM_CCMR1_OC2M_0          (0x0001UL << TIM_CCMR1_OC2M_Pos)             //--- 0x00001000
#define TIM_CCMR1_OC2M_1          (0x0002UL << TIM_CCMR1_OC2M_Pos)             //--- 0x00002000
#define TIM_CCMR1_OC2M_2          (0x0004UL << TIM_CCMR1_OC2M_Pos)             //--- 0x00004000
#define TIM_CCMR1_OC2M_3          (0x1000UL << TIM_CCMR1_OC2M_Pos)             //--- 0x01000000

#define TIM_CCMR1_OC2CE_Pos       (15U)
#define TIM_CCMR1_OC2CE_Msk       (0x1UL << TIM_CCMR1_OC2CE_Pos)               //--- 0x00008000
#define TIM_CCMR1_OC2CE           TIM_CCMR1_OC2CE_Msk                          //----Output Compare 2 Clear Enable

#define TIM_CCMR1_IC1PSC_Pos      (2U)
#define TIM_CCMR1_IC1PSC_Msk      (0x3UL << TIM_CCMR1_IC1PSC_Pos)              //--- 0x0000000C
#define TIM_CCMR1_IC1PSC          TIM_CCMR1_IC1PSC_Msk                         //----IC1PSC[1:0] bits (Input Capture 1 Prescaler)
#define TIM_CCMR1_IC1PSC_0        (0x1UL << TIM_CCMR1_IC1PSC_Pos)              //--- 0x00000004
#define TIM_CCMR1_IC1PSC_1        (0x2UL << TIM_CCMR1_IC1PSC_Pos)              //--- 0x00000008

#define TIM_CCMR1_IC1F_Pos        (4U)
#define TIM_CCMR1_IC1F_Msk        (0xFUL << TIM_CCMR1_IC1F_Pos)                //--- 0x000000F0
#define TIM_CCMR1_IC1F            TIM_CCMR1_IC1F_Msk                           //----IC1F[3:0] bits (Input Capture 1 Filter)
#define TIM_CCMR1_IC1F_0          (0x1UL << TIM_CCMR1_IC1F_Pos)                //--- 0x00000010
#define TIM_CCMR1_IC1F_1          (0x2UL << TIM_CCMR1_IC1F_Pos)                //--- 0x00000020
#define TIM_CCMR1_IC1F_2          (0x4UL << TIM_CCMR1_IC1F_Pos)                //--- 0x00000040
#define TIM_CCMR1_IC1F_3          (0x8UL << TIM_CCMR1_IC1F_Pos)                //--- 0x00000080

#define TIM_CCMR1_IC2PSC_Pos      (10U)
#define TIM_CCMR1_IC2PSC_Msk      (0x3UL << TIM_CCMR1_IC2PSC_Pos)              //--- 0x00000C00
#define TIM_CCMR1_IC2PSC          TIM_CCMR1_IC2PSC_Msk                         //----IC2PSC[1:0] bits (Input Capture 2 Prescaler)
#define TIM_CCMR1_IC2PSC_0        (0x1UL << TIM_CCMR1_IC2PSC_Pos)              //--- 0x00000400
#define TIM_CCMR1_IC2PSC_1        (0x2UL << TIM_CCMR1_IC2PSC_Pos)              //--- 0x00000800

#define TIM_CCMR1_IC2F_Pos        (12U)
#define TIM_CCMR1_IC2F_Msk        (0xFUL << TIM_CCMR1_IC2F_Pos)                //--- 0x0000F000
#define TIM_CCMR1_IC2F            TIM_CCMR1_IC2F_Msk                           //----IC2F[3:0] bits (Input Capture 2 Filter)
#define TIM_CCMR1_IC2F_0          (0x1UL << TIM_CCMR1_IC2F_Pos)                //--- 0x00001000
#define TIM_CCMR1_IC2F_1          (0x2UL << TIM_CCMR1_IC2F_Pos)                //--- 0x00002000
#define TIM_CCMR1_IC2F_2          (0x4UL << TIM_CCMR1_IC2F_Pos)                //--- 0x00004000
#define TIM_CCMR1_IC2F_3          (0x8UL << TIM_CCMR1_IC2F_Pos)                //--- 0x00008000

//---------------------------------------------------------------------------------------------
//---   Bit definition for TIM_CCMR2 register
//---------------------------------------------------------------------------------------------
#define TIM_CCMR2_CC3S_Pos        (0U)
#define TIM_CCMR2_CC3S_Msk        (0x3UL << TIM_CCMR2_CC3S_Pos)                //--- 0x00000003
#define TIM_CCMR2_CC3S            TIM_CCMR2_CC3S_Msk                           //----CC3S[1:0] bits (Capture/Compare 3 Selection)
#define TIM_CCMR2_CC3S_0          (0x1UL << TIM_CCMR2_CC3S_Pos)                //--- 0x00000001
#define TIM_CCMR2_CC3S_1          (0x2UL << TIM_CCMR2_CC3S_Pos)                //--- 0x00000002

#define TIM_CCMR2_OC3FE_Pos       (2U)
#define TIM_CCMR2_OC3FE_Msk       (0x1UL << TIM_CCMR2_OC3FE_Pos)               //--- 0x00000004
#define TIM_CCMR2_OC3FE           TIM_CCMR2_OC3FE_Msk                          //----Output Compare 3 Fast enable
#define TIM_CCMR2_OC3PE_Pos       (3U)
#define TIM_CCMR2_OC3PE_Msk       (0x1UL << TIM_CCMR2_OC3PE_Pos)               //--- 0x00000008
#define TIM_CCMR2_OC3PE           TIM_CCMR2_OC3PE_Msk                          //----Output Compare 3 Preload enable

#define TIM_CCMR2_OC3M_Pos        (4U)
#define TIM_CCMR2_OC3M_Msk        (0x1007UL << TIM_CCMR2_OC3M_Pos)             //--- 0x00010070
#define TIM_CCMR2_OC3M            TIM_CCMR2_OC3M_Msk                           //----OC3M[2:0] bits (Output Compare 3 Mode)
#define TIM_CCMR2_OC3M_0          (0x0001UL << TIM_CCMR2_OC3M_Pos)             //--- 0x00000010
#define TIM_CCMR2_OC3M_1          (0x0002UL << TIM_CCMR2_OC3M_Pos)             //--- 0x00000020
#define TIM_CCMR2_OC3M_2          (0x0004UL << TIM_CCMR2_OC3M_Pos)             //--- 0x00000040
#define TIM_CCMR2_OC3M_3          (0x1000UL << TIM_CCMR2_OC3M_Pos)             //--- 0x00010000

#define TIM_CCMR2_OC3CE_Pos       (7U)
#define TIM_CCMR2_OC3CE_Msk       (0x1UL << TIM_CCMR2_OC3CE_Pos)               //--- 0x00000080
#define TIM_CCMR2_OC3CE           TIM_CCMR2_OC3CE_Msk                          //----Output Compare 3 Clear Enable

#define TIM_CCMR2_CC4S_Pos        (8U)
#define TIM_CCMR2_CC4S_Msk        (0x3UL << TIM_CCMR2_CC4S_Pos)                //--- 0x00000300
#define TIM_CCMR2_CC4S            TIM_CCMR2_CC4S_Msk                           //----CC4S[1:0] bits (Capture/Compare 4 Selection)
#define TIM_CCMR2_CC4S_0          (0x1UL << TIM_CCMR2_CC4S_Pos)                //--- 0x00000100
#define TIM_CCMR2_CC4S_1          (0x2UL << TIM_CCMR2_CC4S_Pos)                //--- 0x00000200

#define TIM_CCMR2_OC4FE_Pos       (10U)
#define TIM_CCMR2_OC4FE_Msk       (0x1UL << TIM_CCMR2_OC4FE_Pos)               //--- 0x00000400
#define TIM_CCMR2_OC4FE           TIM_CCMR2_OC4FE_Msk                          //----Output Compare 4 Fast enable
#define TIM_CCMR2_OC4PE_Pos       (11U)
#define TIM_CCMR2_OC4PE_Msk       (0x1UL << TIM_CCMR2_OC4PE_Pos)               //--- 0x00000800
#define TIM_CCMR2_OC4PE           TIM_CCMR2_OC4PE_Msk                          //----Output Compare 4 Preload enable

#define TIM_CCMR2_OC4M_Pos        (12U)
#define TIM_CCMR2_OC4M_Msk        (0x1007UL << TIM_CCMR2_OC4M_Pos)             //--- 0x01007000
#define TIM_CCMR2_OC4M            TIM_CCMR2_OC4M_Msk                           //----OC4M[2:0] bits (Output Compare 4 Mode)
#define TIM_CCMR2_OC4M_0          (0x0001UL << TIM_CCMR2_OC4M_Pos)             //--- 0x00001000
#define TIM_CCMR2_OC4M_1          (0x0002UL << TIM_CCMR2_OC4M_Pos)             //--- 0x00002000
#define TIM_CCMR2_OC4M_2          (0x0004UL << TIM_CCMR2_OC4M_Pos)             //--- 0x00004000
#define TIM_CCMR2_OC4M_3          (0x1000UL << TIM_CCMR2_OC4M_Pos)             //--- 0x01000000

#define TIM_CCMR2_OC4CE_Pos       (15U)
#define TIM_CCMR2_OC4CE_Msk       (0x1UL << TIM_CCMR2_OC4CE_Pos)               //--- 0x00008000
#define TIM_CCMR2_OC4CE           TIM_CCMR2_OC4CE_Msk                          //----Output Compare 4 Clear Enable

//--- ----------------------------------------------------------------------------
#define TIM_CCMR2_IC3PSC_Pos      (2U)
#define TIM_CCMR2_IC3PSC_Msk      (0x3UL << TIM_CCMR2_IC3PSC_Pos)              //--- 0x0000000C
#define TIM_CCMR2_IC3PSC          TIM_CCMR2_IC3PSC_Msk                         //----IC3PSC[1:0] bits (Input Capture 3 Prescaler)
#define TIM_CCMR2_IC3PSC_0        (0x1UL << TIM_CCMR2_IC3PSC_Pos)              //--- 0x00000004
#define TIM_CCMR2_IC3PSC_1        (0x2UL << TIM_CCMR2_IC3PSC_Pos)              //--- 0x00000008

#define TIM_CCMR2_IC3F_Pos        (4U)
#define TIM_CCMR2_IC3F_Msk        (0xFUL << TIM_CCMR2_IC3F_Pos)                //--- 0x000000F0
#define TIM_CCMR2_IC3F            TIM_CCMR2_IC3F_Msk                           //----IC3F[3:0] bits (Input Capture 3 Filter)
#define TIM_CCMR2_IC3F_0          (0x1UL << TIM_CCMR2_IC3F_Pos)                //--- 0x00000010
#define TIM_CCMR2_IC3F_1          (0x2UL << TIM_CCMR2_IC3F_Pos)                //--- 0x00000020
#define TIM_CCMR2_IC3F_2          (0x4UL << TIM_CCMR2_IC3F_Pos)                //--- 0x00000040
#define TIM_CCMR2_IC3F_3          (0x8UL << TIM_CCMR2_IC3F_Pos)                //--- 0x00000080

#define TIM_CCMR2_IC4PSC_Pos      (10U)
#define TIM_CCMR2_IC4PSC_Msk      (0x3UL << TIM_CCMR2_IC4PSC_Pos)              //--- 0x00000C00
#define TIM_CCMR2_IC4PSC          TIM_CCMR2_IC4PSC_Msk                         //----IC4PSC[1:0] bits (Input Capture 4 Prescaler)
#define TIM_CCMR2_IC4PSC_0        (0x1UL << TIM_CCMR2_IC4PSC_Pos)              //--- 0x00000400
#define TIM_CCMR2_IC4PSC_1        (0x2UL << TIM_CCMR2_IC4PSC_Pos)              //--- 0x00000800

#define TIM_CCMR2_IC4F_Pos        (12U)
#define TIM_CCMR2_IC4F_Msk        (0xFUL << TIM_CCMR2_IC4F_Pos)                //--- 0x0000F000
#define TIM_CCMR2_IC4F            TIM_CCMR2_IC4F_Msk                           //----IC4F[3:0] bits (Input Capture 4 Filter)
#define TIM_CCMR2_IC4F_0          (0x1UL << TIM_CCMR2_IC4F_Pos)                //--- 0x00001000
#define TIM_CCMR2_IC4F_1          (0x2UL << TIM_CCMR2_IC4F_Pos)                //--- 0x00002000
#define TIM_CCMR2_IC4F_2          (0x4UL << TIM_CCMR2_IC4F_Pos)                //--- 0x00004000
#define TIM_CCMR2_IC4F_3          (0x8UL << TIM_CCMR2_IC4F_Pos)                //--- 0x00008000

//---   Bit definition for TIM_CCMR3 register
#define TIM_CCMR3_OC5FE_Pos       (2U)
#define TIM_CCMR3_OC5FE_Msk       (0x1UL << TIM_CCMR3_OC5FE_Pos)               //--- 0x00000004
#define TIM_CCMR3_OC5FE           TIM_CCMR3_OC5FE_Msk                          //----Output Compare 5 Fast enable
#define TIM_CCMR3_OC5PE_Pos       (3U)
#define TIM_CCMR3_OC5PE_Msk       (0x1UL << TIM_CCMR3_OC5PE_Pos)               //--- 0x00000008
#define TIM_CCMR3_OC5PE           TIM_CCMR3_OC5PE_Msk                          //----Output Compare 5 Preload enable

#define TIM_CCMR3_OC5M_Pos        (4U)
#define TIM_CCMR3_OC5M_Msk        (0x1007UL << TIM_CCMR3_OC5M_Pos)             //--- 0x00010070
#define TIM_CCMR3_OC5M            TIM_CCMR3_OC5M_Msk                           //----OC5M[3:0] bits (Output Compare 5 Mode)
#define TIM_CCMR3_OC5M_0          (0x0001UL << TIM_CCMR3_OC5M_Pos)             //--- 0x00000010
#define TIM_CCMR3_OC5M_1          (0x0002UL << TIM_CCMR3_OC5M_Pos)             //--- 0x00000020
#define TIM_CCMR3_OC5M_2          (0x0004UL << TIM_CCMR3_OC5M_Pos)             //--- 0x00000040
#define TIM_CCMR3_OC5M_3          (0x1000UL << TIM_CCMR3_OC5M_Pos)             //--- 0x00010000

