Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define TIM_CCMR3_OC5CE_Pos       (7U)
#define TIM_CCMR3_OC5CE_Msk       (0x1UL << TIM_CCMR3_OC5CE_Pos)               //--- 0x00000080
#define TIM_CCMR3_OC5CE           TIM_CCMR3_OC5CE_Msk                          //----Output Compare 5 Clear Enable

#define TIM_CCMR3_OC6FE_Pos       (10U)
#define TIM_CCMR3_OC6FE_Msk       (0x1UL << TIM_CCMR3_OC6FE_Pos)               //--- 0x00000400
#define TIM_CCMR3_OC6FE           TIM_CCMR3_OC6FE_Msk                          //----Output Compare 6 Fast enable
#define TIM_CCMR3_OC6PE_Pos       (11U)
#define TIM_CCMR3_OC6PE_Msk       (0x1UL << TIM_CCMR3_OC6PE_Pos)               //--- 0x00000800
#define TIM_CCMR3_OC6PE           TIM_CCMR3_OC6PE_Msk                          //----Output Compare 6 Preload enable

#define TIM_CCMR3_OC6M_Pos        (12U)
#define TIM_CCMR3_OC6M_Msk        (0x1007UL << TIM_CCMR3_OC6M_Pos)             //--- 0x01007000
#define TIM_CCMR3_OC6M            TIM_CCMR3_OC6M_Msk                           //----OC6M[3:0] bits (Output Compare 6 Mode)
#define TIM_CCMR3_OC6M_0          (0x0001UL << TIM_CCMR3_OC6M_Pos)             //--- 0x00001000
#define TIM_CCMR3_OC6M_1          (0x0002UL << TIM_CCMR3_OC6M_Pos)             //--- 0x00002000
#define TIM_CCMR3_OC6M_2          (0x0004UL << TIM_CCMR3_OC6M_Pos)             //--- 0x00004000
#define TIM_CCMR3_OC6M_3          (0x1000UL << TIM_CCMR3_OC6M_Pos)             //--- 0x01000000

#define TIM_CCMR3_OC6CE_Pos       (15U)
#define TIM_CCMR3_OC6CE_Msk       (0x1UL << TIM_CCMR3_OC6CE_Pos)               //--- 0x00008000
#define TIM_CCMR3_OC6CE           TIM_CCMR3_OC6CE_Msk                          //----Output Compare 6 Clear Enable

//---  Bit definition for TIM_CCER register
#define TIM_CCER_CC1E_Pos         (0U)
#define TIM_CCER_CC1E_Msk         (0x1UL << TIM_CCER_CC1E_Pos)                 //--- 0x00000001
#define TIM_CCER_CC1E             TIM_CCER_CC1E_Msk                            //----Capture/Compare 1 output enable
#define TIM_CCER_CC1P_Pos         (1U)
#define TIM_CCER_CC1P_Msk         (0x1UL << TIM_CCER_CC1P_Pos)                 //--- 0x00000002
#define TIM_CCER_CC1P             TIM_CCER_CC1P_Msk                            //----Capture/Compare 1 output Polarity
#define TIM_CCER_CC1NE_Pos        (2U)
#define TIM_CCER_CC1NE_Msk        (0x1UL << TIM_CCER_CC1NE_Pos)                //--- 0x00000004
#define TIM_CCER_CC1NE            TIM_CCER_CC1NE_Msk                           //----Capture/Compare 1 Complementary output enable
#define TIM_CCER_CC1NP_Pos        (3U)
#define TIM_CCER_CC1NP_Msk        (0x1UL << TIM_CCER_CC1NP_Pos)                //--- 0x00000008
#define TIM_CCER_CC1NP            TIM_CCER_CC1NP_Msk                           //----Capture/Compare 1 Complementary output Polarity
#define TIM_CCER_CC2E_Pos         (4U)
#define TIM_CCER_CC2E_Msk         (0x1UL << TIM_CCER_CC2E_Pos)                 //--- 0x00000010
#define TIM_CCER_CC2E             TIM_CCER_CC2E_Msk                            //----Capture/Compare 2 output enable
#define TIM_CCER_CC2P_Pos         (5U)
#define TIM_CCER_CC2P_Msk         (0x1UL << TIM_CCER_CC2P_Pos)                 //--- 0x00000020
#define TIM_CCER_CC2P             TIM_CCER_CC2P_Msk                            //----Capture/Compare 2 output Polarity
#define TIM_CCER_CC2NE_Pos        (6U)
#define TIM_CCER_CC2NE_Msk        (0x1UL << TIM_CCER_CC2NE_Pos)                //--- 0x00000040
#define TIM_CCER_CC2NE            TIM_CCER_CC2NE_Msk                           //----Capture/Compare 2 Complementary output enable
#define TIM_CCER_CC2NP_Pos        (7U)
#define TIM_CCER_CC2NP_Msk        (0x1UL << TIM_CCER_CC2NP_Pos)                //--- 0x00000080
#define TIM_CCER_CC2NP            TIM_CCER_CC2NP_Msk                           //----Capture/Compare 2 Complementary output Polarity
#define TIM_CCER_CC3E_Pos         (8U)
#define TIM_CCER_CC3E_Msk         (0x1UL << TIM_CCER_CC3E_Pos)                 //--- 0x00000100
#define TIM_CCER_CC3E             TIM_CCER_CC3E_Msk                            //----Capture/Compare 3 output enable
#define TIM_CCER_CC3P_Pos         (9U)
#define TIM_CCER_CC3P_Msk         (0x1UL << TIM_CCER_CC3P_Pos)                 //--- 0x00000200
#define TIM_CCER_CC3P             TIM_CCER_CC3P_Msk                            //----Capture/Compare 3 output Polarity
#define TIM_CCER_CC3NE_Pos        (10U)
#define TIM_CCER_CC3NE_Msk        (0x1UL << TIM_CCER_CC3NE_Pos)                //--- 0x00000400
#define TIM_CCER_CC3NE            TIM_CCER_CC3NE_Msk                           //----Capture/Compare 3 Complementary output enable
#define TIM_CCER_CC3NP_Pos        (11U)
#define TIM_CCER_CC3NP_Msk        (0x1UL << TIM_CCER_CC3NP_Pos)                //--- 0x00000800
#define TIM_CCER_CC3NP            TIM_CCER_CC3NP_Msk                           //----Capture/Compare 3 Complementary output Polarity
#define TIM_CCER_CC4E_Pos         (12U)
#define TIM_CCER_CC4E_Msk         (0x1UL << TIM_CCER_CC4E_Pos)                 //--- 0x00001000
#define TIM_CCER_CC4E             TIM_CCER_CC4E_Msk                            //----Capture/Compare 4 output enable
#define TIM_CCER_CC4P_Pos         (13U)
#define TIM_CCER_CC4P_Msk         (0x1UL << TIM_CCER_CC4P_Pos)                 //--- 0x00002000
#define TIM_CCER_CC4P             TIM_CCER_CC4P_Msk                            //----Capture/Compare 4 output Polarity
#define TIM_CCER_CC4NP_Pos        (15U)
#define TIM_CCER_CC4NP_Msk        (0x1UL << TIM_CCER_CC4NP_Pos)                //--- 0x00008000
#define TIM_CCER_CC4NP            TIM_CCER_CC4NP_Msk                           //----Capture/Compare 4 Complementary output Polarity
#define TIM_CCER_CC5E_Pos         (16U)
#define TIM_CCER_CC5E_Msk         (0x1UL << TIM_CCER_CC5E_Pos)                 //--- 0x00010000
#define TIM_CCER_CC5E             TIM_CCER_CC5E_Msk                            //----Capture/Compare 5 output enable
#define TIM_CCER_CC5P_Pos         (17U)
#define TIM_CCER_CC5P_Msk         (0x1UL << TIM_CCER_CC5P_Pos)                 //--- 0x00020000
#define TIM_CCER_CC5P             TIM_CCER_CC5P_Msk                            //----Capture/Compare 5 output Polarity
#define TIM_CCER_CC6E_Pos         (20U)
#define TIM_CCER_CC6E_Msk         (0x1UL << TIM_CCER_CC6E_Pos)                 //--- 0x00100000
#define TIM_CCER_CC6E             TIM_CCER_CC6E_Msk                            //----Capture/Compare 6 output enable
#define TIM_CCER_CC6P_Pos         (21U)
#define TIM_CCER_CC6P_Msk         (0x1UL << TIM_CCER_CC6P_Pos)                 //--- 0x00200000
#define TIM_CCER_CC6P             TIM_CCER_CC6P_Msk                            //----Capture/Compare 6 output Polarity

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CNT register
//---------------------------------------------------------------------------------------------
#define TIM_CNT_CNT_Pos           (0U)
#define TIM_CNT_CNT_Msk           (0xFFFFFFFFUL << TIM_CNT_CNT_Pos)            //--- 0xFFFFFFFF
#define TIM_CNT_CNT               TIM_CNT_CNT_Msk                              //----Counter Value
#define TIM_CNT_UIFCPY_Pos        (31U)
#define TIM_CNT_UIFCPY_Msk        (0x1UL << TIM_CNT_UIFCPY_Pos)                //--- 0x80000000
#define TIM_CNT_UIFCPY            TIM_CNT_UIFCPY_Msk                           //----Update interrupt flag copy (if UIFREMAP=1)

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_PSC register
//---------------------------------------------------------------------------------------------
#define TIM_PSC_PSC_Pos           (0U)
#define TIM_PSC_PSC_Msk           (0xFFFFUL << TIM_PSC_PSC_Pos)                //--- 0x0000FFFF
#define TIM_PSC_PSC               TIM_PSC_PSC_Msk                              //----Prescaler Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_ARR register
//---------------------------------------------------------------------------------------------
#define TIM_ARR_ARR_Pos           (0U)
#define TIM_ARR_ARR_Msk           (0xFFFFFFFFUL << TIM_ARR_ARR_Pos)            //--- 0xFFFFFFFF
#define TIM_ARR_ARR               TIM_ARR_ARR_Msk                              //----Actual auto-reload Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_RCR register
//---------------------------------------------------------------------------------------------
#define TIM_RCR_REP_Pos           (0U)
#define TIM_RCR_REP_Msk           (0xFFFFUL << TIM_RCR_REP_Pos)                //--- 0x0000FFFF
#define TIM_RCR_REP               TIM_RCR_REP_Msk                              //----Repetition Counter Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CCR1 register
//---------------------------------------------------------------------------------------------
#define TIM_CCR1_CCR1_Pos         (0U)
#define TIM_CCR1_CCR1_Msk         (0xFFFFUL << TIM_CCR1_CCR1_Pos)              //--- 0x0000FFFF
#define TIM_CCR1_CCR1             TIM_CCR1_CCR1_Msk                            //----Capture/Compare 1 Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CCR2 register
//---------------------------------------------------------------------------------------------
#define TIM_CCR2_CCR2_Pos         (0U)
#define TIM_CCR2_CCR2_Msk         (0xFFFFUL << TIM_CCR2_CCR2_Pos)              //--- 0x0000FFFF
#define TIM_CCR2_CCR2             TIM_CCR2_CCR2_Msk                            //----Capture/Compare 2 Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CCR3 register
//---------------------------------------------------------------------------------------------
#define TIM_CCR3_CCR3_Pos         (0U)
#define TIM_CCR3_CCR3_Msk         (0xFFFFUL << TIM_CCR3_CCR3_Pos)              //--- 0x0000FFFF
#define TIM_CCR3_CCR3             TIM_CCR3_CCR3_Msk                            //----Capture/Compare 3 Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CCR4 register
//---------------------------------------------------------------------------------------------
#define TIM_CCR4_CCR4_Pos         (0U)
#define TIM_CCR4_CCR4_Msk         (0xFFFFUL << TIM_CCR4_CCR4_Pos)              //--- 0x0000FFFF
#define TIM_CCR4_CCR4             TIM_CCR4_CCR4_Msk                            //----Capture/Compare 4 Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CCR5 register
//---------------------------------------------------------------------------------------------
#define TIM_CCR5_CCR5_Pos         (0U)
#define TIM_CCR5_CCR5_Msk         (0xFFFFFFFFUL << TIM_CCR5_CCR5_Pos)          //--- 0xFFFFFFFF
#define TIM_CCR5_CCR5             TIM_CCR5_CCR5_Msk                            //----Capture/Compare 5 Value
#define TIM_CCR5_GC5C1_Pos        (29U)
#define TIM_CCR5_GC5C1_Msk        (0x1UL << TIM_CCR5_GC5C1_Pos)                //--- 0x20000000
#define TIM_CCR5_GC5C1            TIM_CCR5_GC5C1_Msk                           //----Group Channel 5 and Channel 1
#define TIM_CCR5_GC5C2_Pos        (30U)
#define TIM_CCR5_GC5C2_Msk        (0x1UL << TIM_CCR5_GC5C2_Pos)                //--- 0x40000000
#define TIM_CCR5_GC5C2            TIM_CCR5_GC5C2_Msk                           //----Group Channel 5 and Channel 2
#define TIM_CCR5_GC5C3_Pos        (31U)
#define TIM_CCR5_GC5C3_Msk        (0x1UL << TIM_CCR5_GC5C3_Pos)                //--- 0x80000000
#define TIM_CCR5_GC5C3            TIM_CCR5_GC5C3_Msk                           //----Group Channel 5 and Channel 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_CCR6 register
//---------------------------------------------------------------------------------------------
#define TIM_CCR6_CCR6_Pos         (0U)
#define TIM_CCR6_CCR6_Msk         (0xFFFFUL << TIM_CCR6_CCR6_Pos)              //--- 0x0000FFFF
#define TIM_CCR6_CCR6             TIM_CCR6_CCR6_Msk                            //----Capture/Compare 6 Value

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_BDTR register
//---------------------------------------------------------------------------------------------
#define TIM_BDTR_DTG_Pos          (0U)
#define TIM_BDTR_DTG_Msk          (0xFFUL << TIM_BDTR_DTG_Pos)                 //--- 0x000000FF
#define TIM_BDTR_DTG              TIM_BDTR_DTG_Msk                             //----DTG[0:7] bits (Dead-Time Generator set-up)
#define TIM_BDTR_DTG_0            (0x01UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000001
#define TIM_BDTR_DTG_1            (0x02UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000002
#define TIM_BDTR_DTG_2            (0x04UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000004
#define TIM_BDTR_DTG_3            (0x08UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000008
#define TIM_BDTR_DTG_4            (0x10UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000010
#define TIM_BDTR_DTG_5            (0x20UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000020
#define TIM_BDTR_DTG_6            (0x40UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000040
#define TIM_BDTR_DTG_7            (0x80UL << TIM_BDTR_DTG_Pos)                 //--- 0x00000080

