Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define TIM_BDTR_LOCK_Pos         (8U)
#define TIM_BDTR_LOCK_Msk         (0x3UL << TIM_BDTR_LOCK_Pos)                 //--- 0x00000300
#define TIM_BDTR_LOCK             TIM_BDTR_LOCK_Msk                            //----LOCK[1:0] bits (Lock Configuration)
#define TIM_BDTR_LOCK_0           (0x1UL << TIM_BDTR_LOCK_Pos)                 //--- 0x00000100
#define TIM_BDTR_LOCK_1           (0x2UL << TIM_BDTR_LOCK_Pos)                 //--- 0x00000200

#define TIM_BDTR_OSSI_Pos         (10U)
#define TIM_BDTR_OSSI_Msk         (0x1UL << TIM_BDTR_OSSI_Pos)                 //--- 0x00000400
#define TIM_BDTR_OSSI             TIM_BDTR_OSSI_Msk                            //----Off-State Selection for Idle mode
#define TIM_BDTR_OSSR_Pos         (11U)
#define TIM_BDTR_OSSR_Msk         (0x1UL << TIM_BDTR_OSSR_Pos)                 //--- 0x00000800
#define TIM_BDTR_OSSR             TIM_BDTR_OSSR_Msk                            //----Off-State Selection for Run mode
#define TIM_BDTR_BKE_Pos          (12U)
#define TIM_BDTR_BKE_Msk          (0x1UL << TIM_BDTR_BKE_Pos)                  //--- 0x00001000
#define TIM_BDTR_BKE              TIM_BDTR_BKE_Msk                             //----Break enable for Break 1
#define TIM_BDTR_BKP_Pos          (13U)
#define TIM_BDTR_BKP_Msk          (0x1UL << TIM_BDTR_BKP_Pos)                  //--- 0x00002000
#define TIM_BDTR_BKP              TIM_BDTR_BKP_Msk                             //----Break Polarity for Break 1
#define TIM_BDTR_AOE_Pos          (14U)
#define TIM_BDTR_AOE_Msk          (0x1UL << TIM_BDTR_AOE_Pos)                  //--- 0x00004000
#define TIM_BDTR_AOE              TIM_BDTR_AOE_Msk                             //----Automatic Output enable
#define TIM_BDTR_MOE_Pos          (15U)
#define TIM_BDTR_MOE_Msk          (0x1UL << TIM_BDTR_MOE_Pos)                  //--- 0x00008000
#define TIM_BDTR_MOE              TIM_BDTR_MOE_Msk                             //----Main Output enable

#define TIM_BDTR_BKF_Pos          (16U)
#define TIM_BDTR_BKF_Msk          (0xFUL << TIM_BDTR_BKF_Pos)                  //--- 0x000F0000
#define TIM_BDTR_BKF              TIM_BDTR_BKF_Msk                             //----Break Filter for Break 1
#define TIM_BDTR_BK2F_Pos         (20U)
#define TIM_BDTR_BK2F_Msk         (0xFUL << TIM_BDTR_BK2F_Pos)                 //--- 0x00F00000
#define TIM_BDTR_BK2F             TIM_BDTR_BK2F_Msk                            //----Break Filter for Break 2

#define TIM_BDTR_BK2E_Pos         (24U)
#define TIM_BDTR_BK2E_Msk         (0x1UL << TIM_BDTR_BK2E_Pos)                 //--- 0x01000000
#define TIM_BDTR_BK2E             TIM_BDTR_BK2E_Msk                            //----Break enable for Break 2
#define TIM_BDTR_BK2P_Pos         (25U)
#define TIM_BDTR_BK2P_Msk         (0x1UL << TIM_BDTR_BK2P_Pos)                 //--- 0x02000000
#define TIM_BDTR_BK2P             TIM_BDTR_BK2P_Msk                            //----Break Polarity for Break 2

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_DCR register
//---------------------------------------------------------------------------------------------
#define TIM_DCR_DBA_Pos           (0U)
#define TIM_DCR_DBA_Msk           (0x1FUL << TIM_DCR_DBA_Pos)                  //--- 0x0000001F
#define TIM_DCR_DBA               TIM_DCR_DBA_Msk                              //----DBA[4:0] bits (DMA Base Address)
#define TIM_DCR_DBA_0             (0x01UL << TIM_DCR_DBA_Pos)                  //--- 0x00000001
#define TIM_DCR_DBA_1             (0x02UL << TIM_DCR_DBA_Pos)                  //--- 0x00000002
#define TIM_DCR_DBA_2             (0x04UL << TIM_DCR_DBA_Pos)                  //--- 0x00000004
#define TIM_DCR_DBA_3             (0x08UL << TIM_DCR_DBA_Pos)                  //--- 0x00000008
#define TIM_DCR_DBA_4             (0x10UL << TIM_DCR_DBA_Pos)                  //--- 0x00000010

#define TIM_DCR_DBL_Pos           (8U)
#define TIM_DCR_DBL_Msk           (0x1FUL << TIM_DCR_DBL_Pos)                  //--- 0x00001F00
#define TIM_DCR_DBL               TIM_DCR_DBL_Msk                              //----DBL[4:0] bits (DMA Burst Length)
#define TIM_DCR_DBL_0             (0x01UL << TIM_DCR_DBL_Pos)                  //--- 0x00000100
#define TIM_DCR_DBL_1             (0x02UL << TIM_DCR_DBL_Pos)                  //--- 0x00000200
#define TIM_DCR_DBL_2             (0x04UL << TIM_DCR_DBL_Pos)                  //--- 0x00000400
#define TIM_DCR_DBL_3             (0x08UL << TIM_DCR_DBL_Pos)                  //--- 0x00000800
#define TIM_DCR_DBL_4             (0x10UL << TIM_DCR_DBL_Pos)                  //--- 0x00001000

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM_DMAR register
//---------------------------------------------------------------------------------------------
#define TIM_DMAR_DMAB_Pos         (0U)
#define TIM_DMAR_DMAB_Msk         (0xFFFFUL << TIM_DMAR_DMAB_Pos)              //--- 0x0000FFFF
#define TIM_DMAR_DMAB             TIM_DMAR_DMAB_Msk                            //----DMA register for burst accesses

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM1_OR1 register
//---------------------------------------------------------------------------------------------
#define TIM1_OR1_ETR_ADC1_RMP_Pos      (0U)
#define TIM1_OR1_ETR_ADC1_RMP_Msk      (0x3UL << TIM1_OR1_ETR_ADC1_RMP_Pos)    //--- 0x00000003
#define TIM1_OR1_ETR_ADC1_RMP          TIM1_OR1_ETR_ADC1_RMP_Msk               //----ETR_ADC1_RMP[1:0] bits (TIM1 ETR remap on ADC1)
#define TIM1_OR1_ETR_ADC1_RMP_0        (0x1UL << TIM1_OR1_ETR_ADC1_RMP_Pos)    //--- 0x00000001
#define TIM1_OR1_ETR_ADC1_RMP_1        (0x2UL << TIM1_OR1_ETR_ADC1_RMP_Pos)    //--- 0x00000002

#define TIM1_OR1_TI1_RMP_Pos           (4U)
#define TIM1_OR1_TI1_RMP_Msk           (0x1UL << TIM1_OR1_TI1_RMP_Pos)         //--- 0x00000010
#define TIM1_OR1_TI1_RMP               TIM1_OR1_TI1_RMP_Msk                    //----TIM1 Input Capture 1 remap

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM1_OR2 register
//---------------------------------------------------------------------------------------------
#define TIM1_OR2_BKINE_Pos             (0U)
#define TIM1_OR2_BKINE_Msk             (0x1UL << TIM1_OR2_BKINE_Pos)           //--- 0x00000001
#define TIM1_OR2_BKINE                 TIM1_OR2_BKINE_Msk                      //----BRK BKIN input enable
#define TIM1_OR2_BKCMP1E_Pos           (1U)
#define TIM1_OR2_BKCMP1E_Msk           (0x1UL << TIM1_OR2_BKCMP1E_Pos)         //--- 0x00000002
#define TIM1_OR2_BKCMP1E               TIM1_OR2_BKCMP1E_Msk                    //----BRK COMP1 enable
#define TIM1_OR2_BKCMP2E_Pos           (2U)
#define TIM1_OR2_BKCMP2E_Msk           (0x1UL << TIM1_OR2_BKCMP2E_Pos)         //--- 0x00000004
#define TIM1_OR2_BKCMP2E               TIM1_OR2_BKCMP2E_Msk                    //----BRK COMP2 enable
#define TIM1_OR2_BKINP_Pos             (9U)
#define TIM1_OR2_BKINP_Msk             (0x1UL << TIM1_OR2_BKINP_Pos)           //--- 0x00000200
#define TIM1_OR2_BKINP                 TIM1_OR2_BKINP_Msk                      //----BRK BKIN input polarity
#define TIM1_OR2_BKCMP1P_Pos           (10U)
#define TIM1_OR2_BKCMP1P_Msk           (0x1UL << TIM1_OR2_BKCMP1P_Pos)         //--- 0x00000400
#define TIM1_OR2_BKCMP1P               TIM1_OR2_BKCMP1P_Msk                    //----BRK COMP1 input polarity
#define TIM1_OR2_BKCMP2P_Pos           (11U)
#define TIM1_OR2_BKCMP2P_Msk           (0x1UL << TIM1_OR2_BKCMP2P_Pos)         //--- 0x00000800
#define TIM1_OR2_BKCMP2P               TIM1_OR2_BKCMP2P_Msk                    //----BRK COMP2 input polarity

