Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define TIM1_OR2_ETRSEL_Pos            (14U)
#define TIM1_OR2_ETRSEL_Msk            (0x7UL << TIM1_OR2_ETRSEL_Pos)          //--- 0x0001C000
#define TIM1_OR2_ETRSEL                TIM1_OR2_ETRSEL_Msk                     //----ETRSEL[2:0] bits (TIM1 ETR source selection)
#define TIM1_OR2_ETRSEL_0              (0x1UL << TIM1_OR2_ETRSEL_Pos)          //--- 0x00004000
#define TIM1_OR2_ETRSEL_1              (0x2UL << TIM1_OR2_ETRSEL_Pos)          //--- 0x00008000
#define TIM1_OR2_ETRSEL_2              (0x4UL << TIM1_OR2_ETRSEL_Pos)          //--- 0x00010000

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM1_OR3 register
//---------------------------------------------------------------------------------------------
#define TIM1_OR3_BK2INE_Pos            (0U)
#define TIM1_OR3_BK2INE_Msk            (0x1UL << TIM1_OR3_BK2INE_Pos)          //--- 0x00000001
#define TIM1_OR3_BK2INE                TIM1_OR3_BK2INE_Msk                     //----BRK2 BKIN2 input enable
#define TIM1_OR3_BK2CMP1E_Pos          (1U)
#define TIM1_OR3_BK2CMP1E_Msk          (0x1UL << TIM1_OR3_BK2CMP1E_Pos)        //--- 0x00000002
#define TIM1_OR3_BK2CMP1E              TIM1_OR3_BK2CMP1E_Msk                   //----BRK2 COMP1 enable
#define TIM1_OR3_BK2CMP2E_Pos          (2U)
#define TIM1_OR3_BK2CMP2E_Msk          (0x1UL << TIM1_OR3_BK2CMP2E_Pos)        //--- 0x00000004
#define TIM1_OR3_BK2CMP2E              TIM1_OR3_BK2CMP2E_Msk                   //----BRK2 COMP2 enable
#define TIM1_OR3_BK2INP_Pos            (9U)
#define TIM1_OR3_BK2INP_Msk            (0x1UL << TIM1_OR3_BK2INP_Pos)          //--- 0x00000200
#define TIM1_OR3_BK2INP                TIM1_OR3_BK2INP_Msk                     //----BRK2 BKIN2 input polarity
#define TIM1_OR3_BK2CMP1P_Pos          (10U)
#define TIM1_OR3_BK2CMP1P_Msk          (0x1UL << TIM1_OR3_BK2CMP1P_Pos)        //--- 0x00000400
#define TIM1_OR3_BK2CMP1P              TIM1_OR3_BK2CMP1P_Msk                   //----BRK2 COMP1 input polarity
#define TIM1_OR3_BK2CMP2P_Pos          (11U)
#define TIM1_OR3_BK2CMP2P_Msk          (0x1UL << TIM1_OR3_BK2CMP2P_Pos)        //--- 0x00000800
#define TIM1_OR3_BK2CMP2P              TIM1_OR3_BK2CMP2P_Msk                   //----BRK2 COMP2 input polarity


//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM2_OR1 register
//---------------------------------------------------------------------------------------------
#define TIM2_OR1_ITR1_RMP_Pos     (0U)
#define TIM2_OR1_ITR1_RMP_Msk     (0x1UL << TIM2_OR1_ITR1_RMP_Pos)             //--- 0x00000001
#define TIM2_OR1_ITR1_RMP         TIM2_OR1_ITR1_RMP_Msk                        //----TIM2 Internal trigger 1 remap
#define TIM2_OR1_ETR1_RMP_Pos     (1U)
#define TIM2_OR1_ETR1_RMP_Msk     (0x1UL << TIM2_OR1_ETR1_RMP_Pos)             //--- 0x00000002
#define TIM2_OR1_ETR1_RMP         TIM2_OR1_ETR1_RMP_Msk                        //----TIM2 External trigger 1 remap

#define TIM2_OR1_TI4_RMP_Pos      (2U)
#define TIM2_OR1_TI4_RMP_Msk      (0x3UL << TIM2_OR1_TI4_RMP_Pos)              //--- 0x0000000C
#define TIM2_OR1_TI4_RMP          TIM2_OR1_TI4_RMP_Msk                         //----TI4_RMP[1:0] bits (TIM2 Input Capture 4 remap)
#define TIM2_OR1_TI4_RMP_0        (0x1UL << TIM2_OR1_TI4_RMP_Pos)              //--- 0x00000004
#define TIM2_OR1_TI4_RMP_1        (0x2UL << TIM2_OR1_TI4_RMP_Pos)              //--- 0x00000008

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM2_OR2 register
//---------------------------------------------------------------------------------------------
#define TIM2_OR2_ETRSEL_Pos       (14U)
#define TIM2_OR2_ETRSEL_Msk       (0x7UL << TIM2_OR2_ETRSEL_Pos)               //--- 0x0001C000
#define TIM2_OR2_ETRSEL           TIM2_OR2_ETRSEL_Msk                          //----ETRSEL[2:0] bits (TIM2 ETR source selection)
#define TIM2_OR2_ETRSEL_0         (0x1UL << TIM2_OR2_ETRSEL_Pos)               //--- 0x00004000
#define TIM2_OR2_ETRSEL_1         (0x2UL << TIM2_OR2_ETRSEL_Pos)               //--- 0x00008000
#define TIM2_OR2_ETRSEL_2         (0x4UL << TIM2_OR2_ETRSEL_Pos)               //--- 0x00010000


//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM15_OR1 register
//---------------------------------------------------------------------------------------------
#define TIM15_OR1_TI1_RMP_Pos           (0U)
#define TIM15_OR1_TI1_RMP_Msk           (0x1UL << TIM15_OR1_TI1_RMP_Pos)       //--- 0x00000001
#define TIM15_OR1_TI1_RMP               TIM15_OR1_TI1_RMP_Msk                  //----TIM15 Input Capture 1 remap

#define TIM15_OR1_ENCODER_MODE_Pos      (1U)
#define TIM15_OR1_ENCODER_MODE_Msk      (0x3UL << TIM15_OR1_ENCODER_MODE_Pos)  //--- 0x00000006
#define TIM15_OR1_ENCODER_MODE          TIM15_OR1_ENCODER_MODE_Msk             //----ENCODER_MODE[1:0] bits (TIM15 Encoder mode)
#define TIM15_OR1_ENCODER_MODE_0        (0x1UL << TIM15_OR1_ENCODER_MODE_Pos)  //--- 0x00000002
#define TIM15_OR1_ENCODER_MODE_1        (0x2UL << TIM15_OR1_ENCODER_MODE_Pos)  //--- 0x00000004

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM15_OR2 register
//---------------------------------------------------------------------------------------------
#define TIM15_OR2_BKINE_Pos             (0U)
#define TIM15_OR2_BKINE_Msk             (0x1UL << TIM15_OR2_BKINE_Pos)         //--- 0x00000001
#define TIM15_OR2_BKINE                 TIM15_OR2_BKINE_Msk                    //----BRK BKIN input enable
#define TIM15_OR2_BKCMP1E_Pos           (1U)
#define TIM15_OR2_BKCMP1E_Msk           (0x1UL << TIM15_OR2_BKCMP1E_Pos)       //--- 0x00000002
#define TIM15_OR2_BKCMP1E               TIM15_OR2_BKCMP1E_Msk                  //----BRK COMP1 enable
#define TIM15_OR2_BKCMP2E_Pos           (2U)
#define TIM15_OR2_BKCMP2E_Msk           (0x1UL << TIM15_OR2_BKCMP2E_Pos)       //--- 0x00000004
#define TIM15_OR2_BKCMP2E               TIM15_OR2_BKCMP2E_Msk                  //----BRK COMP2 enable
#define TIM15_OR2_BKINP_Pos             (9U)
#define TIM15_OR2_BKINP_Msk             (0x1UL << TIM15_OR2_BKINP_Pos)         //--- 0x00000200
#define TIM15_OR2_BKINP                 TIM15_OR2_BKINP_Msk                    //----BRK BKIN input polarity
#define TIM15_OR2_BKCMP1P_Pos           (10U)
#define TIM15_OR2_BKCMP1P_Msk           (0x1UL << TIM15_OR2_BKCMP1P_Pos)       //--- 0x00000400
#define TIM15_OR2_BKCMP1P               TIM15_OR2_BKCMP1P_Msk                  //----BRK COMP1 input polarity
#define TIM15_OR2_BKCMP2P_Pos           (11U)
#define TIM15_OR2_BKCMP2P_Msk           (0x1UL << TIM15_OR2_BKCMP2P_Pos)       //--- 0x00000800
#define TIM15_OR2_BKCMP2P               TIM15_OR2_BKCMP2P_Msk                  //----BRK COMP2 input polarity

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM16_OR1 register
//---------------------------------------------------------------------------------------------
#define TIM16_OR1_TI1_RMP_Pos      (0U)
#define TIM16_OR1_TI1_RMP_Msk      (0x7UL << TIM16_OR1_TI1_RMP_Pos)            //--- 0x00000007
#define TIM16_OR1_TI1_RMP          TIM16_OR1_TI1_RMP_Msk                       //----TI1_RMP[2:0] bits (TIM16 Input Capture 1 remap)
#define TIM16_OR1_TI1_RMP_0        (0x1UL << TIM16_OR1_TI1_RMP_Pos)            //--- 0x00000001
#define TIM16_OR1_TI1_RMP_1        (0x2UL << TIM16_OR1_TI1_RMP_Pos)            //--- 0x00000002
#define TIM16_OR1_TI1_RMP_2        (0x4UL << TIM16_OR1_TI1_RMP_Pos)            //--- 0x00000004

//---------------------------------------------------------------------------------------------
//---  Bit definition for TIM16_OR2 register
//---------------------------------------------------------------------------------------------
#define TIM16_OR2_BKINE_Pos        (0U)
#define TIM16_OR2_BKINE_Msk        (0x1UL << TIM16_OR2_BKINE_Pos)              //--- 0x00000001
#define TIM16_OR2_BKINE            TIM16_OR2_BKINE_Msk                         //----BRK BKIN input enable
#define TIM16_OR2_BKCMP1E_Pos      (1U)
#define TIM16_OR2_BKCMP1E_Msk      (0x1UL << TIM16_OR2_BKCMP1E_Pos)            //--- 0x00000002
#define TIM16_OR2_BKCMP1E          TIM16_OR2_BKCMP1E_Msk                       //----BRK COMP1 enable
#define TIM16_OR2_BKCMP2E_Pos      (2U)
#define TIM16_OR2_BKCMP2E_Msk      (0x1UL << TIM16_OR2_BKCMP2E_Pos)            //--- 0x00000004
#define TIM16_OR2_BKCMP2E          TIM16_OR2_BKCMP2E_Msk                       //----BRK COMP2 enable
#define TIM16_OR2_BKINP_Pos        (9U)
#define TIM16_OR2_BKINP_Msk        (0x1UL << TIM16_OR2_BKINP_Pos)              //--- 0x00000200
#define TIM16_OR2_BKINP            TIM16_OR2_BKINP_Msk                         //----BRK BKIN input polarity
#define TIM16_OR2_BKCMP1P_Pos      (10U)
#define TIM16_OR2_BKCMP1P_Msk      (0x1UL << TIM16_OR2_BKCMP1P_Pos)            //--- 0x00000400
#define TIM16_OR2_BKCMP1P          TIM16_OR2_BKCMP1P_Msk                       //----BRK COMP1 input polarity
#define TIM16_OR2_BKCMP2P_Pos      (11U)
#define TIM16_OR2_BKCMP2P_Msk      (0x1UL << TIM16_OR2_BKCMP2P_Pos)            //--- 0x00000800
#define TIM16_OR2_BKCMP2P          TIM16_OR2_BKCMP2P_Msk                       //----BRK COMP2 input polarity

//---------------------------------------------------------------------------------------------
//---                     Low Power Timer (LPTIM)
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_ISR register
//---------------------------------------------------------------------------------------------
#define LPTIM_ISR_CMPM_Pos          (0U)
#define LPTIM_ISR_CMPM_Msk          (0x1UL << LPTIM_ISR_CMPM_Pos)              //--- 0x00000001
#define LPTIM_ISR_CMPM              LPTIM_ISR_CMPM_Msk                         //--- Compare match
#define LPTIM_ISR_ARRM_Pos          (1U)
#define LPTIM_ISR_ARRM_Msk          (0x1UL << LPTIM_ISR_ARRM_Pos)              //--- 0x00000002
#define LPTIM_ISR_ARRM              LPTIM_ISR_ARRM_Msk                         //--- Autoreload match
#define LPTIM_ISR_EXTTRIG_Pos       (2U)
#define LPTIM_ISR_EXTTRIG_Msk       (0x1UL << LPTIM_ISR_EXTTRIG_Pos)           //--- 0x00000004
#define LPTIM_ISR_EXTTRIG           LPTIM_ISR_EXTTRIG_Msk                      //--- External trigger edge event
#define LPTIM_ISR_CMPOK_Pos         (3U)
#define LPTIM_ISR_CMPOK_Msk         (0x1UL << LPTIM_ISR_CMPOK_Pos)             //--- 0x00000008
#define LPTIM_ISR_CMPOK             LPTIM_ISR_CMPOK_Msk                        //--- Compare register update OK
#define LPTIM_ISR_ARROK_Pos         (4U)
#define LPTIM_ISR_ARROK_Msk         (0x1UL << LPTIM_ISR_ARROK_Pos)             //--- 0x00000010
#define LPTIM_ISR_ARROK             LPTIM_ISR_ARROK_Msk                        //--- Autoreload register update OK
#define LPTIM_ISR_UP_Pos            (5U)
#define LPTIM_ISR_UP_Msk            (0x1UL << LPTIM_ISR_UP_Pos)                //--- 0x00000020
#define LPTIM_ISR_UP                LPTIM_ISR_UP_Msk                           //--- Counter direction change down to up
#define LPTIM_ISR_DOWN_Pos          (6U)
#define LPTIM_ISR_DOWN_Msk          (0x1UL << LPTIM_ISR_DOWN_Pos)              //--- 0x00000040
#define LPTIM_ISR_DOWN              LPTIM_ISR_DOWN_Msk                         //--- Counter direction change up to down

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_ICR register
//---------------------------------------------------------------------------------------------
#define LPTIM_ICR_CMPMCF_Pos        (0U)
#define LPTIM_ICR_CMPMCF_Msk        (0x1UL << LPTIM_ICR_CMPMCF_Pos)            //--- 0x00000001
#define LPTIM_ICR_CMPMCF            LPTIM_ICR_CMPMCF_Msk                       //--- Compare match Clear Flag
#define LPTIM_ICR_ARRMCF_Pos        (1U)
#define LPTIM_ICR_ARRMCF_Msk        (0x1UL << LPTIM_ICR_ARRMCF_Pos)            //--- 0x00000002
#define LPTIM_ICR_ARRMCF            LPTIM_ICR_ARRMCF_Msk                       //--- Autoreload match Clear Flag
#define LPTIM_ICR_EXTTRIGCF_Pos     (2U)
#define LPTIM_ICR_EXTTRIGCF_Msk     (0x1UL << LPTIM_ICR_EXTTRIGCF_Pos)         //--- 0x00000004
#define LPTIM_ICR_EXTTRIGCF         LPTIM_ICR_EXTTRIGCF_Msk                    //--- External trigger edge event Clear Flag
#define LPTIM_ICR_CMPOKCF_Pos       (3U)
#define LPTIM_ICR_CMPOKCF_Msk       (0x1UL << LPTIM_ICR_CMPOKCF_Pos)           //--- 0x00000008
#define LPTIM_ICR_CMPOKCF           LPTIM_ICR_CMPOKCF_Msk                      //--- Compare register update OK Clear Flag
#define LPTIM_ICR_ARROKCF_Pos       (4U)
#define LPTIM_ICR_ARROKCF_Msk       (0x1UL << LPTIM_ICR_ARROKCF_Pos)           //--- 0x00000010
#define LPTIM_ICR_ARROKCF           LPTIM_ICR_ARROKCF_Msk                      //--- Autoreload register update OK Clear Flag
#define LPTIM_ICR_UPCF_Pos          (5U)
#define LPTIM_ICR_UPCF_Msk          (0x1UL << LPTIM_ICR_UPCF_Pos)              //--- 0x00000020
#define LPTIM_ICR_UPCF              LPTIM_ICR_UPCF_Msk                         //--- Counter direction change down to up Clear Flag
#define LPTIM_ICR_DOWNCF_Pos        (6U)
#define LPTIM_ICR_DOWNCF_Msk        (0x1UL << LPTIM_ICR_DOWNCF_Pos)            //--- 0x00000040
#define LPTIM_ICR_DOWNCF            LPTIM_ICR_DOWNCF_Msk                       //--- Counter direction change up to down Clear Flag

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_IER register
//---------------------------------------------------------------------------------------------
#define LPTIM_IER_CMPMIE_Pos        (0U)
#define LPTIM_IER_CMPMIE_Msk        (0x1UL << LPTIM_IER_CMPMIE_Pos)            //--- 0x00000001
#define LPTIM_IER_CMPMIE            LPTIM_IER_CMPMIE_Msk                       //--- Compare match Interrupt Enable
#define LPTIM_IER_ARRMIE_Pos        (1U)
#define LPTIM_IER_ARRMIE_Msk        (0x1UL << LPTIM_IER_ARRMIE_Pos)            //--- 0x00000002
#define LPTIM_IER_ARRMIE            LPTIM_IER_ARRMIE_Msk                       //--- Autoreload match Interrupt Enable
#define LPTIM_IER_EXTTRIGIE_Pos     (2U)
#define LPTIM_IER_EXTTRIGIE_Msk     (0x1UL << LPTIM_IER_EXTTRIGIE_Pos)         //--- 0x00000004
#define LPTIM_IER_EXTTRIGIE         LPTIM_IER_EXTTRIGIE_Msk                    //--- External trigger edge event Interrupt Enable
#define LPTIM_IER_CMPOKIE_Pos       (3U)
#define LPTIM_IER_CMPOKIE_Msk       (0x1UL << LPTIM_IER_CMPOKIE_Pos)           //--- 0x00000008
#define LPTIM_IER_CMPOKIE           LPTIM_IER_CMPOKIE_Msk                      //--- Compare register update OK Interrupt Enable
#define LPTIM_IER_ARROKIE_Pos       (4U)
#define LPTIM_IER_ARROKIE_Msk       (0x1UL << LPTIM_IER_ARROKIE_Pos)           //--- 0x00000010
#define LPTIM_IER_ARROKIE           LPTIM_IER_ARROKIE_Msk                      //--- Autoreload register update OK Interrupt Enable
#define LPTIM_IER_UPIE_Pos          (5U)
#define LPTIM_IER_UPIE_Msk          (0x1UL << LPTIM_IER_UPIE_Pos)              //--- 0x00000020
#define LPTIM_IER_UPIE              LPTIM_IER_UPIE_Msk                         //--- Counter direction change down to up Interrupt Enable
#define LPTIM_IER_DOWNIE_Pos        (6U)
#define LPTIM_IER_DOWNIE_Msk        (0x1UL << LPTIM_IER_DOWNIE_Pos)            //--- 0x00000040
#define LPTIM_IER_DOWNIE            LPTIM_IER_DOWNIE_Msk                       //--- Counter direction change up to down Interrupt Enable

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_CFGR register
//---------------------------------------------------------------------------------------------
#define LPTIM_CFGR_CKSEL_Pos        (0U)
#define LPTIM_CFGR_CKSEL_Msk        (0x1UL << LPTIM_CFGR_CKSEL_Pos)            //--- 0x00000001
#define LPTIM_CFGR_CKSEL            LPTIM_CFGR_CKSEL_Msk                       //--- Clock selector

