Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define LPTIM_CFGR_CKPOL_Pos        (1U)
#define LPTIM_CFGR_CKPOL_Msk        (0x3UL << LPTIM_CFGR_CKPOL_Pos)            //--- 0x00000006
#define LPTIM_CFGR_CKPOL            LPTIM_CFGR_CKPOL_Msk                       //--- CKPOL[1:0] bits (Clock polarity)
#define LPTIM_CFGR_CKPOL_0          (0x1UL << LPTIM_CFGR_CKPOL_Pos)            //--- 0x00000002
#define LPTIM_CFGR_CKPOL_1          (0x2UL << LPTIM_CFGR_CKPOL_Pos)            //--- 0x00000004

#define LPTIM_CFGR_CKFLT_Pos        (3U)
#define LPTIM_CFGR_CKFLT_Msk        (0x3UL << LPTIM_CFGR_CKFLT_Pos)            //--- 0x00000018
#define LPTIM_CFGR_CKFLT            LPTIM_CFGR_CKFLT_Msk                       //--- CKFLT[1:0] bits (Configurable digital filter for external clock)
#define LPTIM_CFGR_CKFLT_0          (0x1UL << LPTIM_CFGR_CKFLT_Pos)            //--- 0x00000008
#define LPTIM_CFGR_CKFLT_1          (0x2UL << LPTIM_CFGR_CKFLT_Pos)            //--- 0x00000010

#define LPTIM_CFGR_TRGFLT_Pos       (6U)
#define LPTIM_CFGR_TRGFLT_Msk       (0x3UL << LPTIM_CFGR_TRGFLT_Pos)           //--- 0x000000C0
#define LPTIM_CFGR_TRGFLT           LPTIM_CFGR_TRGFLT_Msk                      //--- TRGFLT[1:0] bits (Configurable digital filter for trigger)
#define LPTIM_CFGR_TRGFLT_0         (0x1UL << LPTIM_CFGR_TRGFLT_Pos)           //--- 0x00000040
#define LPTIM_CFGR_TRGFLT_1         (0x2UL << LPTIM_CFGR_TRGFLT_Pos)           //--- 0x00000080

#define LPTIM_CFGR_PRESC_Pos        (9U)
#define LPTIM_CFGR_PRESC_Msk        (0x7UL << LPTIM_CFGR_PRESC_Pos)            //--- 0x00000E00
#define LPTIM_CFGR_PRESC            LPTIM_CFGR_PRESC_Msk                       //--- PRESC[2:0] bits (Clock prescaler)
#define LPTIM_CFGR_PRESC_0          (0x1UL << LPTIM_CFGR_PRESC_Pos)            //--- 0x00000200
#define LPTIM_CFGR_PRESC_1          (0x2UL << LPTIM_CFGR_PRESC_Pos)            //--- 0x00000400
#define LPTIM_CFGR_PRESC_2          (0x4UL << LPTIM_CFGR_PRESC_Pos)            //--- 0x00000800

#define LPTIM_CFGR_TRIGSEL_Pos      (13U)
#define LPTIM_CFGR_TRIGSEL_Msk      (0x7UL << LPTIM_CFGR_TRIGSEL_Pos)          //--- 0x0000E000
#define LPTIM_CFGR_TRIGSEL          LPTIM_CFGR_TRIGSEL_Msk                     //--- TRIGSEL[2:0]] bits (Trigger selector)
#define LPTIM_CFGR_TRIGSEL_0        (0x1UL << LPTIM_CFGR_TRIGSEL_Pos)          //--- 0x00002000
#define LPTIM_CFGR_TRIGSEL_1        (0x2UL << LPTIM_CFGR_TRIGSEL_Pos)          //--- 0x00004000
#define LPTIM_CFGR_TRIGSEL_2        (0x4UL << LPTIM_CFGR_TRIGSEL_Pos)          //--- 0x00008000

#define LPTIM_CFGR_TRIGEN_Pos       (17U)
#define LPTIM_CFGR_TRIGEN_Msk       (0x3UL << LPTIM_CFGR_TRIGEN_Pos)           //--- 0x00060000
#define LPTIM_CFGR_TRIGEN           LPTIM_CFGR_TRIGEN_Msk                      //--- TRIGEN[1:0] bits (Trigger enable and polarity)
#define LPTIM_CFGR_TRIGEN_0         (0x1UL << LPTIM_CFGR_TRIGEN_Pos)           //--- 0x00020000
#define LPTIM_CFGR_TRIGEN_1         (0x2UL << LPTIM_CFGR_TRIGEN_Pos)           //--- 0x00040000

#define LPTIM_CFGR_TIMOUT_Pos       (19U)
#define LPTIM_CFGR_TIMOUT_Msk       (0x1UL << LPTIM_CFGR_TIMOUT_Pos)           //--- 0x00080000
#define LPTIM_CFGR_TIMOUT           LPTIM_CFGR_TIMOUT_Msk                      //--- Timout enable
#define LPTIM_CFGR_WAVE_Pos         (20U)
#define LPTIM_CFGR_WAVE_Msk         (0x1UL << LPTIM_CFGR_WAVE_Pos)             //--- 0x00100000
#define LPTIM_CFGR_WAVE             LPTIM_CFGR_WAVE_Msk                        //--- Waveform shape
#define LPTIM_CFGR_WAVPOL_Pos       (21U)
#define LPTIM_CFGR_WAVPOL_Msk       (0x1UL << LPTIM_CFGR_WAVPOL_Pos)           //--- 0x00200000
#define LPTIM_CFGR_WAVPOL           LPTIM_CFGR_WAVPOL_Msk                      //--- Waveform shape polarity
#define LPTIM_CFGR_PRELOAD_Pos      (22U)
#define LPTIM_CFGR_PRELOAD_Msk      (0x1UL << LPTIM_CFGR_PRELOAD_Pos)          //--- 0x00400000
#define LPTIM_CFGR_PRELOAD          LPTIM_CFGR_PRELOAD_Msk                     //--- Reg update mode
#define LPTIM_CFGR_COUNTMODE_Pos    (23U)
#define LPTIM_CFGR_COUNTMODE_Msk    (0x1UL << LPTIM_CFGR_COUNTMODE_Pos)        //--- 0x00800000
#define LPTIM_CFGR_COUNTMODE        LPTIM_CFGR_COUNTMODE_Msk                   //--- Counter mode enable
#define LPTIM_CFGR_ENC_Pos          (24U)
#define LPTIM_CFGR_ENC_Msk          (0x1UL << LPTIM_CFGR_ENC_Pos)              //--- 0x01000000
#define LPTIM_CFGR_ENC              LPTIM_CFGR_ENC_Msk                         //--- Encoder mode enable

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_CR register
//---------------------------------------------------------------------------------------------
#define LPTIM_CR_ENABLE_Pos         (0U)
#define LPTIM_CR_ENABLE_Msk         (0x1UL << LPTIM_CR_ENABLE_Pos)             //--- 0x00000001
#define LPTIM_CR_ENABLE             LPTIM_CR_ENABLE_Msk                        //--- LPTIMer enable
#define LPTIM_CR_SNGSTRT_Pos        (1U)
#define LPTIM_CR_SNGSTRT_Msk        (0x1UL << LPTIM_CR_SNGSTRT_Pos)            //--- 0x00000002
#define LPTIM_CR_SNGSTRT            LPTIM_CR_SNGSTRT_Msk                       //--- Timer start in single mode
#define LPTIM_CR_CNTSTRT_Pos        (2U)
#define LPTIM_CR_CNTSTRT_Msk        (0x1UL << LPTIM_CR_CNTSTRT_Pos)            //--- 0x00000004
#define LPTIM_CR_CNTSTRT            LPTIM_CR_CNTSTRT_Msk                       //--- Timer start in continuous mode

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_CMP register
//---------------------------------------------------------------------------------------------
#define LPTIM_CMP_CMP_Pos           (0U)
#define LPTIM_CMP_CMP_Msk           (0xFFFFUL << LPTIM_CMP_CMP_Pos)            //--- 0x0000FFFF
#define LPTIM_CMP_CMP               LPTIM_CMP_CMP_Msk                          //--- Compare register

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_ARR register
//---------------------------------------------------------------------------------------------
#define LPTIM_ARR_ARR_Pos           (0U)
#define LPTIM_ARR_ARR_Msk           (0xFFFFUL << LPTIM_ARR_ARR_Pos)            //--- 0x0000FFFF
#define LPTIM_ARR_ARR               LPTIM_ARR_ARR_Msk                          //--- Auto reload register

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_CNT register
//---------------------------------------------------------------------------------------------
#define LPTIM_CNT_CNT_Pos           (0U)
#define LPTIM_CNT_CNT_Msk           (0xFFFFUL << LPTIM_CNT_CNT_Pos)            //--- 0x0000FFFF
#define LPTIM_CNT_CNT               LPTIM_CNT_CNT_Msk                          //--- Counter register

//---------------------------------------------------------------------------------------------
//---   Bit definition for LPTIM_OR register
//---------------------------------------------------------------------------------------------
#define LPTIM_OR_OR_Pos             (0U)
#define LPTIM_OR_OR_Msk             (0x3UL << LPTIM_OR_OR_Pos)                 //--- 0x00000003
#define LPTIM_OR_OR                 LPTIM_OR_OR_Msk                            //--- OR[1:0] bits (Remap selection)
#define LPTIM_OR_OR_0               (0x1UL << LPTIM_OR_OR_Pos)                 //--- 0x00000001
#define LPTIM_OR_OR_1               (0x2UL << LPTIM_OR_OR_Pos)                 //--- 0x00000002

//---------------------------------------------------------------------------------------------
//---                       Analog Comparators (COMP)
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for COMP_CSR register
//---------------------------------------------------------------------------------------------
#define COMP_CSR_EN_Pos            (0U)
#define COMP_CSR_EN_Msk            (0x1UL << COMP_CSR_EN_Pos)                  //--- 0x00000001
#define COMP_CSR_EN                COMP_CSR_EN_Msk                             //--- Comparator enable

#define COMP_CSR_PWRMODE_Pos       (2U)
#define COMP_CSR_PWRMODE_Msk       (0x3UL << COMP_CSR_PWRMODE_Pos)             //--- 0x0000000C
#define COMP_CSR_PWRMODE           COMP_CSR_PWRMODE_Msk                        //--- Comparator power mode
#define COMP_CSR_PWRMODE_0         (0x1UL << COMP_CSR_PWRMODE_Pos)             //--- 0x00000004
#define COMP_CSR_PWRMODE_1         (0x2UL << COMP_CSR_PWRMODE_Pos)             //--- 0x00000008

#define COMP_CSR_INMSEL_Pos        (4U)
#define COMP_CSR_INMSEL_Msk        (0x7UL << COMP_CSR_INMSEL_Pos)              //--- 0x00000070
#define COMP_CSR_INMSEL            COMP_CSR_INMSEL_Msk                         //--- Comparator input minus selection
#define COMP_CSR_INMSEL_0          (0x1UL << COMP_CSR_INMSEL_Pos)              //--- 0x00000010
#define COMP_CSR_INMSEL_1          (0x2UL << COMP_CSR_INMSEL_Pos)              //--- 0x00000020
#define COMP_CSR_INMSEL_2          (0x4UL << COMP_CSR_INMSEL_Pos)              //--- 0x00000040

#define COMP_CSR_INPSEL_Pos        (7U)
#define COMP_CSR_INPSEL_Msk        (0x3UL << COMP_CSR_INPSEL_Pos)              //--- 0x00000180
#define COMP_CSR_INPSEL            COMP_CSR_INPSEL_Msk                         //--- Comparator input plus selection
#define COMP_CSR_INPSEL_0          (0x1UL << COMP_CSR_INPSEL_Pos)              //--- 0x00000080
#define COMP_CSR_INPSEL_1          (0x2UL << COMP_CSR_INPSEL_Pos)              //--- 0x00000100

#define COMP_CSR_WINMODE_Pos       (9U)
#define COMP_CSR_WINMODE_Msk       (0x1UL << COMP_CSR_WINMODE_Pos)             //--- 0x00000200
#define COMP_CSR_WINMODE           COMP_CSR_WINMODE_Msk                        //--- Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)

#define COMP_CSR_POLARITY_Pos      (15U)
#define COMP_CSR_POLARITY_Msk      (0x1UL << COMP_CSR_POLARITY_Pos)            //--- 0x00008000
#define COMP_CSR_POLARITY          COMP_CSR_POLARITY_Msk                       //--- Comparator output polarity

#define COMP_CSR_HYST_Pos          (16U)
#define COMP_CSR_HYST_Msk          (0x3UL << COMP_CSR_HYST_Pos)                //--- 0x00030000
#define COMP_CSR_HYST              COMP_CSR_HYST_Msk                           //--- Comparator hysteresis
#define COMP_CSR_HYST_0            (0x1UL << COMP_CSR_HYST_Pos)                //--- 0x00010000
#define COMP_CSR_HYST_1            (0x2UL << COMP_CSR_HYST_Pos)                //--- 0x00020000

#define COMP_CSR_BLANKING_Pos      (18U)
#define COMP_CSR_BLANKING_Msk      (0x7UL << COMP_CSR_BLANKING_Pos)            //--- 0x001C0000
#define COMP_CSR_BLANKING          COMP_CSR_BLANKING_Msk                       //--- Comparator blanking source
#define COMP_CSR_BLANKING_0        (0x1UL << COMP_CSR_BLANKING_Pos)            //--- 0x00040000
#define COMP_CSR_BLANKING_1        (0x2UL << COMP_CSR_BLANKING_Pos)            //--- 0x00080000
#define COMP_CSR_BLANKING_2        (0x4UL << COMP_CSR_BLANKING_Pos)            //--- 0x00100000

#define COMP_CSR_BRGEN_Pos         (22U)
#define COMP_CSR_BRGEN_Msk         (0x1UL << COMP_CSR_BRGEN_Pos)               //--- 0x00400000
#define COMP_CSR_BRGEN             COMP_CSR_BRGEN_Msk                          //--- Comparator voltage scaler enable
#define COMP_CSR_SCALEN_Pos        (23U)
#define COMP_CSR_SCALEN_Msk        (0x1UL << COMP_CSR_SCALEN_Pos)              //--- 0x00800000
#define COMP_CSR_SCALEN            COMP_CSR_SCALEN_Msk                         //--- Comparator scaler bridge enable

#define COMP_CSR_INMESEL_Pos       (25U)
#define COMP_CSR_INMESEL_Msk       (0x3UL << COMP_CSR_INMESEL_Pos)             //--- 0x06000000
#define COMP_CSR_INMESEL           COMP_CSR_INMESEL_Msk                        //--- Comparator input minus extended selection
#define COMP_CSR_INMESEL_0         (0x1UL << COMP_CSR_INMESEL_Pos)             //--- 0x02000000
#define COMP_CSR_INMESEL_1         (0x2UL << COMP_CSR_INMESEL_Pos)             //--- 0x04000000

#define COMP_CSR_VALUE_Pos         (30U)
#define COMP_CSR_VALUE_Msk         (0x1UL << COMP_CSR_VALUE_Pos)               //--- 0x40000000
#define COMP_CSR_VALUE             COMP_CSR_VALUE_Msk                          //--- Comparator output level

#define COMP_CSR_LOCK_Pos          (31U)
#define COMP_CSR_LOCK_Msk          (0x1UL << COMP_CSR_LOCK_Pos)                //--- 0x80000000
#define COMP_CSR_LOCK              COMP_CSR_LOCK_Msk                           //--- Comparator lock

//---------------------------------------------------------------------------------------------
//---                          Operational Amplifier (OPAMP)
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---   Bit definition for OPAMPx_CSR register
//---------------------------------------------------------------------------------------------
#define OPAMP_CSR_OPAMPxEN_Pos           (0U)
#define OPAMP_CSR_OPAMPxEN_Msk           (0x1UL << OPAMP_CSR_OPAMPxEN_Pos)     //--- 0x00000001
#define OPAMP_CSR_OPAMPxEN               OPAMP_CSR_OPAMPxEN_Msk                //--- OPAMP enable
#define OPAMP_CSR_OPALPM_Pos             (1U)
#define OPAMP_CSR_OPALPM_Msk             (0x1UL << OPAMP_CSR_OPALPM_Pos)       //--- 0x00000002
#define OPAMP_CSR_OPALPM                 OPAMP_CSR_OPALPM_Msk                  //--- Operational amplifier Low Power Mode

