Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define OPAMP_CSR_OPAMODE_Pos            (2U)
#define OPAMP_CSR_OPAMODE_Msk            (0x3UL << OPAMP_CSR_OPAMODE_Pos)      //--- 0x0000000C
#define OPAMP_CSR_OPAMODE                OPAMP_CSR_OPAMODE_Msk                 //--- Operational amplifier PGA mode
#define OPAMP_CSR_OPAMODE_0              (0x1UL << OPAMP_CSR_OPAMODE_Pos)      //--- 0x00000004
#define OPAMP_CSR_OPAMODE_1              (0x2UL << OPAMP_CSR_OPAMODE_Pos)      //--- 0x00000008

#define OPAMP_CSR_PGGAIN_Pos             (4U)
#define OPAMP_CSR_PGGAIN_Msk             (0x3UL << OPAMP_CSR_PGGAIN_Pos)       //--- 0x00000030
#define OPAMP_CSR_PGGAIN                 OPAMP_CSR_PGGAIN_Msk                  //--- Operational amplifier Programmable amplifier gain value
#define OPAMP_CSR_PGGAIN_0               (0x1UL << OPAMP_CSR_PGGAIN_Pos)       //--- 0x00000010
#define OPAMP_CSR_PGGAIN_1               (0x2UL << OPAMP_CSR_PGGAIN_Pos)       //--- 0x00000020

#define OPAMP_CSR_VMSEL_Pos              (8U)
#define OPAMP_CSR_VMSEL_Msk              (0x3UL << OPAMP_CSR_VMSEL_Pos)        //--- 0x00000300
#define OPAMP_CSR_VMSEL                  OPAMP_CSR_VMSEL_Msk                   //--- Inverting input selection
#define OPAMP_CSR_VMSEL_0                (0x1UL << OPAMP_CSR_VMSEL_Pos)        //--- 0x00000100
#define OPAMP_CSR_VMSEL_1                (0x2UL << OPAMP_CSR_VMSEL_Pos)        //--- 0x00000200

#define OPAMP_CSR_VPSEL_Pos              (10U)
#define OPAMP_CSR_VPSEL_Msk              (0x1UL << OPAMP_CSR_VPSEL_Pos)        //--- 0x00000400
#define OPAMP_CSR_VPSEL                  OPAMP_CSR_VPSEL_Msk                   //--- Non inverted input selection
#define OPAMP_CSR_CALON_Pos              (12U)
#define OPAMP_CSR_CALON_Msk              (0x1UL << OPAMP_CSR_CALON_Pos)        //--- 0x00001000
#define OPAMP_CSR_CALON                  OPAMP_CSR_CALON_Msk                   //--- Calibration mode enable
#define OPAMP_CSR_CALSEL_Pos             (13U)
#define OPAMP_CSR_CALSEL_Msk             (0x1UL << OPAMP_CSR_CALSEL_Pos)       //--- 0x00002000
#define OPAMP_CSR_CALSEL                 OPAMP_CSR_CALSEL_Msk                  //--- Calibration selection
#define OPAMP_CSR_USERTRIM_Pos           (14U)
#define OPAMP_CSR_USERTRIM_Msk           (0x1UL << OPAMP_CSR_USERTRIM_Pos)     //--- 0x00004000
#define OPAMP_CSR_USERTRIM               OPAMP_CSR_USERTRIM_Msk                //--- User trimming enable
#define OPAMP_CSR_CALOUT_Pos             (15U)
#define OPAMP_CSR_CALOUT_Msk             (0x1UL << OPAMP_CSR_CALOUT_Pos)       //--- 0x00008000
#define OPAMP_CSR_CALOUT                 OPAMP_CSR_CALOUT_Msk                  //--- Operational amplifier1 calibration output

//---------------------------------------------------------------------------------------------
//---   Bit definition for OPAMP1_CSR register
//---------------------------------------------------------------------------------------------
#define OPAMP1_CSR_OPAEN_Pos              (0U)
#define OPAMP1_CSR_OPAEN_Msk              (0x1UL << OPAMP1_CSR_OPAEN_Pos)      //--- 0x00000001
#define OPAMP1_CSR_OPAEN                  OPAMP1_CSR_OPAEN_Msk                 //--- Operational amplifier1 Enable
#define OPAMP1_CSR_OPALPM_Pos             (1U)
#define OPAMP1_CSR_OPALPM_Msk             (0x1UL << OPAMP1_CSR_OPALPM_Pos)     //--- 0x00000002
#define OPAMP1_CSR_OPALPM                 OPAMP1_CSR_OPALPM_Msk                //--- Operational amplifier1 Low Power Mode

#define OPAMP1_CSR_OPAMODE_Pos            (2U)
#define OPAMP1_CSR_OPAMODE_Msk            (0x3UL << OPAMP1_CSR_OPAMODE_Pos)    //--- 0x0000000C
#define OPAMP1_CSR_OPAMODE                OPAMP1_CSR_OPAMODE_Msk               //--- Operational amplifier1 PGA mode
#define OPAMP1_CSR_OPAMODE_0              (0x1UL << OPAMP1_CSR_OPAMODE_Pos)    //--- 0x00000004
#define OPAMP1_CSR_OPAMODE_1              (0x2UL << OPAMP1_CSR_OPAMODE_Pos)    //--- 0x00000008

#define OPAMP1_CSR_PGAGAIN_Pos            (4U)
#define OPAMP1_CSR_PGAGAIN_Msk            (0x3UL << OPAMP1_CSR_PGAGAIN_Pos)    //--- 0x00000030
#define OPAMP1_CSR_PGAGAIN                OPAMP1_CSR_PGAGAIN_Msk               //--- Operational amplifier1 Programmable amplifier gain value
#define OPAMP1_CSR_PGAGAIN_0              (0x1UL << OPAMP1_CSR_PGAGAIN_Pos)    //--- 0x00000010
#define OPAMP1_CSR_PGAGAIN_1              (0x2UL << OPAMP1_CSR_PGAGAIN_Pos)    //--- 0x00000020

#define OPAMP1_CSR_VMSEL_Pos              (8U)
#define OPAMP1_CSR_VMSEL_Msk              (0x3UL << OPAMP1_CSR_VMSEL_Pos)      //--- 0x00000300
#define OPAMP1_CSR_VMSEL                  OPAMP1_CSR_VMSEL_Msk                 //--- Inverting input selection
#define OPAMP1_CSR_VMSEL_0                (0x1UL << OPAMP1_CSR_VMSEL_Pos)      //--- 0x00000100
#define OPAMP1_CSR_VMSEL_1                (0x2UL << OPAMP1_CSR_VMSEL_Pos)      //--- 0x00000200

#define OPAMP1_CSR_VPSEL_Pos              (10U)
#define OPAMP1_CSR_VPSEL_Msk              (0x1UL << OPAMP1_CSR_VPSEL_Pos)      //--- 0x00000400
#define OPAMP1_CSR_VPSEL                  OPAMP1_CSR_VPSEL_Msk                 //--- Non inverted input selection
#define OPAMP1_CSR_CALON_Pos              (12U)
#define OPAMP1_CSR_CALON_Msk              (0x1UL << OPAMP1_CSR_CALON_Pos)      //--- 0x00001000
#define OPAMP1_CSR_CALON                  OPAMP1_CSR_CALON_Msk                 //--- Calibration mode enable
#define OPAMP1_CSR_CALSEL_Pos             (13U)
#define OPAMP1_CSR_CALSEL_Msk             (0x1UL << OPAMP1_CSR_CALSEL_Pos)     //--- 0x00002000
#define OPAMP1_CSR_CALSEL                 OPAMP1_CSR_CALSEL_Msk                //--- Calibration selection
#define OPAMP1_CSR_USERTRIM_Pos           (14U)
#define OPAMP1_CSR_USERTRIM_Msk           (0x1UL << OPAMP1_CSR_USERTRIM_Pos)   //--- 0x00004000
#define OPAMP1_CSR_USERTRIM               OPAMP1_CSR_USERTRIM_Msk              //--- User trimming enable
#define OPAMP1_CSR_CALOUT_Pos             (15U)
#define OPAMP1_CSR_CALOUT_Msk             (0x1UL << OPAMP1_CSR_CALOUT_Pos)     //--- 0x00008000
#define OPAMP1_CSR_CALOUT                 OPAMP1_CSR_CALOUT_Msk                //--- Operational amplifier1 calibration output

#define OPAMP1_CSR_OPARANGE_Pos           (31U)
#define OPAMP1_CSR_OPARANGE_Msk           (0x1UL << OPAMP1_CSR_OPARANGE_Pos)   //--- 0x80000000
#define OPAMP1_CSR_OPARANGE               OPAMP1_CSR_OPARANGE_Msk              //--- Common to several OPAMP instances: Operational amplifier voltage supply range. Bit intended to be used with OPAMP common instance (OPAMP_Common_TypeDef)

//---------------------------------------------------------------------------------------------
//---  Bit definition for OPAMP_OTR register
//---------------------------------------------------------------------------------------------
#define OPAMP_OTR_TRIMOFFSETN_Pos        (0U)
#define OPAMP_OTR_TRIMOFFSETN_Msk        (0x1FUL << OPAMP_OTR_TRIMOFFSETN_Pos) //--- 0x0000001F
#define OPAMP_OTR_TRIMOFFSETN            OPAMP_OTR_TRIMOFFSETN_Msk             //--- Trim for NMOS differential pairs
#define OPAMP_OTR_TRIMOFFSETP_Pos        (8U)
#define OPAMP_OTR_TRIMOFFSETP_Msk        (0x1FUL << OPAMP_OTR_TRIMOFFSETP_Pos) //--- 0x00001F00
#define OPAMP_OTR_TRIMOFFSETP            OPAMP_OTR_TRIMOFFSETP_Msk             //--- Trim for PMOS differential pairs

//---------------------------------------------------------------------------------------------
//---  Bit definition for OPAMP1_OTR register
//---------------------------------------------------------------------------------------------
#define OPAMP1_OTR_TRIMOFFSETN_Pos        (0U)
#define OPAMP1_OTR_TRIMOFFSETN_Msk        (0x1FUL << OPAMP1_OTR_TRIMOFFSETN_Pos) //--- 0x0000001F
#define OPAMP1_OTR_TRIMOFFSETN            OPAMP1_OTR_TRIMOFFSETN_Msk           //--- Trim for NMOS differential pairs
#define OPAMP1_OTR_TRIMOFFSETP_Pos        (8U)
#define OPAMP1_OTR_TRIMOFFSETP_Msk        (0x1FUL << OPAMP1_OTR_TRIMOFFSETP_Pos) //--- 0x00001F00
#define OPAMP1_OTR_TRIMOFFSETP            OPAMP1_OTR_TRIMOFFSETP_Msk           //--- Trim for PMOS differential pairs

//---------------------------------------------------------------------------------------------
//---  Bit definition for OPAMP_LPOTR register
//---------------------------------------------------------------------------------------------
#define OPAMP_LPOTR_TRIMLPOFFSETN_Pos    (0U)
#define OPAMP_LPOTR_TRIMLPOFFSETN_Msk    (0x1FUL << OPAMP_LPOTR_TRIMLPOFFSETN_Pos) //--- 0x0000001F
#define OPAMP_LPOTR_TRIMLPOFFSETN        OPAMP_LPOTR_TRIMLPOFFSETN_Msk         //--- Trim for NMOS differential pairs
#define OPAMP_LPOTR_TRIMLPOFFSETP_Pos    (8U)
#define OPAMP_LPOTR_TRIMLPOFFSETP_Msk    (0x1FUL << OPAMP_LPOTR_TRIMLPOFFSETP_Pos) //--- 0x00001F00
#define OPAMP_LPOTR_TRIMLPOFFSETP        OPAMP_LPOTR_TRIMLPOFFSETP_Msk         //--- Trim for PMOS differential pairs

//---------------------------------------------------------------------------------------------
//---  Bit definition for OPAMP1_LPOTR register
//---------------------------------------------------------------------------------------------
#define OPAMP1_LPOTR_TRIMLPOFFSETN_Pos    (0U)
#define OPAMP1_LPOTR_TRIMLPOFFSETN_Msk    (0x1FUL << OPAMP1_LPOTR_TRIMLPOFFSETN_Pos) //--- 0x0000001F
#define OPAMP1_LPOTR_TRIMLPOFFSETN        OPAMP1_LPOTR_TRIMLPOFFSETN_Msk       //--- Trim for NMOS differential pairs
#define OPAMP1_LPOTR_TRIMLPOFFSETP_Pos    (8U)
#define OPAMP1_LPOTR_TRIMLPOFFSETP_Msk    (0x1FUL << OPAMP1_LPOTR_TRIMLPOFFSETP_Pos) //--- 0x00001F00
#define OPAMP1_LPOTR_TRIMLPOFFSETP        OPAMP1_LPOTR_TRIMLPOFFSETP_Msk       //--- Trim for PMOS differential pairs

//---------------------------------------------------------------------------------------------
//---  Touch Sensing Controller (TSC)
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_CR register
//---------------------------------------------------------------------------------------------
#define TSC_CR_TSCE_Pos          (0U)
#define TSC_CR_TSCE_Msk          (0x1UL << TSC_CR_TSCE_Pos)                    //--- 0x00000001
#define TSC_CR_TSCE              TSC_CR_TSCE_Msk                               //----Touch sensing controller enable
#define TSC_CR_START_Pos         (1U)
#define TSC_CR_START_Msk         (0x1UL << TSC_CR_START_Pos)                   //--- 0x00000002
#define TSC_CR_START             TSC_CR_START_Msk                              //----Start acquisition
#define TSC_CR_AM_Pos            (2U)
#define TSC_CR_AM_Msk            (0x1UL << TSC_CR_AM_Pos)                      //--- 0x00000004
#define TSC_CR_AM                TSC_CR_AM_Msk                                 //----Acquisition mode
#define TSC_CR_SYNCPOL_Pos       (3U)
#define TSC_CR_SYNCPOL_Msk       (0x1UL << TSC_CR_SYNCPOL_Pos)                 //--- 0x00000008
#define TSC_CR_SYNCPOL           TSC_CR_SYNCPOL_Msk                            //----Synchronization pin polarity
#define TSC_CR_IODEF_Pos         (4U)
#define TSC_CR_IODEF_Msk         (0x1UL << TSC_CR_IODEF_Pos)                   //--- 0x00000010
#define TSC_CR_IODEF             TSC_CR_IODEF_Msk                              //----IO default mode

#define TSC_CR_MCV_Pos           (5U)
#define TSC_CR_MCV_Msk           (0x7UL << TSC_CR_MCV_Pos)                     //--- 0x000000E0
#define TSC_CR_MCV               TSC_CR_MCV_Msk                                //----MCV[2:0] bits (Max Count Value)
#define TSC_CR_MCV_0             (0x1UL << TSC_CR_MCV_Pos)                     //--- 0x00000020
#define TSC_CR_MCV_1             (0x2UL << TSC_CR_MCV_Pos)                     //--- 0x00000040
#define TSC_CR_MCV_2             (0x4UL << TSC_CR_MCV_Pos)                     //--- 0x00000080

#define TSC_CR_PGPSC_Pos         (12U)
#define TSC_CR_PGPSC_Msk         (0x7UL << TSC_CR_PGPSC_Pos)                   //--- 0x00007000
#define TSC_CR_PGPSC             TSC_CR_PGPSC_Msk                              //----PGPSC[2:0] bits (Pulse Generator Prescaler)
#define TSC_CR_PGPSC_0           (0x1UL << TSC_CR_PGPSC_Pos)                   //--- 0x00001000
#define TSC_CR_PGPSC_1           (0x2UL << TSC_CR_PGPSC_Pos)                   //--- 0x00002000
#define TSC_CR_PGPSC_2           (0x4UL << TSC_CR_PGPSC_Pos)                   //--- 0x00004000

#define TSC_CR_SSPSC_Pos         (15U)
#define TSC_CR_SSPSC_Msk         (0x1UL << TSC_CR_SSPSC_Pos)                   //--- 0x00008000
#define TSC_CR_SSPSC             TSC_CR_SSPSC_Msk                              //----Spread Spectrum Prescaler
#define TSC_CR_SSE_Pos           (16U)
#define TSC_CR_SSE_Msk           (0x1UL << TSC_CR_SSE_Pos)                     //--- 0x00010000
#define TSC_CR_SSE               TSC_CR_SSE_Msk                                //----Spread Spectrum Enable

#define TSC_CR_SSD_Pos           (17U)
#define TSC_CR_SSD_Msk           (0x7FUL << TSC_CR_SSD_Pos)                    //--- 0x00FE0000
#define TSC_CR_SSD               TSC_CR_SSD_Msk                                //----SSD[6:0] bits (Spread Spectrum Deviation)
#define TSC_CR_SSD_0             (0x01UL << TSC_CR_SSD_Pos)                    //--- 0x00020000
#define TSC_CR_SSD_1             (0x02UL << TSC_CR_SSD_Pos)                    //--- 0x00040000
#define TSC_CR_SSD_2             (0x04UL << TSC_CR_SSD_Pos)                    //--- 0x00080000
#define TSC_CR_SSD_3             (0x08UL << TSC_CR_SSD_Pos)                    //--- 0x00100000
#define TSC_CR_SSD_4             (0x10UL << TSC_CR_SSD_Pos)                    //--- 0x00200000
#define TSC_CR_SSD_5             (0x20UL << TSC_CR_SSD_Pos)                    //--- 0x00400000
#define TSC_CR_SSD_6             (0x40UL << TSC_CR_SSD_Pos)                    //--- 0x00800000

