Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define TSC_CR_CTPL_Pos          (24U)
#define TSC_CR_CTPL_Msk          (0xFUL << TSC_CR_CTPL_Pos)                    //--- 0x0F000000
#define TSC_CR_CTPL              TSC_CR_CTPL_Msk                               //----CTPL[3:0] bits (Charge Transfer pulse low)
#define TSC_CR_CTPL_0            (0x1UL << TSC_CR_CTPL_Pos)                    //--- 0x01000000
#define TSC_CR_CTPL_1            (0x2UL << TSC_CR_CTPL_Pos)                    //--- 0x02000000
#define TSC_CR_CTPL_2            (0x4UL << TSC_CR_CTPL_Pos)                    //--- 0x04000000
#define TSC_CR_CTPL_3            (0x8UL << TSC_CR_CTPL_Pos)                    //--- 0x08000000

#define TSC_CR_CTPH_Pos          (28U)
#define TSC_CR_CTPH_Msk          (0xFUL << TSC_CR_CTPH_Pos)                    //--- 0xF0000000
#define TSC_CR_CTPH              TSC_CR_CTPH_Msk                               //----CTPH[3:0] bits (Charge Transfer pulse high)
#define TSC_CR_CTPH_0            (0x1UL << TSC_CR_CTPH_Pos)                    //--- 0x10000000
#define TSC_CR_CTPH_1            (0x2UL << TSC_CR_CTPH_Pos)                    //--- 0x20000000
#define TSC_CR_CTPH_2            (0x4UL << TSC_CR_CTPH_Pos)                    //--- 0x40000000
#define TSC_CR_CTPH_3            (0x8UL << TSC_CR_CTPH_Pos)                    //--- 0x80000000

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_IER register
//---------------------------------------------------------------------------------------------
#define TSC_IER_EOAIE_Pos        (0U)
#define TSC_IER_EOAIE_Msk        (0x1UL << TSC_IER_EOAIE_Pos)                  //--- 0x00000001
#define TSC_IER_EOAIE            TSC_IER_EOAIE_Msk                             //----End of acquisition interrupt enable
#define TSC_IER_MCEIE_Pos        (1U)
#define TSC_IER_MCEIE_Msk        (0x1UL << TSC_IER_MCEIE_Pos)                  //--- 0x00000002
#define TSC_IER_MCEIE            TSC_IER_MCEIE_Msk                             //----Max count error interrupt enable

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_ICR register
//---------------------------------------------------------------------------------------------
#define TSC_ICR_EOAIC_Pos        (0U)
#define TSC_ICR_EOAIC_Msk        (0x1UL << TSC_ICR_EOAIC_Pos)                  //--- 0x00000001
#define TSC_ICR_EOAIC            TSC_ICR_EOAIC_Msk                             //----End of acquisition interrupt clear
#define TSC_ICR_MCEIC_Pos        (1U)
#define TSC_ICR_MCEIC_Msk        (0x1UL << TSC_ICR_MCEIC_Pos)                  //--- 0x00000002
#define TSC_ICR_MCEIC            TSC_ICR_MCEIC_Msk                             //----Max count error interrupt clear

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_ISR register
//---------------------------------------------------------------------------------------------
#define TSC_ISR_EOAF_Pos         (0U)
#define TSC_ISR_EOAF_Msk         (0x1UL << TSC_ISR_EOAF_Pos)                   //--- 0x00000001
#define TSC_ISR_EOAF             TSC_ISR_EOAF_Msk                              //----End of acquisition flag
#define TSC_ISR_MCEF_Pos         (1U)
#define TSC_ISR_MCEF_Msk         (0x1UL << TSC_ISR_MCEF_Pos)                   //--- 0x00000002
#define TSC_ISR_MCEF             TSC_ISR_MCEF_Msk                              //----Max count error flag

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_IOHCR register
//---------------------------------------------------------------------------------------------
#define TSC_IOHCR_G1_IO1_Pos     (0U)
#define TSC_IOHCR_G1_IO1_Msk     (0x1UL << TSC_IOHCR_G1_IO1_Pos)               //--- 0x00000001
#define TSC_IOHCR_G1_IO1         TSC_IOHCR_G1_IO1_Msk                          //----GROUP1_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G1_IO2_Pos     (1U)
#define TSC_IOHCR_G1_IO2_Msk     (0x1UL << TSC_IOHCR_G1_IO2_Pos)               //--- 0x00000002
#define TSC_IOHCR_G1_IO2         TSC_IOHCR_G1_IO2_Msk                          //----GROUP1_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G1_IO3_Pos     (2U)
#define TSC_IOHCR_G1_IO3_Msk     (0x1UL << TSC_IOHCR_G1_IO3_Pos)               //--- 0x00000004
#define TSC_IOHCR_G1_IO3         TSC_IOHCR_G1_IO3_Msk                          //----GROUP1_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G1_IO4_Pos     (3U)
#define TSC_IOHCR_G1_IO4_Msk     (0x1UL << TSC_IOHCR_G1_IO4_Pos)               //--- 0x00000008
#define TSC_IOHCR_G1_IO4         TSC_IOHCR_G1_IO4_Msk                          //----GROUP1_IO4 schmitt trigger hysteresis mode
#define TSC_IOHCR_G2_IO1_Pos     (4U)
#define TSC_IOHCR_G2_IO1_Msk     (0x1UL << TSC_IOHCR_G2_IO1_Pos)               //--- 0x00000010
#define TSC_IOHCR_G2_IO1         TSC_IOHCR_G2_IO1_Msk                          //----GROUP2_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G2_IO2_Pos     (5U)
#define TSC_IOHCR_G2_IO2_Msk     (0x1UL << TSC_IOHCR_G2_IO2_Pos)               //--- 0x00000020
#define TSC_IOHCR_G2_IO2         TSC_IOHCR_G2_IO2_Msk                          //----GROUP2_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G2_IO3_Pos     (6U)
#define TSC_IOHCR_G2_IO3_Msk     (0x1UL << TSC_IOHCR_G2_IO3_Pos)               //--- 0x00000040
#define TSC_IOHCR_G2_IO3         TSC_IOHCR_G2_IO3_Msk                          //----GROUP2_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G2_IO4_Pos     (7U)
#define TSC_IOHCR_G2_IO4_Msk     (0x1UL << TSC_IOHCR_G2_IO4_Pos)               //--- 0x00000080
#define TSC_IOHCR_G2_IO4         TSC_IOHCR_G2_IO4_Msk                          //----GROUP2_IO4 schmitt trigger hysteresis mode
#define TSC_IOHCR_G3_IO1_Pos     (8U)
#define TSC_IOHCR_G3_IO1_Msk     (0x1UL << TSC_IOHCR_G3_IO1_Pos)               //--- 0x00000100
#define TSC_IOHCR_G3_IO1         TSC_IOHCR_G3_IO1_Msk                          //----GROUP3_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G3_IO2_Pos     (9U)
#define TSC_IOHCR_G3_IO2_Msk     (0x1UL << TSC_IOHCR_G3_IO2_Pos)               //--- 0x00000200
#define TSC_IOHCR_G3_IO2         TSC_IOHCR_G3_IO2_Msk                          //----GROUP3_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G3_IO3_Pos     (10U)
#define TSC_IOHCR_G3_IO3_Msk     (0x1UL << TSC_IOHCR_G3_IO3_Pos)               //--- 0x00000400
#define TSC_IOHCR_G3_IO3         TSC_IOHCR_G3_IO3_Msk                          //----GROUP3_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G3_IO4_Pos     (11U)
#define TSC_IOHCR_G3_IO4_Msk     (0x1UL << TSC_IOHCR_G3_IO4_Pos)               //--- 0x00000800
#define TSC_IOHCR_G3_IO4         TSC_IOHCR_G3_IO4_Msk                          //----GROUP3_IO4 schmitt trigger hysteresis mode
#define TSC_IOHCR_G4_IO1_Pos     (12U)
#define TSC_IOHCR_G4_IO1_Msk     (0x1UL << TSC_IOHCR_G4_IO1_Pos)               //--- 0x00001000
#define TSC_IOHCR_G4_IO1         TSC_IOHCR_G4_IO1_Msk                          //----GROUP4_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G4_IO2_Pos     (13U)
#define TSC_IOHCR_G4_IO2_Msk     (0x1UL << TSC_IOHCR_G4_IO2_Pos)               //--- 0x00002000
#define TSC_IOHCR_G4_IO2         TSC_IOHCR_G4_IO2_Msk                          //----GROUP4_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G4_IO3_Pos     (14U)
#define TSC_IOHCR_G4_IO3_Msk     (0x1UL << TSC_IOHCR_G4_IO3_Pos)               //--- 0x00004000
#define TSC_IOHCR_G4_IO3         TSC_IOHCR_G4_IO3_Msk                          //----GROUP4_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G4_IO4_Pos     (15U)
#define TSC_IOHCR_G4_IO4_Msk     (0x1UL << TSC_IOHCR_G4_IO4_Pos)               //--- 0x00008000
#define TSC_IOHCR_G4_IO4         TSC_IOHCR_G4_IO4_Msk                          //----GROUP4_IO4 schmitt trigger hysteresis mode
#define TSC_IOHCR_G5_IO1_Pos     (16U)
#define TSC_IOHCR_G5_IO1_Msk     (0x1UL << TSC_IOHCR_G5_IO1_Pos)               //--- 0x00010000
#define TSC_IOHCR_G5_IO1         TSC_IOHCR_G5_IO1_Msk                          //----GROUP5_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G5_IO2_Pos     (17U)
#define TSC_IOHCR_G5_IO2_Msk     (0x1UL << TSC_IOHCR_G5_IO2_Pos)               //--- 0x00020000
#define TSC_IOHCR_G5_IO2         TSC_IOHCR_G5_IO2_Msk                          //----GROUP5_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G5_IO3_Pos     (18U)
#define TSC_IOHCR_G5_IO3_Msk     (0x1UL << TSC_IOHCR_G5_IO3_Pos)               //--- 0x00040000
#define TSC_IOHCR_G5_IO3         TSC_IOHCR_G5_IO3_Msk                          //----GROUP5_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G5_IO4_Pos     (19U)
#define TSC_IOHCR_G5_IO4_Msk     (0x1UL << TSC_IOHCR_G5_IO4_Pos)               //--- 0x00080000
#define TSC_IOHCR_G5_IO4         TSC_IOHCR_G5_IO4_Msk                          //----GROUP5_IO4 schmitt trigger hysteresis mode
#define TSC_IOHCR_G6_IO1_Pos     (20U)
#define TSC_IOHCR_G6_IO1_Msk     (0x1UL << TSC_IOHCR_G6_IO1_Pos)               //--- 0x00100000
#define TSC_IOHCR_G6_IO1         TSC_IOHCR_G6_IO1_Msk                          //----GROUP6_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G6_IO2_Pos     (21U)
#define TSC_IOHCR_G6_IO2_Msk     (0x1UL << TSC_IOHCR_G6_IO2_Pos)               //--- 0x00200000
#define TSC_IOHCR_G6_IO2         TSC_IOHCR_G6_IO2_Msk                          //----GROUP6_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G6_IO3_Pos     (22U)
#define TSC_IOHCR_G6_IO3_Msk     (0x1UL << TSC_IOHCR_G6_IO3_Pos)               //--- 0x00400000
#define TSC_IOHCR_G6_IO3         TSC_IOHCR_G6_IO3_Msk                          //----GROUP6_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G6_IO4_Pos     (23U)
#define TSC_IOHCR_G6_IO4_Msk     (0x1UL << TSC_IOHCR_G6_IO4_Pos)               //--- 0x00800000
#define TSC_IOHCR_G6_IO4         TSC_IOHCR_G6_IO4_Msk                          //----GROUP6_IO4 schmitt trigger hysteresis mode
#define TSC_IOHCR_G7_IO1_Pos     (24U)
#define TSC_IOHCR_G7_IO1_Msk     (0x1UL << TSC_IOHCR_G7_IO1_Pos)               //--- 0x01000000
#define TSC_IOHCR_G7_IO1         TSC_IOHCR_G7_IO1_Msk                          //----GROUP7_IO1 schmitt trigger hysteresis mode
#define TSC_IOHCR_G7_IO2_Pos     (25U)
#define TSC_IOHCR_G7_IO2_Msk     (0x1UL << TSC_IOHCR_G7_IO2_Pos)               //--- 0x02000000
#define TSC_IOHCR_G7_IO2         TSC_IOHCR_G7_IO2_Msk                          //----GROUP7_IO2 schmitt trigger hysteresis mode
#define TSC_IOHCR_G7_IO3_Pos     (26U)
#define TSC_IOHCR_G7_IO3_Msk     (0x1UL << TSC_IOHCR_G7_IO3_Pos)               //--- 0x04000000
#define TSC_IOHCR_G7_IO3         TSC_IOHCR_G7_IO3_Msk                          //----GROUP7_IO3 schmitt trigger hysteresis mode
#define TSC_IOHCR_G7_IO4_Pos     (27U)
#define TSC_IOHCR_G7_IO4_Msk     (0x1UL << TSC_IOHCR_G7_IO4_Pos)               //--- 0x08000000
#define TSC_IOHCR_G7_IO4         TSC_IOHCR_G7_IO4_Msk                          //----GROUP7_IO4 schmitt trigger hysteresis mode

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_IOASCR register
//---------------------------------------------------------------------------------------------
#define TSC_IOASCR_G1_IO1_Pos    (0U)
#define TSC_IOASCR_G1_IO1_Msk    (0x1UL << TSC_IOASCR_G1_IO1_Pos)              //--- 0x00000001
#define TSC_IOASCR_G1_IO1        TSC_IOASCR_G1_IO1_Msk                         //----GROUP1_IO1 analog switch enable
#define TSC_IOASCR_G1_IO2_Pos    (1U)
#define TSC_IOASCR_G1_IO2_Msk    (0x1UL << TSC_IOASCR_G1_IO2_Pos)              //--- 0x00000002
#define TSC_IOASCR_G1_IO2        TSC_IOASCR_G1_IO2_Msk                         //----GROUP1_IO2 analog switch enable
#define TSC_IOASCR_G1_IO3_Pos    (2U)
#define TSC_IOASCR_G1_IO3_Msk    (0x1UL << TSC_IOASCR_G1_IO3_Pos)              //--- 0x00000004
#define TSC_IOASCR_G1_IO3        TSC_IOASCR_G1_IO3_Msk                         //----GROUP1_IO3 analog switch enable
#define TSC_IOASCR_G1_IO4_Pos    (3U)
#define TSC_IOASCR_G1_IO4_Msk    (0x1UL << TSC_IOASCR_G1_IO4_Pos)              //--- 0x00000008
#define TSC_IOASCR_G1_IO4        TSC_IOASCR_G1_IO4_Msk                         //----GROUP1_IO4 analog switch enable
#define TSC_IOASCR_G2_IO1_Pos    (4U)
#define TSC_IOASCR_G2_IO1_Msk    (0x1UL << TSC_IOASCR_G2_IO1_Pos)              //--- 0x00000010
#define TSC_IOASCR_G2_IO1        TSC_IOASCR_G2_IO1_Msk                         //----GROUP2_IO1 analog switch enable
#define TSC_IOASCR_G2_IO2_Pos    (5U)
#define TSC_IOASCR_G2_IO2_Msk    (0x1UL << TSC_IOASCR_G2_IO2_Pos)              //--- 0x00000020
#define TSC_IOASCR_G2_IO2        TSC_IOASCR_G2_IO2_Msk                         //----GROUP2_IO2 analog switch enable
#define TSC_IOASCR_G2_IO3_Pos    (6U)
#define TSC_IOASCR_G2_IO3_Msk    (0x1UL << TSC_IOASCR_G2_IO3_Pos)              //--- 0x00000040
#define TSC_IOASCR_G2_IO3        TSC_IOASCR_G2_IO3_Msk                         //----GROUP2_IO3 analog switch enable
#define TSC_IOASCR_G2_IO4_Pos    (7U)
#define TSC_IOASCR_G2_IO4_Msk    (0x1UL << TSC_IOASCR_G2_IO4_Pos)              //--- 0x00000080
#define TSC_IOASCR_G2_IO4        TSC_IOASCR_G2_IO4_Msk                         //----GROUP2_IO4 analog switch enable
#define TSC_IOASCR_G3_IO1_Pos    (8U)
#define TSC_IOASCR_G3_IO1_Msk    (0x1UL << TSC_IOASCR_G3_IO1_Pos)              //--- 0x00000100
#define TSC_IOASCR_G3_IO1        TSC_IOASCR_G3_IO1_Msk                         //----GROUP3_IO1 analog switch enable
#define TSC_IOASCR_G3_IO2_Pos    (9U)
#define TSC_IOASCR_G3_IO2_Msk    (0x1UL << TSC_IOASCR_G3_IO2_Pos)              //--- 0x00000200
#define TSC_IOASCR_G3_IO2        TSC_IOASCR_G3_IO2_Msk                         //----GROUP3_IO2 analog switch enable
#define TSC_IOASCR_G3_IO3_Pos    (10U)
#define TSC_IOASCR_G3_IO3_Msk    (0x1UL << TSC_IOASCR_G3_IO3_Pos)              //--- 0x00000400
#define TSC_IOASCR_G3_IO3        TSC_IOASCR_G3_IO3_Msk                         //----GROUP3_IO3 analog switch enable
#define TSC_IOASCR_G3_IO4_Pos    (11U)
#define TSC_IOASCR_G3_IO4_Msk    (0x1UL << TSC_IOASCR_G3_IO4_Pos)              //--- 0x00000800
#define TSC_IOASCR_G3_IO4        TSC_IOASCR_G3_IO4_Msk                         //----GROUP3_IO4 analog switch enable
#define TSC_IOASCR_G4_IO1_Pos    (12U)
#define TSC_IOASCR_G4_IO1_Msk    (0x1UL << TSC_IOASCR_G4_IO1_Pos)              //--- 0x00001000
#define TSC_IOASCR_G4_IO1        TSC_IOASCR_G4_IO1_Msk                         //----GROUP4_IO1 analog switch enable
#define TSC_IOASCR_G4_IO2_Pos    (13U)
#define TSC_IOASCR_G4_IO2_Msk    (0x1UL << TSC_IOASCR_G4_IO2_Pos)              //--- 0x00002000
#define TSC_IOASCR_G4_IO2        TSC_IOASCR_G4_IO2_Msk                         //----GROUP4_IO2 analog switch enable
#define TSC_IOASCR_G4_IO3_Pos    (14U)
#define TSC_IOASCR_G4_IO3_Msk    (0x1UL << TSC_IOASCR_G4_IO3_Pos)              //--- 0x00004000
#define TSC_IOASCR_G4_IO3        TSC_IOASCR_G4_IO3_Msk                         //----GROUP4_IO3 analog switch enable
#define TSC_IOASCR_G4_IO4_Pos    (15U)
#define TSC_IOASCR_G4_IO4_Msk    (0x1UL << TSC_IOASCR_G4_IO4_Pos)              //--- 0x00008000
#define TSC_IOASCR_G4_IO4        TSC_IOASCR_G4_IO4_Msk                         //----GROUP4_IO4 analog switch enable
#define TSC_IOASCR_G5_IO1_Pos    (16U)
#define TSC_IOASCR_G5_IO1_Msk    (0x1UL << TSC_IOASCR_G5_IO1_Pos)              //--- 0x00010000
#define TSC_IOASCR_G5_IO1        TSC_IOASCR_G5_IO1_Msk                         //----GROUP5_IO1 analog switch enable
#define TSC_IOASCR_G5_IO2_Pos    (17U)
#define TSC_IOASCR_G5_IO2_Msk    (0x1UL << TSC_IOASCR_G5_IO2_Pos)              //--- 0x00020000
#define TSC_IOASCR_G5_IO2        TSC_IOASCR_G5_IO2_Msk                         //----GROUP5_IO2 analog switch enable
#define TSC_IOASCR_G5_IO3_Pos    (18U)
#define TSC_IOASCR_G5_IO3_Msk    (0x1UL << TSC_IOASCR_G5_IO3_Pos)              //--- 0x00040000
#define TSC_IOASCR_G5_IO3        TSC_IOASCR_G5_IO3_Msk                         //----GROUP5_IO3 analog switch enable
#define TSC_IOASCR_G5_IO4_Pos    (19U)
#define TSC_IOASCR_G5_IO4_Msk    (0x1UL << TSC_IOASCR_G5_IO4_Pos)              //--- 0x00080000
#define TSC_IOASCR_G5_IO4        TSC_IOASCR_G5_IO4_Msk                         //----GROUP5_IO4 analog switch enable
#define TSC_IOASCR_G6_IO1_Pos    (20U)
#define TSC_IOASCR_G6_IO1_Msk    (0x1UL << TSC_IOASCR_G6_IO1_Pos)              //--- 0x00100000
#define TSC_IOASCR_G6_IO1        TSC_IOASCR_G6_IO1_Msk                         //----GROUP6_IO1 analog switch enable
#define TSC_IOASCR_G6_IO2_Pos    (21U)
#define TSC_IOASCR_G6_IO2_Msk    (0x1UL << TSC_IOASCR_G6_IO2_Pos)              //--- 0x00200000
#define TSC_IOASCR_G6_IO2        TSC_IOASCR_G6_IO2_Msk                         //----GROUP6_IO2 analog switch enable
#define TSC_IOASCR_G6_IO3_Pos    (22U)
#define TSC_IOASCR_G6_IO3_Msk    (0x1UL << TSC_IOASCR_G6_IO3_Pos)              //--- 0x00400000
#define TSC_IOASCR_G6_IO3        TSC_IOASCR_G6_IO3_Msk                         //----GROUP6_IO3 analog switch enable
#define TSC_IOASCR_G6_IO4_Pos    (23U)
#define TSC_IOASCR_G6_IO4_Msk    (0x1UL << TSC_IOASCR_G6_IO4_Pos)              //--- 0x00800000
#define TSC_IOASCR_G6_IO4        TSC_IOASCR_G6_IO4_Msk                         //----GROUP6_IO4 analog switch enable
#define TSC_IOASCR_G7_IO1_Pos    (24U)
#define TSC_IOASCR_G7_IO1_Msk    (0x1UL << TSC_IOASCR_G7_IO1_Pos)              //--- 0x01000000
#define TSC_IOASCR_G7_IO1        TSC_IOASCR_G7_IO1_Msk                         //----GROUP7_IO1 analog switch enable
#define TSC_IOASCR_G7_IO2_Pos    (25U)
#define TSC_IOASCR_G7_IO2_Msk    (0x1UL << TSC_IOASCR_G7_IO2_Pos)              //--- 0x02000000
#define TSC_IOASCR_G7_IO2        TSC_IOASCR_G7_IO2_Msk                         //----GROUP7_IO2 analog switch enable
#define TSC_IOASCR_G7_IO3_Pos    (26U)
#define TSC_IOASCR_G7_IO3_Msk    (0x1UL << TSC_IOASCR_G7_IO3_Pos)              //--- 0x04000000
#define TSC_IOASCR_G7_IO3        TSC_IOASCR_G7_IO3_Msk                         //----GROUP7_IO3 analog switch enable
#define TSC_IOASCR_G7_IO4_Pos    (27U)
#define TSC_IOASCR_G7_IO4_Msk    (0x1UL << TSC_IOASCR_G7_IO4_Pos)              //--- 0x08000000
#define TSC_IOASCR_G7_IO4        TSC_IOASCR_G7_IO4_Msk                         //----GROUP7_IO4 analog switch enable

