Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_IOSCR register
//---------------------------------------------------------------------------------------------
#define TSC_IOSCR_G1_IO1_Pos     (0U)
#define TSC_IOSCR_G1_IO1_Msk     (0x1UL << TSC_IOSCR_G1_IO1_Pos)               //--- 0x00000001
#define TSC_IOSCR_G1_IO1         TSC_IOSCR_G1_IO1_Msk                          //----GROUP1_IO1 sampling mode
#define TSC_IOSCR_G1_IO2_Pos     (1U)
#define TSC_IOSCR_G1_IO2_Msk     (0x1UL << TSC_IOSCR_G1_IO2_Pos)               //--- 0x00000002
#define TSC_IOSCR_G1_IO2         TSC_IOSCR_G1_IO2_Msk                          //----GROUP1_IO2 sampling mode
#define TSC_IOSCR_G1_IO3_Pos     (2U)
#define TSC_IOSCR_G1_IO3_Msk     (0x1UL << TSC_IOSCR_G1_IO3_Pos)               //--- 0x00000004
#define TSC_IOSCR_G1_IO3         TSC_IOSCR_G1_IO3_Msk                          //----GROUP1_IO3 sampling mode
#define TSC_IOSCR_G1_IO4_Pos     (3U)
#define TSC_IOSCR_G1_IO4_Msk     (0x1UL << TSC_IOSCR_G1_IO4_Pos)               //--- 0x00000008
#define TSC_IOSCR_G1_IO4         TSC_IOSCR_G1_IO4_Msk                          //----GROUP1_IO4 sampling mode
#define TSC_IOSCR_G2_IO1_Pos     (4U)
#define TSC_IOSCR_G2_IO1_Msk     (0x1UL << TSC_IOSCR_G2_IO1_Pos)               //--- 0x00000010
#define TSC_IOSCR_G2_IO1         TSC_IOSCR_G2_IO1_Msk                          //----GROUP2_IO1 sampling mode
#define TSC_IOSCR_G2_IO2_Pos     (5U)
#define TSC_IOSCR_G2_IO2_Msk     (0x1UL << TSC_IOSCR_G2_IO2_Pos)               //--- 0x00000020
#define TSC_IOSCR_G2_IO2         TSC_IOSCR_G2_IO2_Msk                          //----GROUP2_IO2 sampling mode
#define TSC_IOSCR_G2_IO3_Pos     (6U)
#define TSC_IOSCR_G2_IO3_Msk     (0x1UL << TSC_IOSCR_G2_IO3_Pos)               //--- 0x00000040
#define TSC_IOSCR_G2_IO3         TSC_IOSCR_G2_IO3_Msk                          //----GROUP2_IO3 sampling mode
#define TSC_IOSCR_G2_IO4_Pos     (7U)
#define TSC_IOSCR_G2_IO4_Msk     (0x1UL << TSC_IOSCR_G2_IO4_Pos)               //--- 0x00000080
#define TSC_IOSCR_G2_IO4         TSC_IOSCR_G2_IO4_Msk                          //----GROUP2_IO4 sampling mode
#define TSC_IOSCR_G3_IO1_Pos     (8U)
#define TSC_IOSCR_G3_IO1_Msk     (0x1UL << TSC_IOSCR_G3_IO1_Pos)               //--- 0x00000100
#define TSC_IOSCR_G3_IO1         TSC_IOSCR_G3_IO1_Msk                          //----GROUP3_IO1 sampling mode
#define TSC_IOSCR_G3_IO2_Pos     (9U)
#define TSC_IOSCR_G3_IO2_Msk     (0x1UL << TSC_IOSCR_G3_IO2_Pos)               //--- 0x00000200
#define TSC_IOSCR_G3_IO2         TSC_IOSCR_G3_IO2_Msk                          //----GROUP3_IO2 sampling mode
#define TSC_IOSCR_G3_IO3_Pos     (10U)
#define TSC_IOSCR_G3_IO3_Msk     (0x1UL << TSC_IOSCR_G3_IO3_Pos)               //--- 0x00000400
#define TSC_IOSCR_G3_IO3         TSC_IOSCR_G3_IO3_Msk                          //----GROUP3_IO3 sampling mode
#define TSC_IOSCR_G3_IO4_Pos     (11U)
#define TSC_IOSCR_G3_IO4_Msk     (0x1UL << TSC_IOSCR_G3_IO4_Pos)               //--- 0x00000800
#define TSC_IOSCR_G3_IO4         TSC_IOSCR_G3_IO4_Msk                          //----GROUP3_IO4 sampling mode
#define TSC_IOSCR_G4_IO1_Pos     (12U)
#define TSC_IOSCR_G4_IO1_Msk     (0x1UL << TSC_IOSCR_G4_IO1_Pos)               //--- 0x00001000
#define TSC_IOSCR_G4_IO1         TSC_IOSCR_G4_IO1_Msk                          //----GROUP4_IO1 sampling mode
#define TSC_IOSCR_G4_IO2_Pos     (13U)
#define TSC_IOSCR_G4_IO2_Msk     (0x1UL << TSC_IOSCR_G4_IO2_Pos)               //--- 0x00002000
#define TSC_IOSCR_G4_IO2         TSC_IOSCR_G4_IO2_Msk                          //----GROUP4_IO2 sampling mode
#define TSC_IOSCR_G4_IO3_Pos     (14U)
#define TSC_IOSCR_G4_IO3_Msk     (0x1UL << TSC_IOSCR_G4_IO3_Pos)               //--- 0x00004000
#define TSC_IOSCR_G4_IO3         TSC_IOSCR_G4_IO3_Msk                          //----GROUP4_IO3 sampling mode
#define TSC_IOSCR_G4_IO4_Pos     (15U)
#define TSC_IOSCR_G4_IO4_Msk     (0x1UL << TSC_IOSCR_G4_IO4_Pos)               //--- 0x00008000
#define TSC_IOSCR_G4_IO4         TSC_IOSCR_G4_IO4_Msk                          //----GROUP4_IO4 sampling mode
#define TSC_IOSCR_G5_IO1_Pos     (16U)
#define TSC_IOSCR_G5_IO1_Msk     (0x1UL << TSC_IOSCR_G5_IO1_Pos)               //--- 0x00010000
#define TSC_IOSCR_G5_IO1         TSC_IOSCR_G5_IO1_Msk                          //----GROUP5_IO1 sampling mode
#define TSC_IOSCR_G5_IO2_Pos     (17U)
#define TSC_IOSCR_G5_IO2_Msk     (0x1UL << TSC_IOSCR_G5_IO2_Pos)               //--- 0x00020000
#define TSC_IOSCR_G5_IO2         TSC_IOSCR_G5_IO2_Msk                          //----GROUP5_IO2 sampling mode
#define TSC_IOSCR_G5_IO3_Pos     (18U)
#define TSC_IOSCR_G5_IO3_Msk     (0x1UL << TSC_IOSCR_G5_IO3_Pos)               //--- 0x00040000
#define TSC_IOSCR_G5_IO3         TSC_IOSCR_G5_IO3_Msk                          //----GROUP5_IO3 sampling mode
#define TSC_IOSCR_G5_IO4_Pos     (19U)
#define TSC_IOSCR_G5_IO4_Msk     (0x1UL << TSC_IOSCR_G5_IO4_Pos)               //--- 0x00080000
#define TSC_IOSCR_G5_IO4         TSC_IOSCR_G5_IO4_Msk                          //----GROUP5_IO4 sampling mode
#define TSC_IOSCR_G6_IO1_Pos     (20U)
#define TSC_IOSCR_G6_IO1_Msk     (0x1UL << TSC_IOSCR_G6_IO1_Pos)               //--- 0x00100000
#define TSC_IOSCR_G6_IO1         TSC_IOSCR_G6_IO1_Msk                          //----GROUP6_IO1 sampling mode
#define TSC_IOSCR_G6_IO2_Pos     (21U)
#define TSC_IOSCR_G6_IO2_Msk     (0x1UL << TSC_IOSCR_G6_IO2_Pos)               //--- 0x00200000
#define TSC_IOSCR_G6_IO2         TSC_IOSCR_G6_IO2_Msk                          //----GROUP6_IO2 sampling mode
#define TSC_IOSCR_G6_IO3_Pos     (22U)
#define TSC_IOSCR_G6_IO3_Msk     (0x1UL << TSC_IOSCR_G6_IO3_Pos)               //--- 0x00400000
#define TSC_IOSCR_G6_IO3         TSC_IOSCR_G6_IO3_Msk                          //----GROUP6_IO3 sampling mode
#define TSC_IOSCR_G6_IO4_Pos     (23U)
#define TSC_IOSCR_G6_IO4_Msk     (0x1UL << TSC_IOSCR_G6_IO4_Pos)               //--- 0x00800000
#define TSC_IOSCR_G6_IO4         TSC_IOSCR_G6_IO4_Msk                          //----GROUP6_IO4 sampling mode
#define TSC_IOSCR_G7_IO1_Pos     (24U)
#define TSC_IOSCR_G7_IO1_Msk     (0x1UL << TSC_IOSCR_G7_IO1_Pos)               //--- 0x01000000
#define TSC_IOSCR_G7_IO1         TSC_IOSCR_G7_IO1_Msk                          //----GROUP7_IO1 sampling mode
#define TSC_IOSCR_G7_IO2_Pos     (25U)
#define TSC_IOSCR_G7_IO2_Msk     (0x1UL << TSC_IOSCR_G7_IO2_Pos)               //--- 0x02000000
#define TSC_IOSCR_G7_IO2         TSC_IOSCR_G7_IO2_Msk                          //----GROUP7_IO2 sampling mode
#define TSC_IOSCR_G7_IO3_Pos     (26U)
#define TSC_IOSCR_G7_IO3_Msk     (0x1UL << TSC_IOSCR_G7_IO3_Pos)               //--- 0x04000000
#define TSC_IOSCR_G7_IO3         TSC_IOSCR_G7_IO3_Msk                          //----GROUP7_IO3 sampling mode
#define TSC_IOSCR_G7_IO4_Pos     (27U)
#define TSC_IOSCR_G7_IO4_Msk     (0x1UL << TSC_IOSCR_G7_IO4_Pos)               //--- 0x08000000
#define TSC_IOSCR_G7_IO4         TSC_IOSCR_G7_IO4_Msk                          //----GROUP7_IO4 sampling mode

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_IOCCR register
//---------------------------------------------------------------------------------------------
#define TSC_IOCCR_G1_IO1_Pos     (0U)
#define TSC_IOCCR_G1_IO1_Msk     (0x1UL << TSC_IOCCR_G1_IO1_Pos)               //--- 0x00000001
#define TSC_IOCCR_G1_IO1         TSC_IOCCR_G1_IO1_Msk                          //----GROUP1_IO1 channel mode
#define TSC_IOCCR_G1_IO2_Pos     (1U)
#define TSC_IOCCR_G1_IO2_Msk     (0x1UL << TSC_IOCCR_G1_IO2_Pos)               //--- 0x00000002
#define TSC_IOCCR_G1_IO2         TSC_IOCCR_G1_IO2_Msk                          //----GROUP1_IO2 channel mode
#define TSC_IOCCR_G1_IO3_Pos     (2U)
#define TSC_IOCCR_G1_IO3_Msk     (0x1UL << TSC_IOCCR_G1_IO3_Pos)               //--- 0x00000004
#define TSC_IOCCR_G1_IO3         TSC_IOCCR_G1_IO3_Msk                          //----GROUP1_IO3 channel mode
#define TSC_IOCCR_G1_IO4_Pos     (3U)
#define TSC_IOCCR_G1_IO4_Msk     (0x1UL << TSC_IOCCR_G1_IO4_Pos)               //--- 0x00000008
#define TSC_IOCCR_G1_IO4         TSC_IOCCR_G1_IO4_Msk                          //----GROUP1_IO4 channel mode
#define TSC_IOCCR_G2_IO1_Pos     (4U)
#define TSC_IOCCR_G2_IO1_Msk     (0x1UL << TSC_IOCCR_G2_IO1_Pos)               //--- 0x00000010
#define TSC_IOCCR_G2_IO1         TSC_IOCCR_G2_IO1_Msk                          //----GROUP2_IO1 channel mode
#define TSC_IOCCR_G2_IO2_Pos     (5U)
#define TSC_IOCCR_G2_IO2_Msk     (0x1UL << TSC_IOCCR_G2_IO2_Pos)               //--- 0x00000020
#define TSC_IOCCR_G2_IO2         TSC_IOCCR_G2_IO2_Msk                          //----GROUP2_IO2 channel mode
#define TSC_IOCCR_G2_IO3_Pos     (6U)
#define TSC_IOCCR_G2_IO3_Msk     (0x1UL << TSC_IOCCR_G2_IO3_Pos)               //--- 0x00000040
#define TSC_IOCCR_G2_IO3         TSC_IOCCR_G2_IO3_Msk                          //----GROUP2_IO3 channel mode
#define TSC_IOCCR_G2_IO4_Pos     (7U)
#define TSC_IOCCR_G2_IO4_Msk     (0x1UL << TSC_IOCCR_G2_IO4_Pos)               //--- 0x00000080
#define TSC_IOCCR_G2_IO4         TSC_IOCCR_G2_IO4_Msk                          //----GROUP2_IO4 channel mode
#define TSC_IOCCR_G3_IO1_Pos     (8U)
#define TSC_IOCCR_G3_IO1_Msk     (0x1UL << TSC_IOCCR_G3_IO1_Pos)               //--- 0x00000100
#define TSC_IOCCR_G3_IO1         TSC_IOCCR_G3_IO1_Msk                          //----GROUP3_IO1 channel mode
#define TSC_IOCCR_G3_IO2_Pos     (9U)
#define TSC_IOCCR_G3_IO2_Msk     (0x1UL << TSC_IOCCR_G3_IO2_Pos)               //--- 0x00000200
#define TSC_IOCCR_G3_IO2         TSC_IOCCR_G3_IO2_Msk                          //----GROUP3_IO2 channel mode
#define TSC_IOCCR_G3_IO3_Pos     (10U)
#define TSC_IOCCR_G3_IO3_Msk     (0x1UL << TSC_IOCCR_G3_IO3_Pos)               //--- 0x00000400
#define TSC_IOCCR_G3_IO3         TSC_IOCCR_G3_IO3_Msk                          //----GROUP3_IO3 channel mode
#define TSC_IOCCR_G3_IO4_Pos     (11U)
#define TSC_IOCCR_G3_IO4_Msk     (0x1UL << TSC_IOCCR_G3_IO4_Pos)               //--- 0x00000800
#define TSC_IOCCR_G3_IO4         TSC_IOCCR_G3_IO4_Msk                          //----GROUP3_IO4 channel mode
#define TSC_IOCCR_G4_IO1_Pos     (12U)
#define TSC_IOCCR_G4_IO1_Msk     (0x1UL << TSC_IOCCR_G4_IO1_Pos)               //--- 0x00001000
#define TSC_IOCCR_G4_IO1         TSC_IOCCR_G4_IO1_Msk                          //----GROUP4_IO1 channel mode
#define TSC_IOCCR_G4_IO2_Pos     (13U)
#define TSC_IOCCR_G4_IO2_Msk     (0x1UL << TSC_IOCCR_G4_IO2_Pos)               //--- 0x00002000
#define TSC_IOCCR_G4_IO2         TSC_IOCCR_G4_IO2_Msk                          //----GROUP4_IO2 channel mode
#define TSC_IOCCR_G4_IO3_Pos     (14U)
#define TSC_IOCCR_G4_IO3_Msk     (0x1UL << TSC_IOCCR_G4_IO3_Pos)               //--- 0x00004000
#define TSC_IOCCR_G4_IO3         TSC_IOCCR_G4_IO3_Msk                          //----GROUP4_IO3 channel mode
#define TSC_IOCCR_G4_IO4_Pos     (15U)
#define TSC_IOCCR_G4_IO4_Msk     (0x1UL << TSC_IOCCR_G4_IO4_Pos)               //--- 0x00008000
#define TSC_IOCCR_G4_IO4         TSC_IOCCR_G4_IO4_Msk                          //----GROUP4_IO4 channel mode
#define TSC_IOCCR_G5_IO1_Pos     (16U)
#define TSC_IOCCR_G5_IO1_Msk     (0x1UL << TSC_IOCCR_G5_IO1_Pos)               //--- 0x00010000
#define TSC_IOCCR_G5_IO1         TSC_IOCCR_G5_IO1_Msk                          //----GROUP5_IO1 channel mode
#define TSC_IOCCR_G5_IO2_Pos     (17U)
#define TSC_IOCCR_G5_IO2_Msk     (0x1UL << TSC_IOCCR_G5_IO2_Pos)               //--- 0x00020000
#define TSC_IOCCR_G5_IO2         TSC_IOCCR_G5_IO2_Msk                          //----GROUP5_IO2 channel mode
#define TSC_IOCCR_G5_IO3_Pos     (18U)
#define TSC_IOCCR_G5_IO3_Msk     (0x1UL << TSC_IOCCR_G5_IO3_Pos)               //--- 0x00040000
#define TSC_IOCCR_G5_IO3         TSC_IOCCR_G5_IO3_Msk                          //----GROUP5_IO3 channel mode
#define TSC_IOCCR_G5_IO4_Pos     (19U)
#define TSC_IOCCR_G5_IO4_Msk     (0x1UL << TSC_IOCCR_G5_IO4_Pos)               //--- 0x00080000
#define TSC_IOCCR_G5_IO4         TSC_IOCCR_G5_IO4_Msk                          //----GROUP5_IO4 channel mode
#define TSC_IOCCR_G6_IO1_Pos     (20U)
#define TSC_IOCCR_G6_IO1_Msk     (0x1UL << TSC_IOCCR_G6_IO1_Pos)               //--- 0x00100000
#define TSC_IOCCR_G6_IO1         TSC_IOCCR_G6_IO1_Msk                          //----GROUP6_IO1 channel mode
#define TSC_IOCCR_G6_IO2_Pos     (21U)
#define TSC_IOCCR_G6_IO2_Msk     (0x1UL << TSC_IOCCR_G6_IO2_Pos)               //--- 0x00200000
#define TSC_IOCCR_G6_IO2         TSC_IOCCR_G6_IO2_Msk                          //----GROUP6_IO2 channel mode
#define TSC_IOCCR_G6_IO3_Pos     (22U)
#define TSC_IOCCR_G6_IO3_Msk     (0x1UL << TSC_IOCCR_G6_IO3_Pos)               //--- 0x00400000
#define TSC_IOCCR_G6_IO3         TSC_IOCCR_G6_IO3_Msk                          //----GROUP6_IO3 channel mode
#define TSC_IOCCR_G6_IO4_Pos     (23U)
#define TSC_IOCCR_G6_IO4_Msk     (0x1UL << TSC_IOCCR_G6_IO4_Pos)               //--- 0x00800000
#define TSC_IOCCR_G6_IO4         TSC_IOCCR_G6_IO4_Msk                          //----GROUP6_IO4 channel mode
#define TSC_IOCCR_G7_IO1_Pos     (24U)
#define TSC_IOCCR_G7_IO1_Msk     (0x1UL << TSC_IOCCR_G7_IO1_Pos)               //--- 0x01000000
#define TSC_IOCCR_G7_IO1         TSC_IOCCR_G7_IO1_Msk                          //----GROUP7_IO1 channel mode
#define TSC_IOCCR_G7_IO2_Pos     (25U)
#define TSC_IOCCR_G7_IO2_Msk     (0x1UL << TSC_IOCCR_G7_IO2_Pos)               //--- 0x02000000
#define TSC_IOCCR_G7_IO2         TSC_IOCCR_G7_IO2_Msk                          //----GROUP7_IO2 channel mode
#define TSC_IOCCR_G7_IO3_Pos     (26U)
#define TSC_IOCCR_G7_IO3_Msk     (0x1UL << TSC_IOCCR_G7_IO3_Pos)               //--- 0x04000000
#define TSC_IOCCR_G7_IO3         TSC_IOCCR_G7_IO3_Msk                          //----GROUP7_IO3 channel mode
#define TSC_IOCCR_G7_IO4_Pos     (27U)
#define TSC_IOCCR_G7_IO4_Msk     (0x1UL << TSC_IOCCR_G7_IO4_Pos)               //--- 0x08000000
#define TSC_IOCCR_G7_IO4         TSC_IOCCR_G7_IO4_Msk                          //----GROUP7_IO4 channel mode

//---  Bit definition for TSC_IOGCSR register
#define TSC_IOGCSR_G1E_Pos       (0U)
#define TSC_IOGCSR_G1E_Msk       (0x1UL << TSC_IOGCSR_G1E_Pos)                 //--- 0x00000001
#define TSC_IOGCSR_G1E           TSC_IOGCSR_G1E_Msk                            //----Analog IO GROUP1 enable
#define TSC_IOGCSR_G2E_Pos       (1U)
#define TSC_IOGCSR_G2E_Msk       (0x1UL << TSC_IOGCSR_G2E_Pos)                 //--- 0x00000002
#define TSC_IOGCSR_G2E           TSC_IOGCSR_G2E_Msk                            //----Analog IO GROUP2 enable
#define TSC_IOGCSR_G3E_Pos       (2U)
#define TSC_IOGCSR_G3E_Msk       (0x1UL << TSC_IOGCSR_G3E_Pos)                 //--- 0x00000004
#define TSC_IOGCSR_G3E           TSC_IOGCSR_G3E_Msk                            //----Analog IO GROUP3 enable
#define TSC_IOGCSR_G4E_Pos       (3U)
#define TSC_IOGCSR_G4E_Msk       (0x1UL << TSC_IOGCSR_G4E_Pos)                 //--- 0x00000008
#define TSC_IOGCSR_G4E           TSC_IOGCSR_G4E_Msk                            //----Analog IO GROUP4 enable
#define TSC_IOGCSR_G5E_Pos       (4U)
#define TSC_IOGCSR_G5E_Msk       (0x1UL << TSC_IOGCSR_G5E_Pos)                 //--- 0x00000010
#define TSC_IOGCSR_G5E           TSC_IOGCSR_G5E_Msk                            //----Analog IO GROUP5 enable
#define TSC_IOGCSR_G6E_Pos       (5U)
#define TSC_IOGCSR_G6E_Msk       (0x1UL << TSC_IOGCSR_G6E_Pos)                 //--- 0x00000020
#define TSC_IOGCSR_G6E           TSC_IOGCSR_G6E_Msk                            //----Analog IO GROUP6 enable
#define TSC_IOGCSR_G7E_Pos       (6U)
#define TSC_IOGCSR_G7E_Msk       (0x1UL << TSC_IOGCSR_G7E_Pos)                 //--- 0x00000040
#define TSC_IOGCSR_G7E           TSC_IOGCSR_G7E_Msk                            //----Analog IO GROUP7 enable
#define TSC_IOGCSR_G1S_Pos       (16U)
#define TSC_IOGCSR_G1S_Msk       (0x1UL << TSC_IOGCSR_G1S_Pos)                 //--- 0x00010000
#define TSC_IOGCSR_G1S           TSC_IOGCSR_G1S_Msk                            //----Analog IO GROUP1 status
#define TSC_IOGCSR_G2S_Pos       (17U)
#define TSC_IOGCSR_G2S_Msk       (0x1UL << TSC_IOGCSR_G2S_Pos)                 //--- 0x00020000
#define TSC_IOGCSR_G2S           TSC_IOGCSR_G2S_Msk                            //----Analog IO GROUP2 status
#define TSC_IOGCSR_G3S_Pos       (18U)
#define TSC_IOGCSR_G3S_Msk       (0x1UL << TSC_IOGCSR_G3S_Pos)                 //--- 0x00040000
#define TSC_IOGCSR_G3S           TSC_IOGCSR_G3S_Msk                            //----Analog IO GROUP3 status
#define TSC_IOGCSR_G4S_Pos       (19U)
#define TSC_IOGCSR_G4S_Msk       (0x1UL << TSC_IOGCSR_G4S_Pos)                 //--- 0x00080000
#define TSC_IOGCSR_G4S           TSC_IOGCSR_G4S_Msk                            //----Analog IO GROUP4 status
#define TSC_IOGCSR_G5S_Pos       (20U)
#define TSC_IOGCSR_G5S_Msk       (0x1UL << TSC_IOGCSR_G5S_Pos)                 //--- 0x00100000
#define TSC_IOGCSR_G5S           TSC_IOGCSR_G5S_Msk                            //----Analog IO GROUP5 status
#define TSC_IOGCSR_G6S_Pos       (21U)
#define TSC_IOGCSR_G6S_Msk       (0x1UL << TSC_IOGCSR_G6S_Pos)                 //--- 0x00200000
#define TSC_IOGCSR_G6S           TSC_IOGCSR_G6S_Msk                            //----Analog IO GROUP6 status
#define TSC_IOGCSR_G7S_Pos       (22U)
#define TSC_IOGCSR_G7S_Msk       (0x1UL << TSC_IOGCSR_G7S_Pos)                 //--- 0x00400000
#define TSC_IOGCSR_G7S           TSC_IOGCSR_G7S_Msk                            //----Analog IO GROUP7 status

//---------------------------------------------------------------------------------------------
//---  Bit definition for TSC_IOGXCR register
//---------------------------------------------------------------------------------------------
#define TSC_IOGXCR_CNT_Pos       (0U)
#define TSC_IOGXCR_CNT_Msk       (0x3FFFUL << TSC_IOGXCR_CNT_Pos)              //--- 0x00003FFF
#define TSC_IOGXCR_CNT           TSC_IOGXCR_CNT_Msk                            //----CNT[13:0] bits (Counter value)

//---------------------------------------------------------------------------------------------
//---  Universal Synchronous Asynchronous Receiver Transmitter (USART)
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
// @brief Specific device feature definitions (not present on all devices in the STM32L4 serie)
//---------------------------------------------------------------------------------------------

#define USART_TCBGT_SUPPORT

