Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---   Bit definition for USART_CR1 register
//---------------------------------------------------------------------------------------------
#define USART_CR1_UE_Pos              (0U)
#define USART_CR1_UE_Msk              (0x1UL << USART_CR1_UE_Pos)              //--- 0x00000001
#define USART_CR1_UE                  USART_CR1_UE_Msk                         //--- USART Enable
#define USART_CR1_UESM_Pos            (1U)
#define USART_CR1_UESM_Msk            (0x1UL << USART_CR1_UESM_Pos)            //--- 0x00000002
#define USART_CR1_UESM                USART_CR1_UESM_Msk                       //--- USART Enable in STOP Mode
#define USART_CR1_RE_Pos              (2U)
#define USART_CR1_RE_Msk              (0x1UL << USART_CR1_RE_Pos)              //--- 0x00000004
#define USART_CR1_RE                  USART_CR1_RE_Msk                         //--- Receiver Enable
#define USART_CR1_TE_Pos              (3U)
#define USART_CR1_TE_Msk              (0x1UL << USART_CR1_TE_Pos)              //--- 0x00000008
#define USART_CR1_TE                  USART_CR1_TE_Msk                         //--- Transmitter Enable
#define USART_CR1_IDLEIE_Pos          (4U)
#define USART_CR1_IDLEIE_Msk          (0x1UL << USART_CR1_IDLEIE_Pos)          //--- 0x00000010
#define USART_CR1_IDLEIE              USART_CR1_IDLEIE_Msk                     //--- IDLE Interrupt Enable
#define USART_CR1_RXNEIE_Pos          (5U)
#define USART_CR1_RXNEIE_Msk          (0x1UL << USART_CR1_RXNEIE_Pos)          //--- 0x00000020
#define USART_CR1_RXNEIE              USART_CR1_RXNEIE_Msk                     //--- RXNE Interrupt Enable
#define USART_CR1_TCIE_Pos            (6U)
#define USART_CR1_TCIE_Msk            (0x1UL << USART_CR1_TCIE_Pos)            //--- 0x00000040
#define USART_CR1_TCIE                USART_CR1_TCIE_Msk                       //--- Transmission Complete Interrupt Enable
#define USART_CR1_TXEIE_Pos           (7U)
#define USART_CR1_TXEIE_Msk           (0x1UL << USART_CR1_TXEIE_Pos)           //--- 0x00000080
#define USART_CR1_TXEIE               USART_CR1_TXEIE_Msk                      //--- TXE Interrupt Enable
#define USART_CR1_PEIE_Pos            (8U)
#define USART_CR1_PEIE_Msk            (0x1UL << USART_CR1_PEIE_Pos)            //--- 0x00000100
#define USART_CR1_PEIE                USART_CR1_PEIE_Msk                       //--- PE Interrupt Enable
#define USART_CR1_PS_Pos              (9U)
#define USART_CR1_PS_Msk              (0x1UL << USART_CR1_PS_Pos)              //--- 0x00000200
#define USART_CR1_PS                  USART_CR1_PS_Msk                         //--- Parity Selection
#define USART_CR1_PCE_Pos             (10U)
#define USART_CR1_PCE_Msk             (0x1UL << USART_CR1_PCE_Pos)             //--- 0x00000400
#define USART_CR1_PCE                 USART_CR1_PCE_Msk                        //--- Parity Control Enable
#define USART_CR1_WAKE_Pos            (11U)
#define USART_CR1_WAKE_Msk            (0x1UL << USART_CR1_WAKE_Pos)            //--- 0x00000800
#define USART_CR1_WAKE                USART_CR1_WAKE_Msk                       //--- Receiver Wakeup method
#define USART_CR1_M_Pos               (12U)
#define USART_CR1_M_Msk               (0x10001UL << USART_CR1_M_Pos)           //--- 0x10001000
#define USART_CR1_M                   USART_CR1_M_Msk                          //--- Word length
#define USART_CR1_M0_Pos              (12U)
#define USART_CR1_M0_Msk              (0x1UL << USART_CR1_M0_Pos)              //--- 0x00001000
#define USART_CR1_M0                  USART_CR1_M0_Msk                         //--- Word length - Bit 0
#define USART_CR1_MME_Pos             (13U)
#define USART_CR1_MME_Msk             (0x1UL << USART_CR1_MME_Pos)             //--- 0x00002000
#define USART_CR1_MME                 USART_CR1_MME_Msk                        //--- Mute Mode Enable
#define USART_CR1_CMIE_Pos            (14U)
#define USART_CR1_CMIE_Msk            (0x1UL << USART_CR1_CMIE_Pos)            //--- 0x00004000
#define USART_CR1_CMIE                USART_CR1_CMIE_Msk                       //--- Character match interrupt enable
#define USART_CR1_OVER8_Pos           (15U)
#define USART_CR1_OVER8_Msk           (0x1UL << USART_CR1_OVER8_Pos)           //--- 0x00008000
#define USART_CR1_OVER8               USART_CR1_OVER8_Msk                      //--- Oversampling by 8-bit or 16-bit mode
#define USART_CR1_DEDT_Pos            (16U)
#define USART_CR1_DEDT_Msk            (0x1FUL << USART_CR1_DEDT_Pos)           //--- 0x001F0000
#define USART_CR1_DEDT                USART_CR1_DEDT_Msk                       //--- DEDT[4:0] bits (Driver Enable Deassertion Time)
#define USART_CR1_DEDT_0              (0x01UL << USART_CR1_DEDT_Pos)           //--- 0x00010000
#define USART_CR1_DEDT_1              (0x02UL << USART_CR1_DEDT_Pos)           //--- 0x00020000
#define USART_CR1_DEDT_2              (0x04UL << USART_CR1_DEDT_Pos)           //--- 0x00040000
#define USART_CR1_DEDT_3              (0x08UL << USART_CR1_DEDT_Pos)           //--- 0x00080000
#define USART_CR1_DEDT_4              (0x10UL << USART_CR1_DEDT_Pos)           //--- 0x00100000
#define USART_CR1_DEAT_Pos            (21U)
#define USART_CR1_DEAT_Msk            (0x1FUL << USART_CR1_DEAT_Pos)           //--- 0x03E00000
#define USART_CR1_DEAT                USART_CR1_DEAT_Msk                       //--- DEAT[4:0] bits (Driver Enable Assertion Time)
#define USART_CR1_DEAT_0              (0x01UL << USART_CR1_DEAT_Pos)           //--- 0x00200000
#define USART_CR1_DEAT_1              (0x02UL << USART_CR1_DEAT_Pos)           //--- 0x00400000
#define USART_CR1_DEAT_2              (0x04UL << USART_CR1_DEAT_Pos)           //--- 0x00800000
#define USART_CR1_DEAT_3              (0x08UL << USART_CR1_DEAT_Pos)           //--- 0x01000000
#define USART_CR1_DEAT_4              (0x10UL << USART_CR1_DEAT_Pos)           //--- 0x02000000
#define USART_CR1_RTOIE_Pos           (26U)
#define USART_CR1_RTOIE_Msk           (0x1UL << USART_CR1_RTOIE_Pos)           //--- 0x04000000
#define USART_CR1_RTOIE               USART_CR1_RTOIE_Msk                      //--- Receive Time Out interrupt enable
#define USART_CR1_EOBIE_Pos           (27U)
#define USART_CR1_EOBIE_Msk           (0x1UL << USART_CR1_EOBIE_Pos)           //--- 0x08000000
#define USART_CR1_EOBIE               USART_CR1_EOBIE_Msk                      //--- End of Block interrupt enable
#define USART_CR1_M1_Pos              (28U)
#define USART_CR1_M1_Msk              (0x1UL << USART_CR1_M1_Pos)              //--- 0x10000000
#define USART_CR1_M1                  USART_CR1_M1_Msk                         //--- Word length - Bit 1

//---------------------------------------------------------------------------------------------
//---   Bit definition for USART_CR2 register
//---------------------------------------------------------------------------------------------
#define USART_CR2_ADDM7_Pos           (4U)
#define USART_CR2_ADDM7_Msk           (0x1UL << USART_CR2_ADDM7_Pos)           //--- 0x00000010
#define USART_CR2_ADDM7               USART_CR2_ADDM7_Msk                      //--- 7-bit or 4-bit Address Detection
#define USART_CR2_LBDL_Pos            (5U)
#define USART_CR2_LBDL_Msk            (0x1UL << USART_CR2_LBDL_Pos)            //--- 0x00000020
#define USART_CR2_LBDL                USART_CR2_LBDL_Msk                       //--- LIN Break Detection Length
#define USART_CR2_LBDIE_Pos           (6U)
#define USART_CR2_LBDIE_Msk           (0x1UL << USART_CR2_LBDIE_Pos)           //--- 0x00000040
#define USART_CR2_LBDIE               USART_CR2_LBDIE_Msk                      //--- LIN Break Detection Interrupt Enable
#define USART_CR2_LBCL_Pos            (8U)
#define USART_CR2_LBCL_Msk            (0x1UL << USART_CR2_LBCL_Pos)            //--- 0x00000100
#define USART_CR2_LBCL                USART_CR2_LBCL_Msk                       //--- Last Bit Clock pulse
#define USART_CR2_CPHA_Pos            (9U)
#define USART_CR2_CPHA_Msk            (0x1UL << USART_CR2_CPHA_Pos)            //--- 0x00000200
#define USART_CR2_CPHA                USART_CR2_CPHA_Msk                       //--- Clock Phase
#define USART_CR2_CPOL_Pos            (10U)
#define USART_CR2_CPOL_Msk            (0x1UL << USART_CR2_CPOL_Pos)            //--- 0x00000400
#define USART_CR2_CPOL                USART_CR2_CPOL_Msk                       //--- Clock Polarity
#define USART_CR2_CLKEN_Pos           (11U)
#define USART_CR2_CLKEN_Msk           (0x1UL << USART_CR2_CLKEN_Pos)           //--- 0x00000800
#define USART_CR2_CLKEN               USART_CR2_CLKEN_Msk                      //--- Clock Enable
#define USART_CR2_STOP_Pos            (12U)
#define USART_CR2_STOP_Msk            (0x3UL << USART_CR2_STOP_Pos)            //--- 0x00003000
#define USART_CR2_STOP                USART_CR2_STOP_Msk                       //--- STOP[1:0] bits (STOP bits)
#define USART_CR2_STOP_0              (0x1UL << USART_CR2_STOP_Pos)            //--- 0x00001000
#define USART_CR2_STOP_1              (0x2UL << USART_CR2_STOP_Pos)            //--- 0x00002000
#define USART_CR2_LINEN_Pos           (14U)
#define USART_CR2_LINEN_Msk           (0x1UL << USART_CR2_LINEN_Pos)           //--- 0x00004000
#define USART_CR2_LINEN               USART_CR2_LINEN_Msk                      //--- LIN mode enable
#define USART_CR2_SWAP_Pos            (15U)
#define USART_CR2_SWAP_Msk            (0x1UL << USART_CR2_SWAP_Pos)            //--- 0x00008000
#define USART_CR2_SWAP                USART_CR2_SWAP_Msk                       //--- SWAP TX/RX pins
#define USART_CR2_RXINV_Pos           (16U)
#define USART_CR2_RXINV_Msk           (0x1UL << USART_CR2_RXINV_Pos)           //--- 0x00010000
#define USART_CR2_RXINV               USART_CR2_RXINV_Msk                      //--- RX pin active level inversion
#define USART_CR2_TXINV_Pos           (17U)
#define USART_CR2_TXINV_Msk           (0x1UL << USART_CR2_TXINV_Pos)           //--- 0x00020000
#define USART_CR2_TXINV               USART_CR2_TXINV_Msk                      //--- TX pin active level inversion
#define USART_CR2_DATAINV_Pos         (18U)
#define USART_CR2_DATAINV_Msk         (0x1UL << USART_CR2_DATAINV_Pos)         //--- 0x00040000
#define USART_CR2_DATAINV             USART_CR2_DATAINV_Msk                    //--- Binary data inversion
#define USART_CR2_MSBFIRST_Pos        (19U)
#define USART_CR2_MSBFIRST_Msk        (0x1UL << USART_CR2_MSBFIRST_Pos)        //--- 0x00080000
#define USART_CR2_MSBFIRST            USART_CR2_MSBFIRST_Msk                   //--- Most Significant Bit First
#define USART_CR2_ABREN_Pos           (20U)
#define USART_CR2_ABREN_Msk           (0x1UL << USART_CR2_ABREN_Pos)           //--- 0x00100000
#define USART_CR2_ABREN               USART_CR2_ABREN_Msk                      //--- Auto Baud-Rate Enable
#define USART_CR2_ABRMODE_Pos         (21U)
#define USART_CR2_ABRMODE_Msk         (0x3UL << USART_CR2_ABRMODE_Pos)         //--- 0x00600000
#define USART_CR2_ABRMODE             USART_CR2_ABRMODE_Msk                    //--- ABRMOD[1:0] bits (Auto Baud-Rate Mode)
#define USART_CR2_ABRMODE_0           (0x1UL << USART_CR2_ABRMODE_Pos)         //--- 0x00200000
#define USART_CR2_ABRMODE_1           (0x2UL << USART_CR2_ABRMODE_Pos)         //--- 0x00400000
#define USART_CR2_RTOEN_Pos           (23U)
#define USART_CR2_RTOEN_Msk           (0x1UL << USART_CR2_RTOEN_Pos)           //--- 0x00800000
#define USART_CR2_RTOEN               USART_CR2_RTOEN_Msk                      //--- Receiver Time-Out enable
#define USART_CR2_ADD_Pos             (24U)
#define USART_CR2_ADD_Msk             (0xFFUL << USART_CR2_ADD_Pos)            //--- 0xFF000000
#define USART_CR2_ADD                 USART_CR2_ADD_Msk                        //--- Address of the USART node

//---------------------------------------------------------------------------------------------
//---   Bit definition for USART_CR3 register
//---------------------------------------------------------------------------------------------
#define USART_CR3_EIE_Pos             (0U)
#define USART_CR3_EIE_Msk             (0x1UL << USART_CR3_EIE_Pos)             //--- 0x00000001
#define USART_CR3_EIE                 USART_CR3_EIE_Msk                        //--- Error Interrupt Enable
#define USART_CR3_IREN_Pos            (1U)
#define USART_CR3_IREN_Msk            (0x1UL << USART_CR3_IREN_Pos)            //--- 0x00000002
#define USART_CR3_IREN                USART_CR3_IREN_Msk                       //--- IrDA mode Enable
#define USART_CR3_IRLP_Pos            (2U)
#define USART_CR3_IRLP_Msk            (0x1UL << USART_CR3_IRLP_Pos)            //--- 0x00000004
#define USART_CR3_IRLP                USART_CR3_IRLP_Msk                       //--- IrDA Low-Power
#define USART_CR3_HDSEL_Pos           (3U)
#define USART_CR3_HDSEL_Msk           (0x1UL << USART_CR3_HDSEL_Pos)           //--- 0x00000008
#define USART_CR3_HDSEL               USART_CR3_HDSEL_Msk                      //--- Half-Duplex Selection
#define USART_CR3_NACK_Pos            (4U)
#define USART_CR3_NACK_Msk            (0x1UL << USART_CR3_NACK_Pos)            //--- 0x00000010
#define USART_CR3_NACK                USART_CR3_NACK_Msk                       //--- SmartCard NACK enable
#define USART_CR3_SCEN_Pos            (5U)
#define USART_CR3_SCEN_Msk            (0x1UL << USART_CR3_SCEN_Pos)            //--- 0x00000020
#define USART_CR3_SCEN                USART_CR3_SCEN_Msk                       //--- SmartCard mode enable
#define USART_CR3_DMAR_Pos            (6U)
#define USART_CR3_DMAR_Msk            (0x1UL << USART_CR3_DMAR_Pos)            //--- 0x00000040
#define USART_CR3_DMAR                USART_CR3_DMAR_Msk                       //--- DMA Enable Receiver
#define USART_CR3_DMAT_Pos            (7U)
#define USART_CR3_DMAT_Msk            (0x1UL << USART_CR3_DMAT_Pos)            //--- 0x00000080
#define USART_CR3_DMAT                USART_CR3_DMAT_Msk                       //--- DMA Enable Transmitter
#define USART_CR3_RTSE_Pos            (8U)
#define USART_CR3_RTSE_Msk            (0x1UL << USART_CR3_RTSE_Pos)            //--- 0x00000100
#define USART_CR3_RTSE                USART_CR3_RTSE_Msk                       //--- RTS Enable
#define USART_CR3_CTSE_Pos            (9U)
#define USART_CR3_CTSE_Msk            (0x1UL << USART_CR3_CTSE_Pos)            //--- 0x00000200
#define USART_CR3_CTSE                USART_CR3_CTSE_Msk                       //--- CTS Enable
#define USART_CR3_CTSIE_Pos           (10U)
#define USART_CR3_CTSIE_Msk           (0x1UL << USART_CR3_CTSIE_Pos)           //--- 0x00000400
#define USART_CR3_CTSIE               USART_CR3_CTSIE_Msk                      //--- CTS Interrupt Enable
#define USART_CR3_ONEBIT_Pos          (11U)
#define USART_CR3_ONEBIT_Msk          (0x1UL << USART_CR3_ONEBIT_Pos)          //--- 0x00000800
#define USART_CR3_ONEBIT              USART_CR3_ONEBIT_Msk                     //--- One sample bit method enable
#define USART_CR3_OVRDIS_Pos          (12U)
#define USART_CR3_OVRDIS_Msk          (0x1UL << USART_CR3_OVRDIS_Pos)          //--- 0x00001000
#define USART_CR3_OVRDIS              USART_CR3_OVRDIS_Msk                     //--- Overrun Disable
#define USART_CR3_DDRE_Pos            (13U)
#define USART_CR3_DDRE_Msk            (0x1UL << USART_CR3_DDRE_Pos)            //--- 0x00002000
#define USART_CR3_DDRE                USART_CR3_DDRE_Msk                       //--- DMA Disable on Reception Error
#define USART_CR3_DEM_Pos             (14U)
#define USART_CR3_DEM_Msk             (0x1UL << USART_CR3_DEM_Pos)             //--- 0x00004000
#define USART_CR3_DEM                 USART_CR3_DEM_Msk                        //--- Driver Enable Mode
#define USART_CR3_DEP_Pos             (15U)
#define USART_CR3_DEP_Msk             (0x1UL << USART_CR3_DEP_Pos)             //--- 0x00008000
#define USART_CR3_DEP                 USART_CR3_DEP_Msk                        //--- Driver Enable Polarity Selection
#define USART_CR3_SCARCNT_Pos         (17U)
#define USART_CR3_SCARCNT_Msk         (0x7UL << USART_CR3_SCARCNT_Pos)         //--- 0x000E0000
#define USART_CR3_SCARCNT             USART_CR3_SCARCNT_Msk                    //--- SCARCNT[2:0] bits (SmartCard Auto-Retry Count)
#define USART_CR3_SCARCNT_0           (0x1UL << USART_CR3_SCARCNT_Pos)         //--- 0x00020000
#define USART_CR3_SCARCNT_1           (0x2UL << USART_CR3_SCARCNT_Pos)         //--- 0x00040000
#define USART_CR3_SCARCNT_2           (0x4UL << USART_CR3_SCARCNT_Pos)         //--- 0x00080000
#define USART_CR3_WUS_Pos             (20U)
#define USART_CR3_WUS_Msk             (0x3UL << USART_CR3_WUS_Pos)             //--- 0x00300000
#define USART_CR3_WUS                 USART_CR3_WUS_Msk                        //--- WUS[1:0] bits (Wake UP Interrupt Flag Selection)
#define USART_CR3_WUS_0               (0x1UL << USART_CR3_WUS_Pos)             //--- 0x00100000
#define USART_CR3_WUS_1               (0x2UL << USART_CR3_WUS_Pos)             //--- 0x00200000
#define USART_CR3_WUFIE_Pos           (22U)
#define USART_CR3_WUFIE_Msk           (0x1UL << USART_CR3_WUFIE_Pos)           //--- 0x00400000
#define USART_CR3_WUFIE               USART_CR3_WUFIE_Msk                      //--- Wake Up Interrupt Enable
#define USART_CR3_UCESM_Pos           (23U)
#define USART_CR3_UCESM_Msk           (0x1UL << USART_CR3_UCESM_Pos)           //--- 0x02000000
#define USART_CR3_UCESM               USART_CR3_UCESM_Msk                      //--- USART Clock enable in Stop mode
#define USART_CR3_TCBGTIE_Pos         (24U)
#define USART_CR3_TCBGTIE_Msk         (0x1UL << USART_CR3_TCBGTIE_Pos)         //--- 0x01000000
#define USART_CR3_TCBGTIE             USART_CR3_TCBGTIE_Msk                    //--- Transmission Complete Before Guard Time Interrupt Enable

//---------------------------------------------------------------------------------------------
//---   Bit definition for USART_BRR register
//---------------------------------------------------------------------------------------------
#define USART_BRR_DIV_FRACTION_Pos    (0U)
#define USART_BRR_DIV_FRACTION_Msk    (0xFUL << USART_BRR_DIV_FRACTION_Pos)    //--- 0x0000000F
#define USART_BRR_DIV_FRACTION        USART_BRR_DIV_FRACTION_Msk               //--- Fraction of USARTDIV
#define USART_BRR_DIV_MANTISSA_Pos    (4U)
#define USART_BRR_DIV_MANTISSA_Msk    (0xFFFUL << USART_BRR_DIV_MANTISSA_Pos)  //--- 0x0000FFF0
#define USART_BRR_DIV_MANTISSA        USART_BRR_DIV_MANTISSA_Msk               //--- Mantissa of USARTDIV

//---------------------------------------------------------------------------------------------
//---   Bit definition for USART_GTPR register
//---------------------------------------------------------------------------------------------
#define USART_GTPR_PSC_Pos            (0U)
#define USART_GTPR_PSC_Msk            (0xFFUL << USART_GTPR_PSC_Pos)           //--- 0x000000FF
#define USART_GTPR_PSC                USART_GTPR_PSC_Msk                       //--- PSC[7:0] bits (Prescaler value)
#define USART_GTPR_GT_Pos             (8U)
#define USART_GTPR_GT_Msk             (0xFFUL << USART_GTPR_GT_Pos)            //--- 0x0000FF00
#define USART_GTPR_GT                 USART_GTPR_GT_Msk                        //--- GT[7:0] bits (Guard time value)

//---------------------------------------------------------------------------------------------
//---  Bit definition for USART_RTOR register
//---------------------------------------------------------------------------------------------
#define USART_RTOR_RTO_Pos            (0U)
#define USART_RTOR_RTO_Msk            (0xFFFFFFUL << USART_RTOR_RTO_Pos)       //--- 0x00FFFFFF
#define USART_RTOR_RTO                USART_RTOR_RTO_Msk                       //--- Receiver Time Out Value
#define USART_RTOR_BLEN_Pos           (24U)
#define USART_RTOR_BLEN_Msk           (0xFFUL << USART_RTOR_BLEN_Pos)          //--- 0xFF000000
#define USART_RTOR_BLEN               USART_RTOR_BLEN_Msk                      //--- Block Length

//---------------------------------------------------------------------------------------------
//---  Bit definition for USART_RQR register
//---------------------------------------------------------------------------------------------
#define USART_RQR_ABRRQ_Pos           (0U)
#define USART_RQR_ABRRQ_Msk           (0x1UL << USART_RQR_ABRRQ_Pos)           //--- 0x00000001
#define USART_RQR_ABRRQ               USART_RQR_ABRRQ_Msk                      //--- Auto-Baud Rate Request
#define USART_RQR_SBKRQ_Pos           (1U)
#define USART_RQR_SBKRQ_Msk           (0x1UL << USART_RQR_SBKRQ_Pos)           //--- 0x00000002
#define USART_RQR_SBKRQ               USART_RQR_SBKRQ_Msk                      //--- Send Break Request
#define USART_RQR_MMRQ_Pos            (2U)
#define USART_RQR_MMRQ_Msk            (0x1UL << USART_RQR_MMRQ_Pos)            //--- 0x00000004
#define USART_RQR_MMRQ                USART_RQR_MMRQ_Msk                       //--- Mute Mode Request
#define USART_RQR_RXFRQ_Pos           (3U)
#define USART_RQR_RXFRQ_Msk           (0x1UL << USART_RQR_RXFRQ_Pos)           //--- 0x00000008
#define USART_RQR_RXFRQ               USART_RQR_RXFRQ_Msk                      //--- Receive Data flush Request
#define USART_RQR_TXFRQ_Pos           (4U)
#define USART_RQR_TXFRQ_Msk           (0x1UL << USART_RQR_TXFRQ_Pos)           //--- 0x00000010
#define USART_RQR_TXFRQ               USART_RQR_TXFRQ_Msk                      //--- Transmit data flush Request

