Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  Bit definition for USART_ISR register
//---------------------------------------------------------------------------------------------
#define USART_ISR_PE_Pos              (0U)
#define USART_ISR_PE_Msk              (0x1UL << USART_ISR_PE_Pos)              //--- 0x00000001
#define USART_ISR_PE                  USART_ISR_PE_Msk                         //--- Parity Error
#define USART_ISR_FE_Pos              (1U)
#define USART_ISR_FE_Msk              (0x1UL << USART_ISR_FE_Pos)              //--- 0x00000002
#define USART_ISR_FE                  USART_ISR_FE_Msk                         //--- Framing Error
#define USART_ISR_NE_Pos              (2U)
#define USART_ISR_NE_Msk              (0x1UL << USART_ISR_NE_Pos)              //--- 0x00000004
#define USART_ISR_NE                  USART_ISR_NE_Msk                         //--- Noise Error detected Flag
#define USART_ISR_ORE_Pos             (3U)
#define USART_ISR_ORE_Msk             (0x1UL << USART_ISR_ORE_Pos)             //--- 0x00000008
#define USART_ISR_ORE                 USART_ISR_ORE_Msk                        //--- OverRun Error
#define USART_ISR_IDLE_Pos            (4U)
#define USART_ISR_IDLE_Msk            (0x1UL << USART_ISR_IDLE_Pos)            //--- 0x00000010
#define USART_ISR_IDLE                USART_ISR_IDLE_Msk                       //--- IDLE line detected
#define USART_ISR_RXNE_Pos            (5U)
#define USART_ISR_RXNE_Msk            (0x1UL << USART_ISR_RXNE_Pos)            //--- 0x00000020
#define USART_ISR_RXNE                USART_ISR_RXNE_Msk                       //--- Read Data Register Not Empty
#define USART_ISR_TC_Pos              (6U)
#define USART_ISR_TC_Msk              (0x1UL << USART_ISR_TC_Pos)              //--- 0x00000040
#define USART_ISR_TC                  USART_ISR_TC_Msk                         //--- Transmission Complete
#define USART_ISR_TXE_Pos             (7U)
#define USART_ISR_TXE_Msk             (0x1UL << USART_ISR_TXE_Pos)             //--- 0x00000080
#define USART_ISR_TXE                 USART_ISR_TXE_Msk                        //--- Transmit Data Register Empty
#define USART_ISR_LBDF_Pos            (8U)
#define USART_ISR_LBDF_Msk            (0x1UL << USART_ISR_LBDF_Pos)            //--- 0x00000100
#define USART_ISR_LBDF                USART_ISR_LBDF_Msk                       //--- LIN Break Detection Flag
#define USART_ISR_CTSIF_Pos           (9U)
#define USART_ISR_CTSIF_Msk           (0x1UL << USART_ISR_CTSIF_Pos)           //--- 0x00000200
#define USART_ISR_CTSIF               USART_ISR_CTSIF_Msk                      //--- CTS interrupt flag
#define USART_ISR_CTS_Pos             (10U)
#define USART_ISR_CTS_Msk             (0x1UL << USART_ISR_CTS_Pos)             //--- 0x00000400
#define USART_ISR_CTS                 USART_ISR_CTS_Msk                        //--- CTS flag
#define USART_ISR_RTOF_Pos            (11U)
#define USART_ISR_RTOF_Msk            (0x1UL << USART_ISR_RTOF_Pos)            //--- 0x00000800
#define USART_ISR_RTOF                USART_ISR_RTOF_Msk                       //--- Receiver Time Out
#define USART_ISR_EOBF_Pos            (12U)
#define USART_ISR_EOBF_Msk            (0x1UL << USART_ISR_EOBF_Pos)            //--- 0x00001000
#define USART_ISR_EOBF                USART_ISR_EOBF_Msk                       //--- End Of Block Flag
#define USART_ISR_ABRE_Pos            (14U)
#define USART_ISR_ABRE_Msk            (0x1UL << USART_ISR_ABRE_Pos)            //--- 0x00004000
#define USART_ISR_ABRE                USART_ISR_ABRE_Msk                       //--- Auto-Baud Rate Error
#define USART_ISR_ABRF_Pos            (15U)
#define USART_ISR_ABRF_Msk            (0x1UL << USART_ISR_ABRF_Pos)            //--- 0x00008000
#define USART_ISR_ABRF                USART_ISR_ABRF_Msk                       //--- Auto-Baud Rate Flag
#define USART_ISR_BUSY_Pos            (16U)
#define USART_ISR_BUSY_Msk            (0x1UL << USART_ISR_BUSY_Pos)            //--- 0x00010000
#define USART_ISR_BUSY                USART_ISR_BUSY_Msk                       //--- Busy Flag
#define USART_ISR_CMF_Pos             (17U)
#define USART_ISR_CMF_Msk             (0x1UL << USART_ISR_CMF_Pos)             //--- 0x00020000
#define USART_ISR_CMF                 USART_ISR_CMF_Msk                        //--- Character Match Flag
#define USART_ISR_SBKF_Pos            (18U)
#define USART_ISR_SBKF_Msk            (0x1UL << USART_ISR_SBKF_Pos)            //--- 0x00040000
#define USART_ISR_SBKF                USART_ISR_SBKF_Msk                       //--- Send Break Flag
#define USART_ISR_RWU_Pos             (19U)
#define USART_ISR_RWU_Msk             (0x1UL << USART_ISR_RWU_Pos)             //--- 0x00080000
#define USART_ISR_RWU                 USART_ISR_RWU_Msk                        //--- Receive Wake Up from mute mode Flag
#define USART_ISR_WUF_Pos             (20U)
#define USART_ISR_WUF_Msk             (0x1UL << USART_ISR_WUF_Pos)             //--- 0x00100000
#define USART_ISR_WUF                 USART_ISR_WUF_Msk                        //--- Wake Up from stop mode Flag
#define USART_ISR_TEACK_Pos           (21U)
#define USART_ISR_TEACK_Msk           (0x1UL << USART_ISR_TEACK_Pos)           //--- 0x00200000
#define USART_ISR_TEACK               USART_ISR_TEACK_Msk                      //--- Transmit Enable Acknowledge Flag
#define USART_ISR_REACK_Pos           (22U)
#define USART_ISR_REACK_Msk           (0x1UL << USART_ISR_REACK_Pos)           //--- 0x00400000
#define USART_ISR_REACK               USART_ISR_REACK_Msk                      //--- Receive Enable Acknowledge Flag
#define USART_ISR_TCBGT_Pos           (25U)
#define USART_ISR_TCBGT_Msk           (0x1UL << USART_ISR_TCBGT_Pos)           //--- 0x02000000
#define USART_ISR_TCBGT               USART_ISR_TCBGT_Msk                      //--- Transmission Complete Before Guard Time Completion Flag

//---------------------------------------------------------------------------------------------
//---  Bit definition for USART_ICR register
//---------------------------------------------------------------------------------------------
#define USART_ICR_PECF_Pos            (0U)
#define USART_ICR_PECF_Msk            (0x1UL << USART_ICR_PECF_Pos)            //--- 0x00000001
#define USART_ICR_PECF                USART_ICR_PECF_Msk                       //--- Parity Error Clear Flag
#define USART_ICR_FECF_Pos            (1U)
#define USART_ICR_FECF_Msk            (0x1UL << USART_ICR_FECF_Pos)            //--- 0x00000002
#define USART_ICR_FECF                USART_ICR_FECF_Msk                       //--- Framing Error Clear Flag
#define USART_ICR_NECF_Pos            (2U)
#define USART_ICR_NECF_Msk            (0x1UL << USART_ICR_NECF_Pos)            //--- 0x00000004
#define USART_ICR_NECF                USART_ICR_NECF_Msk                       //--- Noise Error detected Clear Flag
#define USART_ICR_ORECF_Pos           (3U)
#define USART_ICR_ORECF_Msk           (0x1UL << USART_ICR_ORECF_Pos)           //--- 0x00000008
#define USART_ICR_ORECF               USART_ICR_ORECF_Msk                      //--- OverRun Error Clear Flag
#define USART_ICR_IDLECF_Pos          (4U)
#define USART_ICR_IDLECF_Msk          (0x1UL << USART_ICR_IDLECF_Pos)          //--- 0x00000010
#define USART_ICR_IDLECF              USART_ICR_IDLECF_Msk                     //--- IDLE line detected Clear Flag
#define USART_ICR_TCCF_Pos            (6U)
#define USART_ICR_TCCF_Msk            (0x1UL << USART_ICR_TCCF_Pos)            //--- 0x00000040
#define USART_ICR_TCCF                USART_ICR_TCCF_Msk                       //--- Transmission Complete Clear Flag
#define USART_ICR_TCBGTCF_Pos         (7U)
#define USART_ICR_TCBGTCF_Msk         (0x1UL << USART_ICR_TCBGTCF_Pos)         //--- 0x00000080
#define USART_ICR_TCBGTCF             USART_ICR_TCBGTCF_Msk                    //--- Transmission Complete Before Guard Time Clear Flag
#define USART_ICR_LBDCF_Pos           (8U)
#define USART_ICR_LBDCF_Msk           (0x1UL << USART_ICR_LBDCF_Pos)           //--- 0x00000100
#define USART_ICR_LBDCF               USART_ICR_LBDCF_Msk                      //--- LIN Break Detection Clear Flag
#define USART_ICR_CTSCF_Pos           (9U)
#define USART_ICR_CTSCF_Msk           (0x1UL << USART_ICR_CTSCF_Pos)           //--- 0x00000200
#define USART_ICR_CTSCF               USART_ICR_CTSCF_Msk                      //--- CTS Interrupt Clear Flag
#define USART_ICR_RTOCF_Pos           (11U)
#define USART_ICR_RTOCF_Msk           (0x1UL << USART_ICR_RTOCF_Pos)           //--- 0x00000800
#define USART_ICR_RTOCF               USART_ICR_RTOCF_Msk                      //--- Receiver Time Out Clear Flag
#define USART_ICR_EOBCF_Pos           (12U)
#define USART_ICR_EOBCF_Msk           (0x1UL << USART_ICR_EOBCF_Pos)           //--- 0x00001000
#define USART_ICR_EOBCF               USART_ICR_EOBCF_Msk                      //--- End Of Block Clear Flag
#define USART_ICR_CMCF_Pos            (17U)
#define USART_ICR_CMCF_Msk            (0x1UL << USART_ICR_CMCF_Pos)            //--- 0x00020000
#define USART_ICR_CMCF                USART_ICR_CMCF_Msk                       //--- Character Match Clear Flag
#define USART_ICR_WUCF_Pos            (20U)
#define USART_ICR_WUCF_Msk            (0x1UL << USART_ICR_WUCF_Pos)            //--- 0x00100000
#define USART_ICR_WUCF                USART_ICR_WUCF_Msk                       //--- Wake Up from stop mode Clear Flag

//---------------------------------------------------------------------------------------------
//--- Legacy defines
//---------------------------------------------------------------------------------------------
#define USART_ICR_NCF_Pos             USART_ICR_NECF_Pos
#define USART_ICR_NCF_Msk             USART_ICR_NECF_Msk
#define USART_ICR_NCF                 USART_ICR_NECF

//---------------------------------------------------------------------------------------------
//---  Bit definition for USART_RDR register
//---------------------------------------------------------------------------------------------
#define USART_RDR_RDR_Pos             (0U)
#define USART_RDR_RDR_Msk             (0x1FFUL << USART_RDR_RDR_Pos)           //--- 0x000001FF
#define USART_RDR_RDR                 USART_RDR_RDR_Msk                        //--- RDR[8:0] bits (Receive Data value)

//---------------------------------------------------------------------------------------------
//---  Bit definition for USART_TDR register
//---------------------------------------------------------------------------------------------
#define USART_TDR_TDR_Pos             (0U)
#define USART_TDR_TDR_Msk             (0x1FFUL << USART_TDR_TDR_Pos)           //--- 0x000001FF
#define USART_TDR_TDR                 USART_TDR_TDR_Msk                        //--- TDR[8:0] bits (Transmit Data value)

