Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define WWDG_CR_WDGA_Pos        (7U)
#define WWDG_CR_WDGA_Msk        (0x1UL << WWDG_CR_WDGA_Pos)                    //--- 0x00000080
#define WWDG_CR_WDGA            WWDG_CR_WDGA_Msk                               //----Activation bit

//---------------------------------------------------------------------------------------------
//---  Bit definition for WWDG_CFR register
//---------------------------------------------------------------------------------------------
#define WWDG_CFR_W_Pos          (0U)
#define WWDG_CFR_W_Msk          (0x7FUL << WWDG_CFR_W_Pos)                     //--- 0x0000007F
#define WWDG_CFR_W              WWDG_CFR_W_Msk                                 //----W[6:0] bits (7-bit window value)
#define WWDG_CFR_W_0            (0x01UL << WWDG_CFR_W_Pos)                     //--- 0x00000001
#define WWDG_CFR_W_1            (0x02UL << WWDG_CFR_W_Pos)                     //--- 0x00000002
#define WWDG_CFR_W_2            (0x04UL << WWDG_CFR_W_Pos)                     //--- 0x00000004
#define WWDG_CFR_W_3            (0x08UL << WWDG_CFR_W_Pos)                     //--- 0x00000008
#define WWDG_CFR_W_4            (0x10UL << WWDG_CFR_W_Pos)                     //--- 0x00000010
#define WWDG_CFR_W_5            (0x20UL << WWDG_CFR_W_Pos)                     //--- 0x00000020
#define WWDG_CFR_W_6            (0x40UL << WWDG_CFR_W_Pos)                     //--- 0x00000040

#define WWDG_CFR_WDGTB_Pos      (7U)
#define WWDG_CFR_WDGTB_Msk      (0x3UL << WWDG_CFR_WDGTB_Pos)                  //--- 0x00000180
#define WWDG_CFR_WDGTB          WWDG_CFR_WDGTB_Msk                             //----WDGTB[1:0] bits (Timer Base)
#define WWDG_CFR_WDGTB_0        (0x1UL << WWDG_CFR_WDGTB_Pos)                  //--- 0x00000080
#define WWDG_CFR_WDGTB_1        (0x2UL << WWDG_CFR_WDGTB_Pos)                  //--- 0x00000100

#define WWDG_CFR_EWI_Pos        (9U)
#define WWDG_CFR_EWI_Msk        (0x1UL << WWDG_CFR_EWI_Pos)                    //--- 0x00000200
#define WWDG_CFR_EWI            WWDG_CFR_EWI_Msk                               //----Early Wakeup Interrupt

//---------------------------------------------------------------------------------------------
//---  Bit definition for WWDG_SR register
//---------------------------------------------------------------------------------------------
#define WWDG_SR_EWIF_Pos        (0U)
#define WWDG_SR_EWIF_Msk        (0x1UL << WWDG_SR_EWIF_Pos)                    //--- 0x00000001
#define WWDG_SR_EWIF            WWDG_SR_EWIF_Msk                               //----Early Wakeup Interrupt Flag


//---------------------------------------------------------------------------------------------
//---                                  Debug MCU
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//--- Bit definition for DBGMCU_IDCODE register
//---------------------------------------------------------------------------------------------
#define DBGMCU_IDCODE_DEV_ID_Pos               (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk               (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos) //--- 0x00000FFF
#define DBGMCU_IDCODE_DEV_ID                   DBGMCU_IDCODE_DEV_ID_Msk
#define DBGMCU_IDCODE_REV_ID_Pos               (16U)
#define DBGMCU_IDCODE_REV_ID_Msk               (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos) //--- 0xFFFF0000
#define DBGMCU_IDCODE_REV_ID                   DBGMCU_IDCODE_REV_ID_Msk

//---------------------------------------------------------------------------------------------
//--- Bit definition for DBGMCU_CR register
//---------------------------------------------------------------------------------------------
#define DBGMCU_CR_DBG_SLEEP_Pos                (0U)
#define DBGMCU_CR_DBG_SLEEP_Msk                (0x1UL << DBGMCU_CR_DBG_SLEEP_Pos) //--- 0x00000001
#define DBGMCU_CR_DBG_SLEEP                    DBGMCU_CR_DBG_SLEEP_Msk
#define DBGMCU_CR_DBG_STOP_Pos                 (1U)
#define DBGMCU_CR_DBG_STOP_Msk                 (0x1UL << DBGMCU_CR_DBG_STOP_Pos) //--- 0x00000002
#define DBGMCU_CR_DBG_STOP                     DBGMCU_CR_DBG_STOP_Msk
#define DBGMCU_CR_DBG_STANDBY_Pos              (2U)
#define DBGMCU_CR_DBG_STANDBY_Msk              (0x1UL << DBGMCU_CR_DBG_STANDBY_Pos) //--- 0x00000004
#define DBGMCU_CR_DBG_STANDBY                  DBGMCU_CR_DBG_STANDBY_Msk
#define DBGMCU_CR_TRACE_IOEN_Pos               (5U)
#define DBGMCU_CR_TRACE_IOEN_Msk               (0x1UL << DBGMCU_CR_TRACE_IOEN_Pos) //--- 0x00000020
#define DBGMCU_CR_TRACE_IOEN                   DBGMCU_CR_TRACE_IOEN_Msk

#define DBGMCU_CR_TRACE_MODE_Pos               (6U)
#define DBGMCU_CR_TRACE_MODE_Msk               (0x3UL << DBGMCU_CR_TRACE_MODE_Pos) //--- 0x000000C0
#define DBGMCU_CR_TRACE_MODE                   DBGMCU_CR_TRACE_MODE_Msk
#define DBGMCU_CR_TRACE_MODE_0                 (0x1UL << DBGMCU_CR_TRACE_MODE_Pos) //--- 0x00000040
#define DBGMCU_CR_TRACE_MODE_1                 (0x2UL << DBGMCU_CR_TRACE_MODE_Pos) //--- 0x00000080

//---------------------------------------------------------------------------------------------
//--- Bit definition for DBGMCU_APB1FZR1 register
//---------------------------------------------------------------------------------------------
#define DBGMCU_APB1FZR1_DBG_TIM2_STOP_Pos      (0U)
#define DBGMCU_APB1FZR1_DBG_TIM2_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_TIM2_STOP_Pos) //--- 0x00000001
#define DBGMCU_APB1FZR1_DBG_TIM2_STOP          DBGMCU_APB1FZR1_DBG_TIM2_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_TIM6_STOP_Pos      (4U)
#define DBGMCU_APB1FZR1_DBG_TIM6_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_TIM6_STOP_Pos) //--- 0x00000010
#define DBGMCU_APB1FZR1_DBG_TIM6_STOP          DBGMCU_APB1FZR1_DBG_TIM6_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_TIM7_STOP_Pos      (5U)
#define DBGMCU_APB1FZR1_DBG_TIM7_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_TIM7_STOP_Pos) //--- 0x00000020
#define DBGMCU_APB1FZR1_DBG_TIM7_STOP          DBGMCU_APB1FZR1_DBG_TIM7_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_RTC_STOP_Pos       (10U)
#define DBGMCU_APB1FZR1_DBG_RTC_STOP_Msk       (0x1UL << DBGMCU_APB1FZR1_DBG_RTC_STOP_Pos) //--- 0x00000400
#define DBGMCU_APB1FZR1_DBG_RTC_STOP           DBGMCU_APB1FZR1_DBG_RTC_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_WWDG_STOP_Pos      (11U)
#define DBGMCU_APB1FZR1_DBG_WWDG_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_WWDG_STOP_Pos) //--- 0x00000800
#define DBGMCU_APB1FZR1_DBG_WWDG_STOP          DBGMCU_APB1FZR1_DBG_WWDG_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_IWDG_STOP_Pos      (12U)
#define DBGMCU_APB1FZR1_DBG_IWDG_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_IWDG_STOP_Pos) //--- 0x00001000
#define DBGMCU_APB1FZR1_DBG_IWDG_STOP          DBGMCU_APB1FZR1_DBG_IWDG_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_I2C1_STOP_Pos      (21U)
#define DBGMCU_APB1FZR1_DBG_I2C1_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_I2C1_STOP_Pos) //--- 0x00200000
#define DBGMCU_APB1FZR1_DBG_I2C1_STOP          DBGMCU_APB1FZR1_DBG_I2C1_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_I2C3_STOP_Pos      (23U)
#define DBGMCU_APB1FZR1_DBG_I2C3_STOP_Msk      (0x1UL << DBGMCU_APB1FZR1_DBG_I2C3_STOP_Pos) //--- 0x00800000
#define DBGMCU_APB1FZR1_DBG_I2C3_STOP          DBGMCU_APB1FZR1_DBG_I2C3_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_CAN_STOP_Pos       (25U)
#define DBGMCU_APB1FZR1_DBG_CAN_STOP_Msk       (0x1UL << DBGMCU_APB1FZR1_DBG_CAN_STOP_Pos) //--- 0x02000000
#define DBGMCU_APB1FZR1_DBG_CAN_STOP           DBGMCU_APB1FZR1_DBG_CAN_STOP_Msk
#define DBGMCU_APB1FZR1_DBG_LPTIM1_STOP_Pos    (31U)
#define DBGMCU_APB1FZR1_DBG_LPTIM1_STOP_Msk    (0x1UL << DBGMCU_APB1FZR1_DBG_LPTIM1_STOP_Pos) //--- 0x80000000
#define DBGMCU_APB1FZR1_DBG_LPTIM1_STOP        DBGMCU_APB1FZR1_DBG_LPTIM1_STOP_Msk

//---------------------------------------------------------------------------------------------
//--- Bit definition for DBGMCU_APB1FZR2 register
//---------------------------------------------------------------------------------------------
#define DBGMCU_APB1FZR2_DBG_LPTIM2_STOP_Pos    (5U)
#define DBGMCU_APB1FZR2_DBG_LPTIM2_STOP_Msk    (0x1UL << DBGMCU_APB1FZR2_DBG_LPTIM2_STOP_Pos) //--- 0x00000020
#define DBGMCU_APB1FZR2_DBG_LPTIM2_STOP        DBGMCU_APB1FZR2_DBG_LPTIM2_STOP_Msk

//--- Bit definition for DBGMCU_APB2FZ register
#define DBGMCU_APB2FZ_DBG_TIM1_STOP_Pos        (11U)
#define DBGMCU_APB2FZ_DBG_TIM1_STOP_Msk        (0x1UL << DBGMCU_APB2FZ_DBG_TIM1_STOP_Pos) //--- 0x00000800
#define DBGMCU_APB2FZ_DBG_TIM1_STOP            DBGMCU_APB2FZ_DBG_TIM1_STOP_Msk
#define DBGMCU_APB2FZ_DBG_TIM15_STOP_Pos       (16U)
#define DBGMCU_APB2FZ_DBG_TIM15_STOP_Msk       (0x1UL << DBGMCU_APB2FZ_DBG_TIM15_STOP_Pos) //--- 0x00010000
#define DBGMCU_APB2FZ_DBG_TIM15_STOP           DBGMCU_APB2FZ_DBG_TIM15_STOP_Msk
#define DBGMCU_APB2FZ_DBG_TIM16_STOP_Pos       (17U)
#define DBGMCU_APB2FZ_DBG_TIM16_STOP_Msk       (0x1UL << DBGMCU_APB2FZ_DBG_TIM16_STOP_Pos) //--- 0x00020000
#define DBGMCU_APB2FZ_DBG_TIM16_STOP           DBGMCU_APB2FZ_DBG_TIM16_STOP_Msk

//---------------------------------------------------------------------------------------------
//---                          USB Device FS Endpoint registers
//---------------------------------------------------------------------------------------------
// #define USB_EP0R                                 USB_BASE                  //--- endpoint 0 register address
// #define USB_EP1R                                 (USB_BASE + 0x00000004UL)   //--- endpoint 1 register address
// #define USB_EP2R                                 (USB_BASE + 0x00000008UL)   //--- endpoint 2 register address
// #define USB_EP3R                                 (USB_BASE + 0x0000000CUL)   //--- endpoint 3 register address
// #define USB_EP4R                                 (USB_BASE + 0x00000010UL)   //--- endpoint 4 register address
// #define USB_EP5R                                 (USB_BASE + 0x00000014UL)   //--- endpoint 5 register address
// #define USB_EP6R                                 (USB_BASE + 0x00000018UL)   //--- endpoint 6 register address
// #define USB_EP7R                                 (USB_BASE + 0x0000001CUL)   //--- endpoint 7 register address

//---------------------------------------------------------------------------------------------
//---  bit positions
//---------------------------------------------------------------------------------------------
#define USB_EP_CTR_RX                            ((u16)0x8000U)           //---  EndPoint Correct TRansfer RX
#define USB_EP_DTOG_RX                           ((u16)0x4000U)           //---  EndPoint Data TOGGLE RX
#define USB_EPRX_STAT                            ((u16)0x3000U)           //---  EndPoint RX STATus bit field
#define USB_EP_SETUP                             ((u16)0x0800U)           //---  EndPoint SETUP
#define USB_EP_T_FIELD                           ((u16)0x0600U)           //---  EndPoint TYPE
#define USB_EP_KIND                              ((u16)0x0100U)           //---  EndPoint KIND
#define USB_EP_CTR_TX                            ((u16)0x0080U)           //---  EndPoint Correct TRansfer TX
#define USB_EP_DTOG_TX                           ((u16)0x0040U)           //---  EndPoint Data TOGGLE TX
#define USB_EPTX_STAT                            ((u16)0x0030U)           //---  EndPoint TX STATus bit field
#define USB_EPADDR_FIELD                         ((u16)0x000FU)           //---  EndPoint ADDRess FIELD

//---------------------------------------------------------------------------------------------
//---  EndPoint REGister MASK (no toggle fields)
//---------------------------------------------------------------------------------------------
#define USB_EPREG_MASK     (USB_EP_CTR_RX|USB_EP_SETUP|USB_EP_T_FIELD|USB_EP_KIND|USB_EP_CTR_TX|USB_EPADDR_FIELD)
                                                                         //--- EP_TYPE[1:0] EndPoint TYPE
#define USB_EP_TYPE_MASK                         ((u16)0x0600U)           //--- EndPoint TYPE Mask
#define USB_EP_BULK                              ((u16)0x0000U)           //--- EndPoint BULK
#define USB_EP_CONTROL                           ((u16)0x0200U)           //--- EndPoint CONTROL
#define USB_EP_ISOCHRONOUS                       ((u16)0x0400U)           //--- EndPoint ISOCHRONOUS
#define USB_EP_INTERRUPT                         ((u16)0x0600U)           //--- EndPoint INTERRUPT
#define USB_EP_T_MASK                        ((u16) ~USB_EP_T_FIELD & USB_EPREG_MASK)

