Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define USB_EPKIND_MASK                      ((u16)~USB_EP_KIND & USB_EPREG_MASK) //--- EP_KIND EndPoint KIND
                                                                         //--- STAT_TX[1:0] STATus for TX transfer
#define USB_EP_TX_DIS                            ((u16)0x0000U)           //--- EndPoint TX DISabled
#define USB_EP_TX_STALL                          ((u16)0x0010U)           //--- EndPoint TX STALLed
#define USB_EP_TX_NAK                            ((u16)0x0020U)           //--- EndPoint TX NAKed
#define USB_EP_TX_VALID                          ((u16)0x0030U)           //--- EndPoint TX VALID
#define USB_EPTX_DTOG1                           ((u16)0x0010U)           //--- EndPoint TX Data TOGgle bit1
#define USB_EPTX_DTOG2                           ((u16)0x0020U)           //--- EndPoint TX Data TOGgle bit2
#define USB_EPTX_DTOGMASK  (USB_EPTX_STAT|USB_EPREG_MASK)
                                                                         //--- STAT_RX[1:0] STATus for RX transfer
#define USB_EP_RX_DIS                            ((u16)0x0000U)           //--- EndPoint RX DISabled
#define USB_EP_RX_STALL                          ((u16)0x1000U)           //--- EndPoint RX STALLed
#define USB_EP_RX_NAK                            ((u16)0x2000U)           //--- EndPoint RX NAKed
#define USB_EP_RX_VALID                          ((u16)0x3000U)           //--- EndPoint RX VALID
#define USB_EPRX_DTOG1                           ((u16)0x1000U)           //--- EndPoint RX Data TOGgle bit1
#define USB_EPRX_DTOG2                           ((u16)0x2000U)           //--- EndPoint RX Data TOGgle bit1
#define USB_EPRX_DTOGMASK  (USB_EPRX_STAT|USB_EPREG_MASK)

//---------------------------------------------------------------------------------------------
//---                     USB Device FS General registers
//---------------------------------------------------------------------------------------------
// #define USB_CNTR                             (USB_BASE + 0x00000040UL)     //--- Control register
// #define USB_ISTR                             (USB_BASE + 0x00000044UL)     //--- Interrupt status register
// #define USB_FNR                              (USB_BASE + 0x00000048UL)     //--- Frame number register
// #define USB_DADDR                            (USB_BASE + 0x0000004CUL)     //--- Device address register
// #define USB_BTABLE                           (USB_BASE + 0x00000050UL)     //--- Buffer Table address register
// #define USB_LPMCSR                           (USB_BASE + 0x00000054UL)     //--- LPM Control and Status register
// #define USB_BCDR                             (USB_BASE + 0x00000058UL)     //--- Battery Charging detector register

//---------------------------------------------------------------------------------------------
//---   Bits definition for USB_CNTR register
//---------------------------------------------------------------------------------------------
#define USB_CNTR_CTRM                            ((u16)0x8000U)           //--- Correct TRansfer Mask
#define USB_CNTR_PMAOVRM                         ((u16)0x4000U)           //--- DMA OVeR/underrun Mask
#define USB_CNTR_ERRM                            ((u16)0x2000U)           //--- ERRor Mask
#define USB_CNTR_WKUPM                           ((u16)0x1000U)           //--- WaKe UP Mask
#define USB_CNTR_SUSPM                           ((u16)0x0800U)           //--- SUSPend Mask
#define USB_CNTR_RESETM                          ((u16)0x0400U)           //--- RESET Mask
#define USB_CNTR_SOFM                            ((u16)0x0200U)           //--- Start Of Frame Mask
#define USB_CNTR_ESOFM                           ((u16)0x0100U)           //--- Expected Start Of Frame Mask
#define USB_CNTR_L1REQM                          ((u16)0x0080U)           //--- LPM L1 state request interrupt mask
#define USB_CNTR_L1RESUME                        ((u16)0x0020U)           //--- LPM L1 Resume request
#define USB_CNTR_RESUME                          ((u16)0x0010U)           //--- RESUME request
#define USB_CNTR_FSUSP                           ((u16)0x0008U)           //--- Force SUSPend
#define USB_CNTR_LPMODE                          ((u16)0x0004U)           //--- Low-power MODE
#define USB_CNTR_PDWN                            ((u16)0x0002U)           //--- Power DoWN
#define USB_CNTR_FRES                            ((u16)0x0001U)           //--- Force USB RESet

//---------------------------------------------------------------------------------------------
//---   Bits definition for USB_ISTR register
//---------------------------------------------------------------------------------------------
#define USB_ISTR_EP_ID                           ((u16)0x000FU)           //--- EndPoint IDentifier (read-only bit)
#define USB_ISTR_DIR                             ((u16)0x0010U)           //--- DIRection of transaction (read-only bit)
#define USB_ISTR_L1REQ                           ((u16)0x0080U)           //--- LPM L1 state request
#define USB_ISTR_ESOF                            ((u16)0x0100U)           //--- Expected Start Of Frame (clear-only bit)
#define USB_ISTR_SOF                             ((u16)0x0200U)           //--- Start Of Frame (clear-only bit)
#define USB_ISTR_RESET                           ((u16)0x0400U)           //--- RESET (clear-only bit)
#define USB_ISTR_SUSP                            ((u16)0x0800U)           //--- SUSPend (clear-only bit)
#define USB_ISTR_WKUP                            ((u16)0x1000U)           //--- WaKe UP (clear-only bit)
#define USB_ISTR_ERR                             ((u16)0x2000U)           //--- ERRor (clear-only bit)
#define USB_ISTR_PMAOVR                          ((u16)0x4000U)           //--- DMA OVeR/underrun (clear-only bit)
#define USB_ISTR_CTR                             ((u16)0x8000U)           //--- Correct TRansfer (clear-only bit)

//---------------------------------------------------------------------------------------------
//---   Bits definition for USB_CLR register
//---------------------------------------------------------------------------------------------
#define USB_CLR_L1REQ                        (~USB_ISTR_L1REQ)           //--- clear LPM L1  bit
#define USB_CLR_ESOF                         (~USB_ISTR_ESOF)            //--- clear Expected Start Of Frame bit
#define USB_CLR_SOF                          (~USB_ISTR_SOF)             //--- clear Start Of Frame bit
#define USB_CLR_RESET                        (~USB_ISTR_RESET)           //--- clear RESET bit
#define USB_CLR_SUSP                         (~USB_ISTR_SUSP)            //--- clear SUSPend bit
#define USB_CLR_WKUP                         (~USB_ISTR_WKUP)            //--- clear WaKe UP bit
#define USB_CLR_ERR                          (~USB_ISTR_ERR)             //--- clear ERRor bit
#define USB_CLR_PMAOVR                       (~USB_ISTR_PMAOVR)          //--- clear DMA OVeR/underrun bit
#define USB_CLR_CTR                          (~USB_ISTR_CTR)             //--- clear Correct TRansfer bit

//---------------------------------------------------------------------------------------------
//---   Bits definition for USB_FNR register
//---------------------------------------------------------------------------------------------
#define USB_FNR_FN                               ((u16)0x07FFU)           //--- Frame Number
#define USB_FNR_LSOF                             ((u16)0x1800U)           //--- Lost SOF
#define USB_FNR_LCK                              ((u16)0x2000U)           //--- LoCKed
#define USB_FNR_RXDM                             ((u16)0x4000U)           //--- status of D- data line
#define USB_FNR_RXDP                             ((u16)0x8000U)           //--- status of D+ data line

//---------------------------------------------------------------------------------------------
//---   Bits definition for USB_DADDR register
//---------------------------------------------------------------------------------------------
#define USB_DADDR_ADD                            ((u08)0x7FU)              //--- ADD[6:0] bits (Device Address)
#define USB_DADDR_ADD0                           ((u08)0x01U)              //--- Bit 0
#define USB_DADDR_ADD1                           ((u08)0x02U)              //--- Bit 1
#define USB_DADDR_ADD2                           ((u08)0x04U)              //--- Bit 2
#define USB_DADDR_ADD3                           ((u08)0x08U)              //--- Bit 3
#define USB_DADDR_ADD4                           ((u08)0x10U)              //--- Bit 4
#define USB_DADDR_ADD5                           ((u08)0x20U)              //--- Bit 5
#define USB_DADDR_ADD6                           ((u08)0x40U)              //--- Bit 6

#define USB_DADDR_EF                             ((u08)0x80U)              //--- Enable Function

//---------------------------------------------------------------------------------------------
//---   Bit definition for USB_BTABLE register
//---------------------------------------------------------------------------------------------
#define USB_BTABLE_BTABLE                        ((u16)0xFFF8U)           //--- Buffer Table

//---------------------------------------------------------------------------------------------
//---   Bits definition for USB_BCDR register
//---------------------------------------------------------------------------------------------
#define USB_BCDR_BCDEN                           ((u16)0x0001U)           //--- Battery charging detector (BCD) enable
#define USB_BCDR_DCDEN                           ((u16)0x0002U)           //--- Data contact detection (DCD) mode enable
#define USB_BCDR_PDEN                            ((u16)0x0004U)           //--- Primary detection (PD) mode enable
#define USB_BCDR_SDEN                            ((u16)0x0008U)           //--- Secondary detection (SD) mode enable
#define USB_BCDR_DCDET                           ((u16)0x0010U)           //--- Data contact detection (DCD) status
#define USB_BCDR_PDET                            ((u16)0x0020U)           //--- Primary detection (PD) status
#define USB_BCDR_SDET                            ((u16)0x0040U)           //--- Secondary detection (SD) status
#define USB_BCDR_PS2DET                          ((u16)0x0080U)           //--- PS2 port or proprietary charger detected
#define USB_BCDR_DPPU                            ((u16)0x8000U)           //--- DP Pull-up Enable

//---------------------------------------------------------------------------------------------
//---  Bit definition for LPMCSR register
//---------------------------------------------------------------------------------------------
#define USB_LPMCSR_LMPEN                         ((u16)0x0001U)           //--- LPM support enable
#define USB_LPMCSR_LPMACK                        ((u16)0x0002U)           //--- LPM Token acknowledge enable
#define USB_LPMCSR_REMWAKE                       ((u16)0x0008U)           //--- bRemoteWake value received with last ACKed LPM Token
#define USB_LPMCSR_BESL                          ((u16)0x00F0U)           //--- BESL value received with last ACKed LPM Token

//---------------------------------------------------------------------------------------------
//--- Buffer descriptor table
//---  Bit definition for USB_ADDR0_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR0_TX_ADDR0_TX_Pos                (1U)
#define USB_ADDR0_TX_ADDR0_TX_Msk                (0x7FFFUL << USB_ADDR0_TX_ADDR0_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR0_TX_ADDR0_TX                    USB_ADDR0_TX_ADDR0_TX_Msk     //--- Transmission Buffer Address 0

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR1_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR1_TX_ADDR1_TX_Pos                (1U)
#define USB_ADDR1_TX_ADDR1_TX_Msk                (0x7FFFUL << USB_ADDR1_TX_ADDR1_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR1_TX_ADDR1_TX                    USB_ADDR1_TX_ADDR1_TX_Msk     //--- Transmission Buffer Address 1

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR2_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR2_TX_ADDR2_TX_Pos                (1U)
#define USB_ADDR2_TX_ADDR2_TX_Msk                (0x7FFFUL << USB_ADDR2_TX_ADDR2_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR2_TX_ADDR2_TX                    USB_ADDR2_TX_ADDR2_TX_Msk     //--- Transmission Buffer Address 2

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR3_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR3_TX_ADDR3_TX_Pos                (1U)
#define USB_ADDR3_TX_ADDR3_TX_Msk                (0x7FFFUL << USB_ADDR3_TX_ADDR3_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR3_TX_ADDR3_TX                    USB_ADDR3_TX_ADDR3_TX_Msk     //--- Transmission Buffer Address 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR4_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR4_TX_ADDR4_TX_Pos                (1U)
#define USB_ADDR4_TX_ADDR4_TX_Msk                (0x7FFFUL << USB_ADDR4_TX_ADDR4_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR4_TX_ADDR4_TX                    USB_ADDR4_TX_ADDR4_TX_Msk     //--- Transmission Buffer Address 4

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR5_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR5_TX_ADDR5_TX_Pos                (1U)
#define USB_ADDR5_TX_ADDR5_TX_Msk                (0x7FFFUL << USB_ADDR5_TX_ADDR5_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR5_TX_ADDR5_TX                    USB_ADDR5_TX_ADDR5_TX_Msk     //--- Transmission Buffer Address 5

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR6_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR6_TX_ADDR6_TX_Pos                (1U)
#define USB_ADDR6_TX_ADDR6_TX_Msk                (0x7FFFUL << USB_ADDR6_TX_ADDR6_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR6_TX_ADDR6_TX                    USB_ADDR6_TX_ADDR6_TX_Msk     //--- Transmission Buffer Address 6

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR7_TX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR7_TX_ADDR7_TX_Pos                (1U)
#define USB_ADDR7_TX_ADDR7_TX_Msk                (0x7FFFUL << USB_ADDR7_TX_ADDR7_TX_Pos) //--- 0x0000FFFE
#define USB_ADDR7_TX_ADDR7_TX                    USB_ADDR7_TX_ADDR7_TX_Msk     //--- Transmission Buffer Address 7

//--- ----------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT0_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT0_TX_COUNT0_TX_Pos              (0U)
#define USB_COUNT0_TX_COUNT0_TX_Msk              (0x3FFUL << USB_COUNT0_TX_COUNT0_TX_Pos) //--- 0x000003FF
#define USB_COUNT0_TX_COUNT0_TX                  USB_COUNT0_TX_COUNT0_TX_Msk   //--- Transmission Byte Count 0

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT1_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT1_TX_COUNT1_TX_Pos              (0U)
#define USB_COUNT1_TX_COUNT1_TX_Msk              (0x3FFUL << USB_COUNT1_TX_COUNT1_TX_Pos) //--- 0x000003FF
#define USB_COUNT1_TX_COUNT1_TX                  USB_COUNT1_TX_COUNT1_TX_Msk   //--- Transmission Byte Count 1

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT2_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT2_TX_COUNT2_TX_Pos              (0U)
#define USB_COUNT2_TX_COUNT2_TX_Msk              (0x3FFUL << USB_COUNT2_TX_COUNT2_TX_Pos) //--- 0x000003FF
#define USB_COUNT2_TX_COUNT2_TX                  USB_COUNT2_TX_COUNT2_TX_Msk   //--- Transmission Byte Count 2

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT3_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT3_TX_COUNT3_TX_Pos              (0U)
#define USB_COUNT3_TX_COUNT3_TX_Msk              (0x3FFUL << USB_COUNT3_TX_COUNT3_TX_Pos) //--- 0x000003FF
#define USB_COUNT3_TX_COUNT3_TX                  USB_COUNT3_TX_COUNT3_TX_Msk   //--- Transmission Byte Count 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT4_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT4_TX_COUNT4_TX_Pos              (0U)
#define USB_COUNT4_TX_COUNT4_TX_Msk              (0x3FFUL << USB_COUNT4_TX_COUNT4_TX_Pos) //--- 0x000003FF
#define USB_COUNT4_TX_COUNT4_TX                  USB_COUNT4_TX_COUNT4_TX_Msk   //--- Transmission Byte Count 4

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT5_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT5_TX_COUNT5_TX_Pos              (0U)
#define USB_COUNT5_TX_COUNT5_TX_Msk              (0x3FFUL << USB_COUNT5_TX_COUNT5_TX_Pos) //--- 0x000003FF
#define USB_COUNT5_TX_COUNT5_TX                  USB_COUNT5_TX_COUNT5_TX_Msk   //--- Transmission Byte Count 5

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT6_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT6_TX_COUNT6_TX_Pos              (0U)
#define USB_COUNT6_TX_COUNT6_TX_Msk              (0x3FFUL << USB_COUNT6_TX_COUNT6_TX_Pos) //--- 0x000003FF
#define USB_COUNT6_TX_COUNT6_TX                  USB_COUNT6_TX_COUNT6_TX_Msk   //--- Transmission Byte Count 6

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT7_TX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT7_TX_COUNT7_TX_Pos              (0U)
#define USB_COUNT7_TX_COUNT7_TX_Msk              (0x3FFUL << USB_COUNT7_TX_COUNT7_TX_Pos) //--- 0x000003FF
#define USB_COUNT7_TX_COUNT7_TX                  USB_COUNT7_TX_COUNT7_TX_Msk   //--- Transmission Byte Count 7


//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT0_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT0_TX_0_COUNT0_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 0 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT0_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT0_TX_1_COUNT0_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 0 (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT1_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT1_TX_0_COUNT1_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 1 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT1_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT1_TX_1_COUNT1_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 1 (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT2_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT2_TX_0_COUNT2_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 2 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT2_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT2_TX_1_COUNT2_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 2 (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT3_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT3_TX_0_COUNT3_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 3 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT3_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT3_TX_1_COUNT3_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 3 (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT4_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT4_TX_0_COUNT4_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 4 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT4_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT4_TX_1_COUNT4_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 4 (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT5_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT5_TX_0_COUNT5_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 5 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT5_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT5_TX_1_COUNT5_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 5 (high)

