Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT6_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT6_TX_0_COUNT6_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 6 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT6_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT6_TX_1_COUNT6_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 6 (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT7_TX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT7_TX_0_COUNT7_TX_0         (0x000003FFUL)       //--- Transmission Byte Count 7 (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT7_TX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT7_TX_1_COUNT7_TX_1         (0x03FF0000UL)       //--- Transmission Byte Count 7 (high)

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR0_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR0_RX_ADDR0_RX_Pos                (1U)
#define USB_ADDR0_RX_ADDR0_RX_Msk                (0x7FFFUL << USB_ADDR0_RX_ADDR0_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR0_RX_ADDR0_RX                    USB_ADDR0_RX_ADDR0_RX_Msk     //--- Reception Buffer Address 0

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR1_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR1_RX_ADDR1_RX_Pos                (1U)
#define USB_ADDR1_RX_ADDR1_RX_Msk                (0x7FFFUL << USB_ADDR1_RX_ADDR1_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR1_RX_ADDR1_RX                    USB_ADDR1_RX_ADDR1_RX_Msk     //--- Reception Buffer Address 1

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR2_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR2_RX_ADDR2_RX_Pos                (1U)
#define USB_ADDR2_RX_ADDR2_RX_Msk                (0x7FFFUL << USB_ADDR2_RX_ADDR2_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR2_RX_ADDR2_RX                    USB_ADDR2_RX_ADDR2_RX_Msk     //--- Reception Buffer Address 2

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR3_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR3_RX_ADDR3_RX_Pos                (1U)
#define USB_ADDR3_RX_ADDR3_RX_Msk                (0x7FFFUL << USB_ADDR3_RX_ADDR3_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR3_RX_ADDR3_RX                    USB_ADDR3_RX_ADDR3_RX_Msk     //--- Reception Buffer Address 3

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR4_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR4_RX_ADDR4_RX_Pos                (1U)
#define USB_ADDR4_RX_ADDR4_RX_Msk                (0x7FFFUL << USB_ADDR4_RX_ADDR4_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR4_RX_ADDR4_RX                    USB_ADDR4_RX_ADDR4_RX_Msk     //--- Reception Buffer Address 4

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR5_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR5_RX_ADDR5_RX_Pos                (1U)
#define USB_ADDR5_RX_ADDR5_RX_Msk                (0x7FFFUL << USB_ADDR5_RX_ADDR5_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR5_RX_ADDR5_RX                    USB_ADDR5_RX_ADDR5_RX_Msk     //--- Reception Buffer Address 5

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR6_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR6_RX_ADDR6_RX_Pos                (1U)
#define USB_ADDR6_RX_ADDR6_RX_Msk                (0x7FFFUL << USB_ADDR6_RX_ADDR6_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR6_RX_ADDR6_RX                    USB_ADDR6_RX_ADDR6_RX_Msk     //--- Reception Buffer Address 6

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_ADDR7_RX register
//---------------------------------------------------------------------------------------------
#define USB_ADDR7_RX_ADDR7_RX_Pos                (1U)
#define USB_ADDR7_RX_ADDR7_RX_Msk                (0x7FFFUL << USB_ADDR7_RX_ADDR7_RX_Pos) //--- 0x0000FFFE
#define USB_ADDR7_RX_ADDR7_RX                    USB_ADDR7_RX_ADDR7_RX_Msk     //--- Reception Buffer Address 7

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT0_RX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT0_RX_COUNT0_RX_Pos              (0U)
#define USB_COUNT0_RX_COUNT0_RX_Msk              (0x3FFUL << USB_COUNT0_RX_COUNT0_RX_Pos) //--- 0x000003FF
#define USB_COUNT0_RX_COUNT0_RX                  USB_COUNT0_RX_COUNT0_RX_Msk   //--- Reception Byte Count

#define USB_COUNT0_RX_NUM_BLOCK_Pos              (10U)
#define USB_COUNT0_RX_NUM_BLOCK_Msk              (0x1FUL << USB_COUNT0_RX_NUM_BLOCK_Pos) //--- 0x00007C00
#define USB_COUNT0_RX_NUM_BLOCK                  USB_COUNT0_RX_NUM_BLOCK_Msk   //--- NUM_BLOCK[4:0] bits (Number of blocks)
#define USB_COUNT0_RX_NUM_BLOCK_0                (0x01UL << USB_COUNT0_RX_NUM_BLOCK_Pos) //--- 0x00000400
#define USB_COUNT0_RX_NUM_BLOCK_1                (0x02UL << USB_COUNT0_RX_NUM_BLOCK_Pos) //--- 0x00000800
#define USB_COUNT0_RX_NUM_BLOCK_2                (0x04UL << USB_COUNT0_RX_NUM_BLOCK_Pos) //--- 0x00001000
#define USB_COUNT0_RX_NUM_BLOCK_3                (0x08UL << USB_COUNT0_RX_NUM_BLOCK_Pos) //--- 0x00002000
#define USB_COUNT0_RX_NUM_BLOCK_4                (0x10UL << USB_COUNT0_RX_NUM_BLOCK_Pos) //--- 0x00004000

#define USB_COUNT0_RX_BLSIZE_Pos                 (15U)
#define USB_COUNT0_RX_BLSIZE_Msk                 (0x1UL << USB_COUNT0_RX_BLSIZE_Pos) //--- 0x00008000
#define USB_COUNT0_RX_BLSIZE                     USB_COUNT0_RX_BLSIZE_Msk      //--- BLock SIZE

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT1_RX register
//---------------------------------------------------------------------------------------------
#define USB_COUNT1_RX_COUNT1_RX_Pos              (0U)
#define USB_COUNT1_RX_COUNT1_RX_Msk              (0x3FFUL << USB_COUNT1_RX_COUNT1_RX_Pos) //--- 0x000003FF
#define USB_COUNT1_RX_COUNT1_RX                  USB_COUNT1_RX_COUNT1_RX_Msk   //--- Reception Byte Count

#define USB_COUNT1_RX_NUM_BLOCK_Pos              (10U)
#define USB_COUNT1_RX_NUM_BLOCK_Msk              (0x1FUL << USB_COUNT1_RX_NUM_BLOCK_Pos) //--- 0x00007C00
#define USB_COUNT1_RX_NUM_BLOCK                  USB_COUNT1_RX_NUM_BLOCK_Msk   //--- NUM_BLOCK[4:0] bits (Number of blocks)
#define USB_COUNT1_RX_NUM_BLOCK_0                (0x01UL << USB_COUNT1_RX_NUM_BLOCK_Pos) //--- 0x00000400
#define USB_COUNT1_RX_NUM_BLOCK_1                (0x02UL << USB_COUNT1_RX_NUM_BLOCK_Pos) //--- 0x00000800
#define USB_COUNT1_RX_NUM_BLOCK_2                (0x04UL << USB_COUNT1_RX_NUM_BLOCK_Pos) //--- 0x00001000
#define USB_COUNT1_RX_NUM_BLOCK_3                (0x08UL << USB_COUNT1_RX_NUM_BLOCK_Pos) //--- 0x00002000
#define USB_COUNT1_RX_NUM_BLOCK_4                (0x10UL << USB_COUNT1_RX_NUM_BLOCK_Pos) //--- 0x00004000

