Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define USB_COUNT7_RX_BLSIZE_Pos                 (15U)
#define USB_COUNT7_RX_BLSIZE_Msk                 (0x1UL << USB_COUNT7_RX_BLSIZE_Pos) //--- 0x00008000
#define USB_COUNT7_RX_BLSIZE                     USB_COUNT7_RX_BLSIZE_Msk      //--- BLock SIZE

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT0_RX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT0_RX_0_COUNT0_RX_0              (0x000003FFUL)          //--- Reception Byte Count (low)

#define USB_COUNT0_RX_0_NUM_BLOCK_0              (0x00007C00UL)          //--- NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
#define USB_COUNT0_RX_0_NUM_BLOCK_0_0            (0x00000400UL)          //--- Bit 0
#define USB_COUNT0_RX_0_NUM_BLOCK_0_1            (0x00000800UL)          //--- Bit 1
#define USB_COUNT0_RX_0_NUM_BLOCK_0_2            (0x00001000UL)          //--- Bit 2
#define USB_COUNT0_RX_0_NUM_BLOCK_0_3            (0x00002000UL)          //--- Bit 3
#define USB_COUNT0_RX_0_NUM_BLOCK_0_4            (0x00004000UL)          //--- Bit 4

#define USB_COUNT0_RX_0_BLSIZE_0                 (0x00008000UL)          //--- BLock SIZE (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT0_RX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT0_RX_1_COUNT0_RX_1              (0x03FF0000UL)          //--- Reception Byte Count (high)

#define USB_COUNT0_RX_1_NUM_BLOCK_1              (0x7C000000UL)          //--- NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
#define USB_COUNT0_RX_1_NUM_BLOCK_1_0            (0x04000000UL)          //--- Bit 1
#define USB_COUNT0_RX_1_NUM_BLOCK_1_1            (0x08000000UL)          //--- Bit 1
#define USB_COUNT0_RX_1_NUM_BLOCK_1_2            (0x10000000UL)          //--- Bit 2
#define USB_COUNT0_RX_1_NUM_BLOCK_1_3            (0x20000000UL)          //--- Bit 3
#define USB_COUNT0_RX_1_NUM_BLOCK_1_4            (0x40000000UL)          //--- Bit 4

#define USB_COUNT0_RX_1_BLSIZE_1                 (0x80000000UL)          //--- BLock SIZE (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT1_RX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT1_RX_0_COUNT1_RX_0              (0x000003FFUL)          //--- Reception Byte Count (low)

#define USB_COUNT1_RX_0_NUM_BLOCK_0              (0x00007C00UL)          //--- NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
#define USB_COUNT1_RX_0_NUM_BLOCK_0_0            (0x00000400UL)          //--- Bit 0
#define USB_COUNT1_RX_0_NUM_BLOCK_0_1            (0x00000800UL)          //--- Bit 1
#define USB_COUNT1_RX_0_NUM_BLOCK_0_2            (0x00001000UL)          //--- Bit 2
#define USB_COUNT1_RX_0_NUM_BLOCK_0_3            (0x00002000UL)          //--- Bit 3
#define USB_COUNT1_RX_0_NUM_BLOCK_0_4            (0x00004000UL)          //--- Bit 4

#define USB_COUNT1_RX_0_BLSIZE_0                 (0x00008000UL)          //--- BLock SIZE (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT1_RX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT1_RX_1_COUNT1_RX_1              (0x03FF0000UL)          //--- Reception Byte Count (high)

#define USB_COUNT1_RX_1_NUM_BLOCK_1              (0x7C000000UL)          //--- NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
#define USB_COUNT1_RX_1_NUM_BLOCK_1_0            (0x04000000UL)          //--- Bit 0
#define USB_COUNT1_RX_1_NUM_BLOCK_1_1            (0x08000000UL)          //--- Bit 1
#define USB_COUNT1_RX_1_NUM_BLOCK_1_2            (0x10000000UL)          //--- Bit 2
#define USB_COUNT1_RX_1_NUM_BLOCK_1_3            (0x20000000UL)          //--- Bit 3
#define USB_COUNT1_RX_1_NUM_BLOCK_1_4            (0x40000000UL)          //--- Bit 4

#define USB_COUNT1_RX_1_BLSIZE_1                 (0x80000000UL)          //--- BLock SIZE (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT2_RX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT2_RX_0_COUNT2_RX_0              (0x000003FFUL)          //--- Reception Byte Count (low)

#define USB_COUNT2_RX_0_NUM_BLOCK_0              (0x00007C00UL)          //--- NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
#define USB_COUNT2_RX_0_NUM_BLOCK_0_0            (0x00000400UL)          //--- Bit 0
#define USB_COUNT2_RX_0_NUM_BLOCK_0_1            (0x00000800UL)          //--- Bit 1
#define USB_COUNT2_RX_0_NUM_BLOCK_0_2            (0x00001000UL)          //--- Bit 2
#define USB_COUNT2_RX_0_NUM_BLOCK_0_3            (0x00002000UL)          //--- Bit 3
#define USB_COUNT2_RX_0_NUM_BLOCK_0_4            (0x00004000UL)          //--- Bit 4

#define USB_COUNT2_RX_0_BLSIZE_0                 (0x00008000UL)          //--- BLock SIZE (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT2_RX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT2_RX_1_COUNT2_RX_1              (0x03FF0000UL)          //--- Reception Byte Count (high)

#define USB_COUNT2_RX_1_NUM_BLOCK_1              (0x7C000000UL)          //--- NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
#define USB_COUNT2_RX_1_NUM_BLOCK_1_0            (0x04000000UL)          //--- Bit 0
#define USB_COUNT2_RX_1_NUM_BLOCK_1_1            (0x08000000UL)          //--- Bit 1
#define USB_COUNT2_RX_1_NUM_BLOCK_1_2            (0x10000000UL)          //--- Bit 2
#define USB_COUNT2_RX_1_NUM_BLOCK_1_3            (0x20000000UL)          //--- Bit 3
#define USB_COUNT2_RX_1_NUM_BLOCK_1_4            (0x40000000UL)          //--- Bit 4

#define USB_COUNT2_RX_1_BLSIZE_1                 (0x80000000UL)          //--- BLock SIZE (high)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT3_RX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT3_RX_0_COUNT3_RX_0              (0x000003FFUL)          //--- Reception Byte Count (low)

#define USB_COUNT3_RX_0_NUM_BLOCK_0              (0x00007C00UL)          //--- NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
#define USB_COUNT3_RX_0_NUM_BLOCK_0_0            (0x00000400UL)          //--- Bit 0
#define USB_COUNT3_RX_0_NUM_BLOCK_0_1            (0x00000800UL)          //--- Bit 1
#define USB_COUNT3_RX_0_NUM_BLOCK_0_2            (0x00001000UL)          //--- Bit 2
#define USB_COUNT3_RX_0_NUM_BLOCK_0_3            (0x00002000UL)          //--- Bit 3
#define USB_COUNT3_RX_0_NUM_BLOCK_0_4            (0x00004000UL)          //--- Bit 4

#define USB_COUNT3_RX_0_BLSIZE_0                 (0x00008000UL)          //--- BLock SIZE (low)

//---------------------------------------------------------------------------------------------
//--- Bit definition for USB_COUNT3_RX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT3_RX_1_COUNT3_RX_1              (0x03FF0000UL)          //--- Reception Byte Count (high)

