Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
#define USB_COUNT6_RX_1_NUM_BLOCK_1              (0x7C000000UL)          //--- NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
#define USB_COUNT6_RX_1_NUM_BLOCK_1_0            (0x04000000UL)          //--- Bit 0
#define USB_COUNT6_RX_1_NUM_BLOCK_1_1            (0x08000000UL)          //--- Bit 1
#define USB_COUNT6_RX_1_NUM_BLOCK_1_2            (0x10000000UL)          //--- Bit 2
#define USB_COUNT6_RX_1_NUM_BLOCK_1_3            (0x20000000UL)          //--- Bit 3
#define USB_COUNT6_RX_1_NUM_BLOCK_1_4            (0x40000000UL)          //--- Bit 4

#define USB_COUNT6_RX_1_BLSIZE_1                 (0x80000000UL)          //--- BLock SIZE (high)

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT7_RX_0 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT7_RX_0_COUNT7_RX_0              (0x000003FFUL)          //--- Reception Byte Count (low)

#define USB_COUNT7_RX_0_NUM_BLOCK_0              (0x00007C00UL)          //--- NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
#define USB_COUNT7_RX_0_NUM_BLOCK_0_0            (0x00000400UL)          //--- Bit 0
#define USB_COUNT7_RX_0_NUM_BLOCK_0_1            (0x00000800UL)          //--- Bit 1
#define USB_COUNT7_RX_0_NUM_BLOCK_0_2            (0x00001000UL)          //--- Bit 2
#define USB_COUNT7_RX_0_NUM_BLOCK_0_3            (0x00002000UL)          //--- Bit 3
#define USB_COUNT7_RX_0_NUM_BLOCK_0_4            (0x00004000UL)          //--- Bit 4

#define USB_COUNT7_RX_0_BLSIZE_0                 (0x00008000UL)          //--- BLock SIZE (low)

//---------------------------------------------------------------------------------------------
//---  Bit definition for USB_COUNT7_RX_1 register
//---------------------------------------------------------------------------------------------
#define USB_COUNT7_RX_1_COUNT7_RX_1              (0x03FF0000UL)          //--- Reception Byte Count (high)

#define USB_COUNT7_RX_1_NUM_BLOCK_1              (0x7C000000UL)          //--- NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
#define USB_COUNT7_RX_1_NUM_BLOCK_1_0            (0x04000000UL)          //--- Bit 0
#define USB_COUNT7_RX_1_NUM_BLOCK_1_1            (0x08000000UL)          //--- Bit 1
#define USB_COUNT7_RX_1_NUM_BLOCK_1_2            (0x10000000UL)          //--- Bit 2
#define USB_COUNT7_RX_1_NUM_BLOCK_1_3            (0x20000000UL)          //--- Bit 3
#define USB_COUNT7_RX_1_NUM_BLOCK_1_4            (0x40000000UL)          //--- Bit 4

#define USB_COUNT7_RX_1_BLSIZE_1                 (0x80000000UL)          //--- BLock SIZE (high)


//---------------------------------------------------------------------------------------------
//---   ADC Instances
//---------------------------------------------------------------------------------------------
#define IS_ADC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC1_COMMON)

//---------------------------------------------------------------------------------------------
//--- CAN Instances
//---------------------------------------------------------------------------------------------
#define IS_CAN_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CAN1)

//---------------------------------------------------------------------------------------------
//--- COMP Instances
//---------------------------------------------------------------------------------------------
#define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1) || \
                                        ((INSTANCE) == COMP2))

#define IS_COMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == COMP12_COMMON)

//---------------------------------------------------------------------------------------------
//--- COMP Instances with window mode capability
//---------------------------------------------------------------------------------------------
#define IS_COMP_WINDOWMODE_INSTANCE(INSTANCE) ((INSTANCE) == COMP2)

//---------------------------------------------------------------------------------------------
//---   CRC Instances
//---------------------------------------------------------------------------------------------
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

//---------------------------------------------------------------------------------------------
//---   DAC Instances
//---------------------------------------------------------------------------------------------
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)

//---------------------------------------------------------------------------------------------
//--- DMA Instances
//---------------------------------------------------------------------------------------------
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Channel1) || \
                                       ((INSTANCE) == DMA1_Channel2) || \
                                       ((INSTANCE) == DMA1_Channel3) || \
                                       ((INSTANCE) == DMA1_Channel4) || \
                                       ((INSTANCE) == DMA1_Channel5) || \
                                       ((INSTANCE) == DMA1_Channel6) || \
                                       ((INSTANCE) == DMA1_Channel7) || \
                                       ((INSTANCE) == DMA2_Channel1) || \
                                       ((INSTANCE) == DMA2_Channel2) || \
                                       ((INSTANCE) == DMA2_Channel3) || \
                                       ((INSTANCE) == DMA2_Channel4) || \
                                       ((INSTANCE) == DMA2_Channel5) || \
                                       ((INSTANCE) == DMA2_Channel6) || \
                                       ((INSTANCE) == DMA2_Channel7))

//---------------------------------------------------------------------------------------------
//--- GPIO Instances
//---------------------------------------------------------------------------------------------
#define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA) || \
                                        ((INSTANCE) == GPIOB) || \
                                        ((INSTANCE) == GPIOC) || \
                                        ((INSTANCE) == GPIOH))

//---------------------------------------------------------------------------------------------
//--- GPIO AF Instances
//--- On L4, all GPIO Bank support AF
//---------------------------------------------------------------------------------------------
#define IS_GPIO_AF_INSTANCE(INSTANCE)   IS_GPIO_ALL_INSTANCE(INSTANCE)

//---------------------------------------------------------------------------------------------
//--- GPIO Lock Instances
//--- On L4, all GPIO Bank support the Lock mechanism
//---------------------------------------------------------------------------------------------
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)

//---------------------------------------------------------------------------------------------
//---  I2C Instances
//---------------------------------------------------------------------------------------------
#define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                       ((INSTANCE) == I2C3))

//---------------------------------------------------------------------------------------------
//---  I2C Instances : wakeup capability from stop modes
//---------------------------------------------------------------------------------------------
#define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)

//---------------------------------------------------------------------------------------------
//--- OPAMP Instances
//---------------------------------------------------------------------------------------------
#define IS_OPAMP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == OPAMP1)

#define IS_OPAMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == OPAMP1_COMMON)

//---------------------------------------------------------------------------------------------
//---  QSPI Instances
//---------------------------------------------------------------------------------------------
#define IS_QSPI_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == QUADSPI)

//---------------------------------------------------------------------------------------------
//--- RNG Instances
//---------------------------------------------------------------------------------------------
#define IS_RNG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RNG)

//---------------------------------------------------------------------------------------------
//--- RTC Instances
//---------------------------------------------------------------------------------------------
#define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)

//---------------------------------------------------------------------------------------------
//--- SAI Instances
//---------------------------------------------------------------------------------------------
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A) || \
                                       ((INSTANCE) == SAI1_Block_B))

//---------------------------------------------------------------------------------------------
//--- SMBUS Instances
//---------------------------------------------------------------------------------------------
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                         ((INSTANCE) == I2C3))

//---------------------------------------------------------------------------------------------
//--- SPI Instances
//---------------------------------------------------------------------------------------------
#define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1) || \
                                       ((INSTANCE) == SPI3))

//---------------------------------------------------------------------------------------------
//--- SWPMI Instances
//---------------------------------------------------------------------------------------------
#define IS_SWPMI_INSTANCE(INSTANCE)  ((INSTANCE) == SWPMI1)

//---------------------------------------------------------------------------------------------
//---  LPTIM Instances : All supported instances
//---------------------------------------------------------------------------------------------
#define IS_LPTIM_INSTANCE(INSTANCE)     (((INSTANCE) == LPTIM1) || \
                                         ((INSTANCE) == LPTIM2))

//---------------------------------------------------------------------------------------------
//---  LPTIM Instances : supporting the encoder mode
//---------------------------------------------------------------------------------------------
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE) ((INSTANCE) == LPTIM1)

//---------------------------------------------------------------------------------------------
//---  TIM Instances : All supported instances
//---------------------------------------------------------------------------------------------
#define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM2)   || \
                                         ((INSTANCE) == TIM6)   || \
                                         ((INSTANCE) == TIM7)   || \
                                         ((INSTANCE) == TIM15)  || \
                                         ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting 32 bits counter
//---------------------------------------------------------------------------------------------
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) ((INSTANCE) == TIM2)

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting the break function
//---------------------------------------------------------------------------------------------
#define IS_TIM_BREAK_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)    || \
                                            ((INSTANCE) == TIM15)   || \
                                            ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting Break source selection
//---------------------------------------------------------------------------------------------
#define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                               ((INSTANCE) == TIM15)  || \
                                               ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting 2 break inputs
//---------------------------------------------------------------------------------------------
#define IS_TIM_BKIN2_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1)

//---------------------------------------------------------------------------------------------
//--- TIM Instances : at least 1 capture/compare channel
//---------------------------------------------------------------------------------------------
#define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM2)   || \
                                         ((INSTANCE) == TIM15)  || \
                                         ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : at least 2 capture/compare channels
//---------------------------------------------------------------------------------------------
#define IS_TIM_CC2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM2)   || \
                                         ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : at least 3 capture/compare channels
//---------------------------------------------------------------------------------------------
#define IS_TIM_CC3_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : at least 4 capture/compare channels
//---------------------------------------------------------------------------------------------
#define IS_TIM_CC4_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                         ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : at least 5 capture/compare channels
//---------------------------------------------------------------------------------------------
#define IS_TIM_CC5_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1)

//---------------------------------------------------------------------------------------------
//---  TIM Instances : at least 6 capture/compare channels
//---------------------------------------------------------------------------------------------
#define IS_TIM_CC6_INSTANCE(INSTANCE)   ((INSTANCE) == TIM1)

//---------------------------------------------------------------------------------------------
//--- TIM Instances : DMA requests generation (TIMx_DIER.COMDE)
//---------------------------------------------------------------------------------------------
#define IS_TIM_CCDMA_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)   || \
                                            ((INSTANCE) == TIM15)  || \
                                            ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : DMA requests generation (TIMx_DIER.UDE)
//---------------------------------------------------------------------------------------------
#define IS_TIM_DMA_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)   || \
                                            ((INSTANCE) == TIM2)   || \
                                            ((INSTANCE) == TIM6)   || \
                                            ((INSTANCE) == TIM7)   || \
                                            ((INSTANCE) == TIM15)  || \
                                            ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : DMA requests generation (TIMx_DIER.CCxDE)
//---------------------------------------------------------------------------------------------
#define IS_TIM_DMA_CC_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                            ((INSTANCE) == TIM2)   || \
                                            ((INSTANCE) == TIM15)  || \
                                            ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//----TIM Instances : DMA burst feature
//---------------------------------------------------------------------------------------------
#define IS_TIM_DMABURST_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                            ((INSTANCE) == TIM2)   || \
                                            ((INSTANCE) == TIM15)  || \
                                            ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : output(s) available
//---------------------------------------------------------------------------------------------
#define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL) \
    ((((INSTANCE) == TIM1) &&                  \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2) ||          \
      ((CHANNEL) == TIM_CHANNEL_3) ||          \
      ((CHANNEL) == TIM_CHANNEL_4) ||          \
      ((CHANNEL) == TIM_CHANNEL_5) ||          \
      ((CHANNEL) == TIM_CHANNEL_6)))           \
     ||                                        \
     (((INSTANCE) == TIM2) &&                  \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2) ||          \
      ((CHANNEL) == TIM_CHANNEL_3) ||          \
      ((CHANNEL) == TIM_CHANNEL_4)))           \
     ||                                        \
     (((INSTANCE) == TIM15) &&                 \
     (((CHANNEL) == TIM_CHANNEL_1) ||          \
      ((CHANNEL) == TIM_CHANNEL_2)))           \
     ||                                        \
     (((INSTANCE) == TIM16) &&                 \
     (((CHANNEL) == TIM_CHANNEL_1))))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting complementary output(s)
//---------------------------------------------------------------------------------------------
#define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL) \
   ((((INSTANCE) == TIM1) &&                    \
     (((CHANNEL) == TIM_CHANNEL_1) ||           \
      ((CHANNEL) == TIM_CHANNEL_2) ||           \
      ((CHANNEL) == TIM_CHANNEL_3)))            \
    ||                                          \
    (((INSTANCE) == TIM15) &&                   \
     ((CHANNEL) == TIM_CHANNEL_1))              \
    ||                                          \
    (((INSTANCE) == TIM16) &&                   \
     ((CHANNEL) == TIM_CHANNEL_1)))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting clock division
//---------------------------------------------------------------------------------------------
#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)    || \
                                                    ((INSTANCE) == TIM2)    || \
                                                    ((INSTANCE) == TIM15)   || \
                                                    ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : supporting external clock mode 1 for ETRF input
//---------------------------------------------------------------------------------------------
#define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE) (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2) || \
                                                        ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : supporting external clock mode 2 for ETRF input
//---------------------------------------------------------------------------------------------
#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE) (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting external clock mode 1 for TIX inputs
//---------------------------------------------------------------------------------------------
#define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2) || \
                                                        ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting internal trigger inputs(ITRX)
//---------------------------------------------------------------------------------------------
#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)     (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2) || \
                                                        ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting combined 3-phase PWM mode
//---------------------------------------------------------------------------------------------
#define IS_TIM_COMBINED3PHASEPWM_INSTANCE(INSTANCE) ((INSTANCE) == TIM1)

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting commutation event generation
//---------------------------------------------------------------------------------------------
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                     ((INSTANCE) == TIM15)  || \
                                                     ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting counting mode selection
//---------------------------------------------------------------------------------------------
#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1) || \
                                                        ((INSTANCE) == TIM2))

