Quorbinc/Q-32_skeleton_code/rtos/STM32L432_BitDefs.h
//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting encoder interface
//---------------------------------------------------------------------------------------------
#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                                      ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting Hall sensor interface
//---------------------------------------------------------------------------------------------
#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1) || \
                                                          ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//----TIM Instances : external trigger input available
//---------------------------------------------------------------------------------------------
#define IS_TIM_ETR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : supporting ETR source selection
//---------------------------------------------------------------------------------------------
#define IS_TIM_ETRSEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                             ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : Master mode available (TIMx_CR2.MMS available )
//---------------------------------------------------------------------------------------------
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2)  || \
                                            ((INSTANCE) == TIM6)  || \
                                            ((INSTANCE) == TIM7)  || \
                                            ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//--- TIM Instances : Slave mode available (TIMx_SMCR available )
//---------------------------------------------------------------------------------------------
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2)  || \
                                            ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting OCxREF clear
//---------------------------------------------------------------------------------------------
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)        (((INSTANCE) == TIM1) || \
                                                       ((INSTANCE) == TIM2))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : remapping capability
//---------------------------------------------------------------------------------------------
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2)  || \
                                            ((INSTANCE) == TIM15) || \
                                            ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting repetition counter
//---------------------------------------------------------------------------------------------
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)  || \
                                                       ((INSTANCE) == TIM15) || \
                                                       ((INSTANCE) == TIM16))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting synchronization
//---------------------------------------------------------------------------------------------
#define IS_TIM_SYNCHRO_INSTANCE(INSTANCE)  IS_TIM_MASTER_INSTANCE(INSTANCE)

//---------------------------------------------------------------------------------------------
//---  TIM Instances : supporting ADC triggering through TRGO2
//---------------------------------------------------------------------------------------------
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1)

//---------------------------------------------------------------------------------------------
//--- TIM Instances : Timer input XOR function
//---------------------------------------------------------------------------------------------
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)   || \
                                            ((INSTANCE) == TIM2)   || \
                                            ((INSTANCE) == TIM15))

//---------------------------------------------------------------------------------------------
//---  TIM Instances : Advanced timer instances
//---------------------------------------------------------------------------------------------
#define IS_TIM_ADVANCED_INSTANCE(INSTANCE)    ((INSTANCE) == TIM1)

//---------------------------------------------------------------------------------------------
//--- TSC Instances
//---------------------------------------------------------------------------------------------
#define IS_TSC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == TSC)

//---------------------------------------------------------------------------------------------
//----USART Instances : Synchronous mode
//---------------------------------------------------------------------------------------------
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2))

//---------------------------------------------------------------------------------------------
//----UART Instances : Asynchronous mode
//---------------------------------------------------------------------------------------------
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2))

//---------------------------------------------------------------------------------------------
//---  UART Instances : Auto Baud Rate detection
//---------------------------------------------------------------------------------------------
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                            ((INSTANCE) == USART2))

//---------------------------------------------------------------------------------------------
//---  UART Instances : Driver Enable
//---------------------------------------------------------------------------------------------
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE)     (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == LPUART1))

//---------------------------------------------------------------------------------------------
//--- UART Instances : Half-Duplex mode
//---------------------------------------------------------------------------------------------
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                 ((INSTANCE) == USART2) || \
                                                 ((INSTANCE) == LPUART1))

//---------------------------------------------------------------------------------------------
//---  UART Instances : Hardware Flow control
//---------------------------------------------------------------------------------------------
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == LPUART1))

//---------------------------------------------------------------------------------------------
//----UART Instances : LIN mode
//---------------------------------------------------------------------------------------------
#define IS_UART_LIN_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                          ((INSTANCE) == USART2))

//---------------------------------------------------------------------------------------------
//----UART Instances : Wake-up from Stop mode
//---------------------------------------------------------------------------------------------
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == LPUART1))

//---------------------------------------------------------------------------------------------
//---  UART Instances : IRDA mode
//---------------------------------------------------------------------------------------------
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2))

//---------------------------------------------------------------------------------------------
//---  USART Instances : Smart card mode
//---------------------------------------------------------------------------------------------
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == USART2))

//---------------------------------------------------------------------------------------------
//--- LPUART Instance
//---------------------------------------------------------------------------------------------
#define IS_LPUART_INSTANCE(INSTANCE)    ((INSTANCE) == LPUART1)

//---------------------------------------------------------------------------------------------
//--- IWDG Instances
//---------------------------------------------------------------------------------------------
#define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG)

//---------------------------------------------------------------------------------------------
//--- WWDG Instances
//---------------------------------------------------------------------------------------------
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

//---------------------------------------------------------------------------------------------
//---  USB Instances
//---------------------------------------------------------------------------------------------
#define IS_USB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB)
#define IS_PCD_ALL_INSTANCE           IS_USB_ALL_INSTANCE

//---------------------------------------------------------------------------------------------
//  For a painless codes migration between the STM32L4xx device product
//  lines, the aliases defined below are put in place to overcome the
//  differences in the interrupt handlers and IRQn definitions.
//  No need to update developed interrupt code when moving across
//  product lines within the same STM32L4 Family
//---------------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
//--- Aliases for __IRQn
//---------------------------------------------------------------------------------------------
#define TIM6_IRQn                      TIM6_DAC_IRQn
#define ADC1_2_IRQn                    ADC1_IRQn
#define TIM1_TRG_COM_TIM17_IRQn        TIM1_TRG_COM_IRQn
#define HASH_RNG_IRQn                  RNG_IRQn
#define HASH_CRS_IRQn                  CRS_IRQn
#define USB_FS_IRQn                    USB_IRQn

//---------------------------------------------------------------------------------------------
//--- Aliases for __IRQHandler
//---------------------------------------------------------------------------------------------
#define fnTIM6_IRQHandler                fnTIM6_DAC_IRQHandler
#define fnADC1_2_IRQHandler              fnADC1_IRQHandler
#define fnTIM1_TRG_COM_TIM17_IRQHandler  fnTIM1_TRG_COM_IRQHandler
#define fnHASH_RNG_IRQHandler            fnRNG_IRQHandler
#define fnHASH_CRS_IRQHandler            fnCRS_IRQHandler
#define fnUSB_FS_IRQHandler              fnUSB_IRQHandler

